[
  {
    "english": "academia",
    "chinese": "学术界",
    "example": "The debate over the artifact's origin has sparked interest in both academia and the public."
  },
  {
    "english": "genre",
    "chinese": "体裁，流派",
    "example": "This pottery style represents a unique genre within ancient ceramic art."
  },
  {
    "english": "subversive",
    "chinese": "颠覆性的",
    "example": "The artist's subversive use of clay challenged traditional pottery techniques."
  },
  {
    "english": "exotic",
    "chinese": "来自异国的，奇异的",
    "example": "Exotic pigments made from ground quartz were traded across ancient civilizations."
  },
  {
    "english": "distinction",
    "chinese": "区分",
    "example": "There's a clear distinction between pottery made for domestic use and ceremonial artifacts."
  },
  {
    "english": "gadget",
    "chinese": "小装置",
    "example": "Archaeologists found a mysterious gadget used to mold clay beads."
  },
  {
    "english": "metaphor",
    "chinese": "隐喻，比喻说法",
    "example": "The triangle symbol in the rendering is a metaphor for the dichotomy of life and death."
  },
  {
    "english": "media",
    "chinese": "媒介（复数形式）",
    "example": "Ancient artists used various media, from clay to precious metals, for jewelry making."
  },
  {
    "english": "clay",
    "chinese": "黏土",
    "example": "High-quality clay with fine quartz particles was prized for pottery."
  },
  {
    "english": "pottery",
    "chinese": "陶器",
    "example": "The pottery's exterior was decorated with intricate bead patterns."
  },
  {
    "english": "ground",
    "chinese": "磨碎的（grind 的过去分词）",
    "example": "Ground calcium was added to the clay as a strengthening ingredient."
  },
  {
    "english": "quartz",
    "chinese": "石英",
    "example": "Crushed quartz gave the pottery a distinctively sparkling glaze."
  },
  {
    "english": "mold",
    "chinese": "模具",
    "example": "A ceramic mold was used to shape the beads for jewelry."
  },
  {
    "english": "glaze",
    "chinese": "釉",
    "example": "The blue glaze on the pottery symbolizes the ocean in ancient folklore."
  },
  {
    "english": "ingredient",
    "chinese": "原料，因素",
    "example": "The secret ingredient in the glaze was a rare mineral found only in exotic regions."
  },
  {
    "english": "exterior",
    "chinese": "外部",
    "example": "The exterior of the artifact is decorated with symbolic animal figures."
  },
  {
    "english": "bead",
    "chinese": "珠子",
    "example": "Each bead was carefully crafted and strung into valuable jewelry."
  },
  {
    "english": "jewelry",
    "chinese": "珠宝",
    "example": "Archaeologists unearthed a trove of ancient jewelry made from precious metals."
  },
  {
    "english": "artifact",
    "chinese": "手工制品",
    "example": "This artifact provides invaluable insight into the region's ancient craft traditions."
  },
  {
    "english": "craft",
    "chinese": "制作",
    "example": "The craft of pottery making has been passed down for generations."
  },
  {
    "english": "invaluable",
    "chinese": "非常宝贵的",
    "example": "The scroll contains invaluable information about ancient glazing techniques."
  },
  {
    "english": "insight",
    "chinese": "洞察，独到见解",
    "example": "Studying the artifact gave researchers new insight into ancient trade routes."
  },
  {
    "english": "calcium",
    "chinese": "钙",
    "example": "Calcium carbonate in the clay made the pottery more durable."
  },
  {
    "english": "prominently",
    "chinese": "重要的，显眼的",
    "example": "The artist's signature is prominently displayed on the pottery's base."
  },
  {
    "english": "rendering",
    "chinese": "描绘",
    "example": "The rendering on the pottery depicts a mythical creature from ancient lore."
  },
  {
    "english": "dichotomy",
    "chinese": "对立",
    "example": "The painting explores the dichotomy between solitude and community."
  },
  {
    "english": "filter",
    "chinese": "透过，传入",
    "example": "Sunlight filters through the window, highlighting the pottery's intricate details."
  },
  {
    "english": "counter",
    "chinese": "反驳，反击",
    "example": "Scholars counter the theory by pointing to similar artifacts found elsewhere."
  },
  {
    "english": "solitude",
    "chinese": "独处",
    "example": "The artist often sought solitude to focus on creating detailed renderings."
  },
  {
    "english": "distinctively",
    "chinese": "特别地",
    "example": "The pottery is distinctively decorated with geometric patterns."
  },
  {
    "english": "trace",
    "chinese": "痕迹",
    "example": "Traces of blue glaze suggest the artifact was once part of a larger set."
  },
  {
    "english": "domestic",
    "chinese": "家庭的",
    "example": "Most pottery found in the village was for domestic use, such as cooking and storage."
  },
  {
    "english": "triangle",
    "chinese": "三角形",
    "example": "Triangles are a common motif in the region's ancient art, symbolizing strength."
  },
  {
    "english": "obscure",
    "chinese": "掩盖",
    "example": "Dirt and debris obscure the artifact's intricate carvings."
  },
  {
    "english": "symbolize",
    "chinese": "象征，代表",
    "example": "In this culture, the color red symbolizes good fortune and prosperity."
  },
  {
    "english": "special effect",
    "chinese": "特效",
    "example": "The exhibition uses special effects to recreate ancient craft techniques."
  },
  {
    "english": "worthy of",
    "chinese": "值得",
    "example": "This artifact is worthy of further study to understand its cultural significance."
  },
  {
    "english": "figure out",
    "chinese": "搞清楚",
    "example": "Scientists are trying to figure out the purpose of the mysterious gadget."
  },
  {
    "english": "flock to",
    "chinese": "蜂拥而至",
    "example": "Art enthusiasts flocked to the museum to see the rare ancient pottery exhibition."
  }
]