[
  {
    "english": "scenario",
    "chinese": "情景，场景",
    "example": "The professor described a scenario where students must solve a community problem in their project."
  },
  {
    "english": "reserve",
    "chinese": "预订，保留",
    "example": "You should reserve a spot for the open house session before the deadline."
  },
  {
    "english": "reproduce",
    "chinese": "复制，再现",
    "example": "The experiment aims to reproduce the results of a previous study on climate change."
  },
  {
    "english": "experiment",
    "chinese": "实验",
    "example": "Students in the science class will conduct an experiment on plant growth."
  },
  {
    "english": "journalism",
    "chinese": "新闻业",
    "example": "She majors in journalism to pursue a career in investigative reporting."
  },
  {
    "english": "orchestra",
    "chinese": "管弦乐队",
    "example": "The university orchestra will hold a concert next month on campus."
  },
  {
    "english": "anthropology",
    "chinese": "人类学",
    "example": "Anthropology courses often include fieldwork in different communities."
  },
  {
    "english": "Peruvian",
    "chinese": "秘鲁的",
    "example": "The lecture will focus on Peruvian culture and its historical influences."
  },
  {
    "english": "exception",
    "chinese": "例外",
    "example": "Most courses require a midterm exam, but this one is an exception."
  },
  {
    "english": "eligible",
    "chinese": "符合条件的，有资格的",
    "example": "Only students with a GPA over 3.0 are eligible for the study-abroad program."
  },
  {
    "english": "calculus",
    "chinese": "微积分",
    "example": "Calculus is a required course for many engineering and science majors."
  },
  {
    "english": "restrict",
    "chinese": "限制",
    "example": "The lab restricts access to certain equipment for safety reasons."
  },
  {
    "english": "compatible",
    "chinese": "兼容的",
    "example": "Make sure your schedule is compatible with the tutoring center's hours."
  },
  {
    "english": "deposit",
    "chinese": "押金，定金",
    "example": "You need to pay a refundable deposit when renting campus housing."
  },
  {
    "english": "accommodate",
    "chinese": "容纳，适应",
    "example": "The dormitory can accommodate up to 200 students per building."
  },
  {
    "english": "opposite",
    "chinese": "相反的",
    "example": "The library is on the opposite side of campus from the science building."
  },
  {
    "english": "excessive",
    "chinese": "过多的，过度的",
    "example": "Excessive use of electric heaters may lead to higher utility bills."
  },
  {
    "english": "conduct",
    "chinese": "组织，实施",
    "example": "The anthropology department will conduct a survey on campus culture."
  },
  {
    "english": "moth",
    "chinese": "蛾子",
    "example": "The biology experiment studies how moths use camouflage for protection."
  },
  {
    "english": "audition",
    "chinese": "试镜，试听",
    "example": "She prepared for weeks before the orchestra audition."
  },
  {
    "english": "camouflage",
    "chinese": "伪装",
    "example": "The research project focuses on how insects use camouflage in different scenarios."
  },
  {
    "english": "procedure",
    "chinese": "程序，步骤",
    "example": "Follow the registration procedure carefully to avoid mistakes."
  },
  {
    "english": "refundable",
    "chinese": "可退还的",
    "example": "The deposit for the housing is refundable at the end of the academic year."
  },
  {
    "english": "submit",
    "chinese": "提交",
    "example": "Submit your notification form to the housing maintenance office by Friday."
  },
  {
    "english": "initiate",
    "chinese": "开始，发起",
    "example": "The university will initiate a new program to support local communities."
  },
  {
    "english": "poet",
    "chinese": "诗人",
    "example": "The journalism class invited a local poet to give a lecture."
  },
  {
    "english": "penalty",
    "chinese": "罚款，处罚",
    "example": "There's a penalty for late submission of the application deadline."
  },
  {
    "english": "approach",
    "chinese": "接近，处理方法",
    "example": "This course takes a new approach to teaching calculus."
  },
  {
    "english": "guarantee",
    "chinese": "保证",
    "example": "The university guarantees housing for all first-year students."
  },
  {
    "english": "arrange",
    "chinese": "安排",
    "example": "We need to arrange a time to meet with the academic advisor."
  },
  {
    "english": "on a regular basis",
    "chinese": "定期地",
    "example": "The tutoring center offers sessions on a regular basis throughout the semester."
  },
  {
    "english": "electric heaters",
    "chinese": "电加热器",
    "example": "Using electric heaters in dorms is restricted due to fire safety concerns."
  },
  {
    "english": "major in...",
    "chinese": "主修……",
    "example": "She decided to major in anthropology after studying Peruvian culture."
  },
  {
    "english": "be credited to your account",
    "chinese": "存入您的账户",
    "example": "The refund will be credited to your account within 5-7 business days."
  },
  {
    "english": "roommate preference card",
    "chinese": "室友偏好卡",
    "example": "Fill out the roommate preference card to indicate your living habits."
  },
  {
    "english": "registration fee",
    "chinese": "注册费",
    "example": "The registration fee must be paid before the start of the academic year."
  },
  {
    "english": "notification form",
    "chinese": "通知表",
    "example": "Submit the notification form to apply for the discounted membership card."
  },
  {
    "english": "discounted membership card",
    "chinese": "折扣会员卡",
    "example": "Show your discounted membership card at the bookstore for a 10% discount."
  },
  {
    "english": "housing maintenance office",
    "chinese": "房屋维修办公室",
    "example": "Report any issues to the housing maintenance office immediately."
  },
  {
    "english": "background knowledge",
    "chinese": "背景知识",
    "example": "Having some background knowledge in calculus will help with this course."
  },
  {
    "english": "head for...",
    "chinese": "前往……",
    "example": "After class, we'll head for the tutoring center for extra help."
  },
  {
    "english": "tutoring center",
    "chinese": "辅导中心",
    "example": "The tutoring center provides free academic support for all students."
  },
  {
    "english": "application deadline",
    "chinese": "申请截止日期",
    "example": "Don't miss the application deadline for the study-abroad program."
  },
  {
    "english": "open house session",
    "chinese": "开放参观日",
    "example": "The open house session is a great chance to tour the campus and meet professors."
  },
  {
    "english": "research project",
    "chinese": "研究项目",
    "example": "Students in anthropology will work on a research project about local communities."
  },
  {
    "english": "academic year",
    "chinese": "学年",
    "example": "The academic year starts in September and ends in June."
  },
  {
    "english": "study-abroad program",
    "chinese": "留学项目",
    "example": "She applied for a study-abroad program in Peru to study local culture."
  },
  {
    "english": "surrounding communities",
    "chinese": "周边社区",
    "example": "The university works closely with surrounding communities on various projects."
  },
  {
    "english": "report on...",
    "chinese": "关于……的报告",
    "example": "Students are required to write a report on their research project findings."
  }
]