[
  {
    "english": "crush",
    "chinese": "压碎；碾碎",
    "example": "Artists crush minerals to create fine powders for making pigments."
  },
  {
    "english": "yield",
    "chinese": "产生",
    "example": "This stone yields a vibrant blue pigment when ground up."
  },
  {
    "english": "powder",
    "chinese": "粉末",
    "example": "Mix the pigment powder with oil to create paint suitable for sculpting."
  },
  {
    "english": "pour",
    "chinese": "倾倒",
    "example": "Carefully pour the molten metal into the mold to form a sculpture."
  },
  {
    "english": "mold (n.)",
    "chinese": "模具",
    "example": "The clay mold was used to shape the foundational structure of the statue."
  },
  {
    "english": "mold (v.)",
    "chinese": "塑造",
    "example": "Artists mold clay into intricate forms before firing it in a kiln."
  },
  {
    "english": "foundational",
    "chinese": "基础的",
    "example": "Understanding color theory is foundational to creating vibrant artworks."
  },
  {
    "english": "vision",
    "chinese": "视野",
    "example": "The artist's unique vision led to a revolutionary approach to sculpture."
  },
  {
    "english": "compass",
    "chinese": "指南针；罗盘",
    "example": "Ancient artists used a compass to ensure precise circular motions in their designs."
  },
  {
    "english": "apparently",
    "chinese": "显然地",
    "example": "Apparently, prehistoric humans used mammoth tusks to create tools for sculpting."
  },
  {
    "english": "flute",
    "chinese": "长笛",
    "example": "The sculpture depicts a figure playing a flute made from a bird's bone."
  },
  {
    "english": "predate",
    "chinese": "早于；在...之前",
    "example": "These cave paintings predate the invention of written language by thousands of years."
  },
  {
    "english": "mammoth",
    "chinese": "猛犸象",
    "example": "Scientists found a mammoth tusk carved into a decorative palette for mixing pigments."
  },
  {
    "english": "tusk",
    "chinese": "长牙",
    "example": "The tusk was polished to a translucent finish, revealing its natural patterns."
  },
  {
    "english": "translucent",
    "chinese": "半透明的",
    "example": "Translucent pigments were used to create a subtle glow in the painting's background."
  },
  {
    "english": "pigment",
    "chinese": "颜料",
    "example": "Natural pigments from rocks and plants were the primary ingredients in ancient paints."
  },
  {
    "english": "ingredient",
    "chinese": "成分",
    "example": "The artist carefully selected each ingredient for its color and texture."
  },
  {
    "english": "palette",
    "chinese": "调色板",
    "example": "The wooden palette held a variety of pigments arranged by hue and intensity."
  },
  {
    "english": "overview",
    "chinese": "概述",
    "example": "The lecture provided an overview of pigment-making techniques from ancient civilizations."
  },
  {
    "english": "portion",
    "chinese": "部分",
    "example": "A small portion of the pigment was mixed with water to create a wash for the painting."
  },
  {
    "english": "interpretation",
    "chinese": "解读",
    "example": "Art historians debate the symbolic interpretation of the animal figures in the cave art."
  },
  {
    "english": "nursery",
    "chinese": "婴儿房",
    "example": "The nursery wall was painted with soft colors and playful animal depictions."
  },
  {
    "english": "innocence",
    "chinese": "天真；无辜",
    "example": "The painting captures the innocence of children playing in a sunlit meadow."
  },
  {
    "english": "discernible",
    "chinese": "可辨认的",
    "example": "There is a discernible pattern in the way ancient artists applied pigment to cave walls."
  },
  {
    "english": "symbolic",
    "chinese": "象征性的",
    "example": "The use of red pigment in the painting has symbolic meaning related to life and energy."
  },
  {
    "english": "embrace",
    "chinese": "接受；采纳",
    "example": "Modern artists embrace traditional pigment-making techniques while adding new innovations."
  },
  {
    "english": "dome",
    "chinese": "圆顶",
    "example": "The dome of the chapel is painted with a celestial scene using vibrant pigments."
  },
  {
    "english": "colony",
    "chinese": "殖民地",
    "example": "Pigment trade routes were established between colonies to supply artists with rare colors."
  },
  {
    "english": "brush",
    "chinese": "刷子；画笔",
    "example": "A fine brush was used to add precise details to the miniature portrait."
  },
  {
    "english": "squish",
    "chinese": "压扁；挤压",
    "example": "Squish the clay into the mold to ensure it fills all the intricate spaces."
  },
  {
    "english": "shadow",
    "chinese": "阴影",
    "example": "The artist used darker pigments to create shadows and depth in the landscape."
  },
  {
    "english": "depict",
    "chinese": "描绘",
    "example": "The mural depicts a historical event using a blend of traditional and modern art styles."
  },
  {
    "english": "breeze",
    "chinese": "微风",
    "example": "The painting suggests a gentle breeze through the movement of the grass and trees."
  },
  {
    "english": "blend",
    "chinese": "混合",
    "example": "Blend the pigments together to achieve a smooth transition between colors."
  },
  {
    "english": "sculpt",
    "chinese": "雕刻",
    "example": "She began to sculpt the figure from marble, starting with the foundational form."
  },
  {
    "english": "spontaneous",
    "chinese": "自发的；自然的",
    "example": "The artist's spontaneous brushstrokes give the painting a sense of energy and movement."
  },
  {
    "english": "motion",
    "chinese": "运动；动作",
    "example": "The sculpture captures the dynamic motion of a dancer mid-twirl."
  },
  {
    "english": "precise",
    "chinese": "精确的；准确的",
    "example": "Precise measurements are crucial when mixing pigments to reproduce a specific color."
  },
  {
    "english": "ground up",
    "chinese": "磨碎",
    "example": "The minerals must be thoroughly ground up before being mixed with a binding agent."
  },
  {
    "english": "dawn on",
    "chinese": "逐渐明白；使突然意识到",
    "example": "It dawned on the artist that natural pigments could be replaced with synthetic ones for consistency."
  },
  {
    "english": "load up",
    "chinese": "装满",
    "example": "Load up the palette with all the necessary pigments before starting the painting."
  }
]