[
  {
    "english": "prominent",
    "chinese": "突出的，显著的",
    "example": "A prominent archaeologist led the team that discovered the ancient city."
  },
  {
    "english": "occupy",
    "chinese": "占据，居住",
    "example": "The site was occupied by a civilization over 2,000 years ago."
  },
  {
    "english": "document",
    "chinese": "记录",
    "example": "Scientists document every artifact found during the excavation process."
  },
  {
    "english": "lifetime",
    "chinese": "一生",
    "example": "The researcher dedicated her lifetime to studying ancient agricultural practices."
  },
  {
    "english": "funding",
    "chinese": "资金",
    "example": "The project received substantial funding to excavate the remote site."
  },
  {
    "english": "depict",
    "chinese": "描绘",
    "example": "Ancient cave paintings depict people cultivating wheat and other crops."
  },
  {
    "english": "preserve",
    "chinese": "保存",
    "example": "Special techniques are used to preserve fragile artifacts like pollen samples."
  },
  {
    "english": "locate",
    "chinese": "定位",
    "example": "Satellite technology helps locate ancient sites that are otherwise inaccessible."
  },
  {
    "english": "distinguish",
    "chinese": "区分",
    "example": "Experts can distinguish between different types of wheat based on their pollen composition."
  },
  {
    "english": "composition",
    "chinese": "成分",
    "example": "Analyzing the composition of soil reveals what crops were cultivated there."
  },
  {
    "english": "resistance",
    "chinese": "阻力",
    "example": "The team faced resistance when trying to access the undisturbed site."
  },
  {
    "english": "contact",
    "chinese": "接触",
    "example": "Archaeologists avoid direct contact with artifacts to prevent damage."
  },
  {
    "english": "simplification",
    "chinese": "简化",
    "example": "A simplification of the findings helps the public understand the research better."
  },
  {
    "english": "illustrate",
    "chinese": "说明",
    "example": "Diagrams illustrate how ancient people conducted electricity for their rituals."
  },
  {
    "english": "profile",
    "chinese": "轮廓",
    "example": "The profile of the hill revealed an ancient settlement beneath the surface."
  },
  {
    "english": "breakthrough",
    "chinese": "突破",
    "example": "The discovery of a new artifact was a major breakthrough for the team."
  },
  {
    "english": "retrieve",
    "chinese": "提取",
    "example": "Scientists retrieve pollen samples to study ancient plant life."
  },
  {
    "english": "reveal",
    "chinese": "揭示",
    "example": "The excavation revealed a well-preserved temple from a lost civilization."
  },
  {
    "english": "approximately",
    "chinese": "大约",
    "example": "Approximately 500 artifacts were found during the summer survey."
  },
  {
    "english": "pollen",
    "chinese": "花粉",
    "example": "Pollen grains in the soil indicate which plants were cultivated in the area."
  },
  {
    "english": "wheat",
    "chinese": "小麦",
    "example": "Ancient texts document the cultivation of wheat as a staple crop."
  },
  {
    "english": "cultivate",
    "chinese": "耕种",
    "example": "The civilization began to cultivate wheat around 5,000 years ago."
  },
  {
    "english": "artifact",
    "chinese": "文物",
    "example": "Each artifact is carefully cleaned and documented after being excavated."
  },
  {
    "english": "hypothesize",
    "chinese": "假设",
    "example": "Researchers hypothesize that the site was used for religious ceremonies."
  },
  {
    "english": "remote",
    "chinese": "偏远的",
    "example": "The remote location of the site kept it undisturbed for centuries."
  },
  {
    "english": "undisturbed",
    "chinese": "未受干扰的",
    "example": "The undisturbed tomb contained many well-preserved artifacts."
  },
  {
    "english": "phenomenal",
    "chinese": "非凡的",
    "example": "The team made a phenomenal discovery of ancient electric current conductors."
  },
  {
    "english": "survey",
    "chinese": "调查",
    "example": "A preliminary survey helped locate promising areas for excavation."
  },
  {
    "english": "access",
    "chinese": "（进入某个地方的）权限",
    "example": "Only authorized personnel have access to the secure artifact storage area."
  },
  {
    "english": "excavate",
    "chinese": "挖掘",
    "example": "They plan to excavate the site to find more evidence of ancient life."
  },
  {
    "english": "inaccessible",
    "chinese": "难以接近的",
    "example": "The cave was inaccessible until the team built a special pathway."
  },
  {
    "english": "insecure",
    "chinese": "不安全的",
    "example": "The unstable ground made the site too insecure for excavation."
  },
  {
    "english": "substantial",
    "chinese": "大量的，实质性的",
    "example": "Substantial evidence supports the hypothesis about ancient wheat cultivation."
  },
  {
    "english": "collapse",
    "chinese": "倒塌",
    "example": "The collapse of the ancient building preserved many artifacts inside."
  },
  {
    "english": "promising",
    "chinese": "有前途的",
    "example": "The promising site is expected to yield many important discoveries."
  },
  {
    "english": "mental picture",
    "chinese": "心理图像 / 心中画面",
    "example": "Descriptions of the site help create a mental picture of ancient life."
  },
  {
    "english": "conduct electricity",
    "chinese": "导电",
    "example": "Certain stones were used to conduct electricity in ancient rituals."
  },
  {
    "english": "electric current",
    "chinese": "电流",
    "example": "Traces of ancient electric current were found in the ritual site."
  },
  {
    "english": "leave out",
    "chinese": "省略",
    "example": "The report should not leave out any details about the artifact's composition."
  },
  {
    "english": "top priority",
    "chinese": "首要任务",
    "example": "Preserving the artifacts is the top priority for the archaeological team."
  }
]