[
  {
    "english": "galaxy",
    "chinese": "星系",
    "example": "The Milky Way is just one of billions of galaxies in the universe."
  },
  {
    "english": "collision",
    "chinese": "碰撞",
    "example": "A galaxy collision can trigger the formation of new stars."
  },
  {
    "english": "ongoing",
    "chinese": "持续的，正在进行的",
    "example": "Ongoing observations at the observatory track changes in star density."
  },
  {
    "english": "observatory",
    "chinese": "天文台",
    "example": "Scientists use the observatory to study distant galaxies and their collisions."
  },
  {
    "english": "star",
    "chinese": "恒星",
    "example": "Our Sun is a medium-sized star located in the Milky Way galaxy."
  },
  {
    "english": "density",
    "chinese": "密度",
    "example": "High star density in galaxy centers often leads to more frequent collisions."
  },
  {
    "english": "molten",
    "chinese": "融化的",
    "example": "Molten rock from volcanic eruptions can affect the Earth's climate."
  },
  {
    "english": "molecule",
    "chinese": "分子",
    "example": "Water molecules in the stratosphere can influence greenhouse effects."
  },
  {
    "english": "circulatory",
    "chinese": "循环的",
    "example": "The circulatory current of gases in stars generates magnetic fields."
  },
  {
    "english": "current",
    "chinese": "流",
    "example": "Magnetic fields are often generated by electric currents in molten cores."
  },
  {
    "english": "magnetize",
    "chinese": "使磁化",
    "example": "Certain minerals can magnetize when exposed to strong magnetic fields."
  },
  {
    "english": "meteorite",
    "chinese": "陨石",
    "example": "Meteorites can provide valuable clues about the early solar system."
  },
  {
    "english": "asteroid",
    "chinese": "小行星",
    "example": "Asteroids occasionally crash into planets, causing massive bombardment."
  },
  {
    "english": "bombardment",
    "chinese": "轰击",
    "example": "The Moon's surface shows signs of meteorite bombardment over billions of years."
  },
  {
    "english": "meteor",
    "chinese": "流星",
    "example": "Meteors burn up in the Earth's atmosphere, creating streaks of light."
  },
  {
    "english": "prolonged",
    "chinese": "持久的，长期的",
    "example": "Prolonged exposure to solar radiation can damage spacecraft electronics."
  },
  {
    "english": "speculate",
    "chinese": "猜测",
    "example": "Scientists speculate that galaxy collisions may trigger star formation."
  },
  {
    "english": "jibe",
    "chinese": "符合",
    "example": "The new data jibes with earlier theories about galaxy evolution."
  },
  {
    "english": "hemisphere",
    "chinese": "半球",
    "example": "Astronomers observe different galaxies from each hemisphere on Earth."
  },
  {
    "english": "frost",
    "chinese": "霜冻",
    "example": "Frost on meteorites can provide insights into space temperatures."
  },
  {
    "english": "yield",
    "chinese": "产量",
    "example": "Volcanic eruptions can temporarily increase crop yields due to nutrient-rich ash."
  },
  {
    "english": "almanac",
    "chinese": "年鉴，年历",
    "example": "Ancient almanacs recorded variations in star positions over time."
  },
  {
    "english": "variation",
    "chinese": "变化",
    "example": "Variations in a star's brightness can indicate the presence of orbiting planets."
  },
  {
    "english": "dim",
    "chinese": "暗淡的",
    "example": "A dim star in the galaxy might be a candidate for hosting exoplanets."
  },
  {
    "english": "volcanic",
    "chinese": "火山的",
    "example": "Volcanic activity on other planets can be detected by atmospheric gas variations."
  },
  {
    "english": "eruption",
    "chinese": "喷发",
    "example": "A massive volcanic eruption can release gases that affect the stratosphere."
  },
  {
    "english": "stratosphere",
    "chinese": "平流层",
    "example": "Particles from volcanic eruptions can reach the stratosphere and affect climate."
  },
  {
    "english": "greenhouse",
    "chinese": "温室",
    "example": "Greenhouse gases in the atmosphere trap heat, warming the planet."
  },
  {
    "english": "incidentally",
    "chinese": "附带地，顺带一提",
    "example": "Incidentally, that asteroid's path closely matches one recorded in an ancient almanac."
  },
  {
    "english": "crash into",
    "chinese": "撞上",
    "example": "Meteors crash into the Earth's atmosphere almost every day."
  },
  {
    "english": "pass through",
    "chinese": "穿过",
    "example": "Cosmic rays pass through the Earth's atmosphere and reach the surface."
  },
  {
    "english": "make sense",
    "chinese": "合理，说得通",
    "example": "The theory about galaxy collisions makes sense based on recent observations."
  },
  {
    "english": "run by",
    "chinese": "把…告诉…",
    "example": "Let me run the new galaxy collision theory by my astronomy professor."
  },
  {
    "english": "magnetic field",
    "chinese": "磁场",
    "example": "Earth's magnetic field protects us from harmful solar radiation."
  },
  {
    "english": "back up",
    "chinese": "回顾，补充背景",
    "example": "Let's back up and review the basics of star formation before discussing galaxy collisions."
  },
  {
    "english": "shed light on",
    "chinese": "阐明，把…搞明白",
    "example": "This new telescope data should shed light on how galaxies evolve."
  },
  {
    "english": "put forward",
    "chinese": "提出",
    "example": "The scientist put forward a new theory about how magnetic fields form in galaxies."
  }
]