[
    {
        "english": "ear",
        "chinese": "耳朵",
        "example": "The elephant's large ears help it stay cool in the hot savannah."
    },
    {
        "english": "classification",
        "chinese": "分类",
        "example": "Scientists use genetic analysis for the classification of different species."
    }, 
    {
        "english": "leg",
        "chinese": "腿",
        "example": "Zebras have strong legs that allow them to run at high speeds."
    },
    {
        "english": "habitat",
        "chinese": "栖息地",
        "example": "Deforestation is destroying the natural habitat of many endangered animals."
    },
    {
        "english": "trunk",
        "chinese": "象鼻",
        "example": "An elephant uses its trunk to pick up food and spray water."
    },
    {
        "english": "diet",
        "chinese": "饮食",
        "example": "The panda's diet mainly consists of bamboo shoots and leaves."
    },
    {
        "english": "tusk",
        "chinese": "象牙",
        "example": "Poachers hunt elephants for their valuable tusks."
    },
    {
        "english": "characteristic",
        "chinese": "特征",
        "example": "A distinctive characteristic of the cheetah is its ability to accelerate rapidly."
    },
    {
        "english": "eye",
        "chinese": "眼睛",
        "example": "Owls have large eyes that enable them to see clearly at night."
    },
    {
        "english": "threat",
        "chinese": "威胁",
        "example": "Climate change poses a major threat to polar bear populations."
    },
    {
        "english": "jaw",
        "chinese": "颌骨",
        "example": "The shark's powerful jaw can crush the shells of sea turtles."
    },
    {
        "english": "renewable energy source",
        "chinese": "可再生能源",
        "example": "Solar panels are a common renewable energy source for households."
    },
    {
        "english": "solar power (energy)",
        "chinese": "太阳能",
        "example": "Many countries are investing in solar power to reduce carbon emissions."
    },
    {
        "english": "non-renewable energy source",
        "chinese": "不可再生能源",
        "example": "Coal is a non-renewable energy source that will eventually be exhausted."
    },
    {
        "english": "wind power (energy)",
        "chinese": "风能",
        "example": "Wind farms generate electricity by harnessing wind power."
    },
    {
        "english": "fossil fuel",
        "chinese": "化石燃料",
        "example": "Burning fossil fuels contributes to air pollution and global warming."
    },
    {
        "english": "wave power (energy)",
        "chinese": "海浪能",
        "example": "New technologies are being developed to utilize wave power efficiently."
    },
    {
        "english": "natural gas",
        "chinese": "天然气",
        "example": "Natural gas is a cleaner-burning fossil fuel compared to oil or coal."
    },
    {
        "english": "nuclear power (energy)",
        "chinese": "核能",
        "example": "Nuclear power plants produce electricity without emitting carbon dioxide."
    },
    {
        "english": "oil",
        "chinese": "石油",
        "example": "The global economy is highly dependent on the supply of oil."
    },
    {
        "english": "carbon emission",
        "chinese": "碳排放",
        "example": "Governments are implementing policies to reduce carbon emissions."
    },
    {
        "english": "productivity",
        "chinese": "生产力",
        "example": "New technologies have significantly improved industrial productivity."
    },
    {
        "english": "nuclear waste",
        "chinese": "核废料",
        "example": "Disposing of nuclear waste safely is a major challenge for the energy industry."
    },
    {
        "english": "nuclear accident",
        "chinese": "核事故",
        "example": "The consequences of a nuclear accident can last for decades."
    },
    {
        "english": "expensive to build",
        "chinese": "建设成本高",
        "example": "High-speed rail projects are often expensive to build but cheaper to maintain."
    },
    {
        "english": "cheaper to run",
        "chinese": "运行成本更低",
        "example": "Electric cars are cheaper to run than gasoline-powered vehicles in the long term."
    },
    {
        "english": "shrimps",
        "chinese": "虾",
        "example": "Shrimps are a popular ingredient in many seafood dishes."
    },
    {
        "english": "clams",
        "chinese": "蛤蜊",
        "example": "Clams are filter feeders that help keep the ocean water clean."
    },
    {
        "english": "jelly fish",
        "chinese": "水母",
        "example": "Be careful when swimming in the ocean—jelly fish stings can be painful."
    },
    {
        "english": "mussels",
        "chinese": "贻贝",
        "example": "Mussels are often cultivated in coastal areas for human consumption."
    },
    {
        "english": "toothbrushes",
        "chinese": "牙刷",
        "example": "It's important to replace your toothbrushes every three months."
    },
    {
        "english": "spoons",
        "chinese": "勺子",
        "example": "The kitchen drawer was filled with forks, knives, and spoons."
    },
    {
        "english": "crabs",
        "chinese": "螃蟹",
        "example": "Crabs move sideways and have a hard exoskeleton for protection."
    },
    {
        "english": "trash",
        "chinese": "垃圾",
        "example": "Littering harms wildlife and pollutes the environment with unnecessary trash."
    }
]