[
  {
    "english": "scene",
    "chinese": "片段，情节；场面",
    "example": "The movie's opening scene takes place in an exotic rainforest, setting a mysterious tone."
  },
  {
    "english": "exotic",
    "chinese": "奇异的，异国的",
    "example": "The novel describes an exotic island where conventional rules of society don't apply."
  },
  {
    "english": "critique",
    "chinese": "评论；批判",
    "example": "The professor's critique of the film focused on its subtle use of metaphor and symbolism."
  },
  {
    "english": "obligatory",
    "chinese": "惯常的，必须的",
    "example": "In historical dramas, an obligatory scene of peasants working the fields is often included."
  },
  {
    "english": "feat",
    "chinese": "功绩，壮举",
    "example": "Climbing the mountain alone was a remarkable feat of physical and mental strength."
  },
  {
    "english": "conventional",
    "chinese": "传统的；惯例的",
    "example": "Unlike conventional biographies, this memoir uses a unique narrative style to tell the story."
  },
  {
    "english": "subtle",
    "chinese": "微妙的",
    "example": "The artist's work features subtle color changes that create a sense of movement."
  },
  {
    "english": "ingenuity",
    "chinese": "聪明才智",
    "example": "The film's plot showcases the protagonist's ingenuity in solving complex problems."
  },
  {
    "english": "external",
    "chinese": "外部的",
    "example": "The character's internal struggles contrast with her external elegance and poise."
  },
  {
    "english": "distinction",
    "chinese": "区别",
    "example": "There's a clear distinction between the novel's romantic genre and the director's self-serving adaptation."
  },
  {
    "english": "contemporary",
    "chinese": "当代的，现代的；同时代的",
    "example": "Contemporary films often blend traditional storytelling with innovative visual gadgets."
  },
  {
    "english": "authentic",
    "chinese": "真实的",
    "example": "The documentary provides an authentic portrayal of life in rural communities."
  },
  {
    "english": "self-serving",
    "chinese": "自私自利的",
    "example": "The politician's speech was criticized for being self-serving rather than addressing real issues."
  },
  {
    "english": "controversy",
    "chinese": "争议",
    "example": "The film's premiere was marked by controversy over its portrayal of historical events."
  },
  {
    "english": "genre",
    "chinese": "体裁，类型",
    "example": "Science fiction is a genre that often explores improbable future scenarios."
  },
  {
    "english": "elegant",
    "chinese": "高雅的；精美的",
    "example": "The elegant set design enhanced the play's atmosphere of luxury and mystery."
  },
  {
    "english": "solitary",
    "chinese": "孤独的",
    "example": "The protagonist's solitary journey reflects her struggle to find meaning in life."
  },
  {
    "english": "companion",
    "chinese": "同伴",
    "example": "In the story, a magical creature becomes the hero's companion on their adventure."
  },
  {
    "english": "enhance",
    "chinese": "加强",
    "example": "The use of lighting enhances the emotional impact of the play's final scene."
  },
  {
    "english": "comprehensive",
    "chinese": "综合性的，全面的",
    "example": "The book offers a comprehensive critique of contemporary art movements."
  },
  {
    "english": "intellectual",
    "chinese": "智能的",
    "example": "The film's intellectual gadgets add a layer of complexity to the sci-fi plot."
  },
  {
    "english": "gadget",
    "chinese": "小器具，小玩意儿",
    "example": "The spy movie features an array of high-tech gadgets to aid the protagonist."
  },
  {
    "english": "improbable",
    "chinese": "不太可能的；未必会发生的",
    "example": "The story revolves around an improbable love affair between two characters from different worlds."
  },
  {
    "english": "metaphor",
    "chinese": "暗喻；象征",
    "example": "The author uses the ocean as a metaphor for the protagonist's emotional depth."
  },
  {
    "english": "credit",
    "chinese": "给予承认；认为是...的功劳",
    "example": "The director credits the novel's author for inspiring the film's unique narrative structure."
  },
  {
    "english": "distort",
    "chinese": "歪曲；扭曲；使失真",
    "example": "The documentary was accused of distorting historical facts for dramatic effect."
  },
  {
    "english": "conservative",
    "chinese": "保守的",
    "example": "The conservative approach to the film's adaptation disappointed fans of the original story."
  },
  {
    "english": "dictate",
    "chinese": "命令；支配",
    "example": "Fashion trends often dictate what is considered elegant in film costumes."
  },
  {
    "english": "transition",
    "chinese": "过渡；转变",
    "example": "The movie's transition from a dark scene to a bright one symbolizes the protagonist's emotional shift."
  },
  {
    "english": "convoluted",
    "chinese": "复杂的；费解的",
    "example": "The convoluted plot left many viewers confused about the story's timeline."
  },
  {
    "english": "premiere",
    "chinese": "首映，首次公演",
    "example": "Celebrities attended the premiere, making it a glamorous event for the film industry."
  },
  {
    "english": "stock",
    "chinese": "老一套的",
    "example": "The movie avoids stock characters, instead presenting complex and relatable protagonists."
  },
  {
    "english": "peasant",
    "chinese": "农民",
    "example": "In historical dramas, peasants are often portrayed as hardworking but struggling individuals."
  },
  {
    "english": "fantastic",
    "chinese": "奇异的",
    "example": "The novel combines realistic elements with fantastic creatures to create a unique world."
  },
  {
    "english": "autobiography",
    "chinese": "自传",
    "example": "The author's autobiography reveals surprising details about their early life."
  },
  {
    "english": "memoir",
    "chinese": "回忆录",
    "example": "The memoir focuses on the writer's experiences growing up in an exotic country."
  },
  {
    "english": "scope",
    "chinese": "范围",
    "example": "The documentary's scope includes both historical events and contemporary perspectives."
  },
  {
    "english": "inevitably",
    "chinese": "不可避免地",
    "example": "Inevitably, the film's controversial themes sparked a heated debate among viewers."
  },
  {
    "english": "at the expense of",
    "chinese": "以...为代价",
    "example": "The movie prioritizes visual effects at the expense of a well-developed plot."
  },
  {
    "english": "tie up",
    "chinese": "捆绑",
    "example": "In the scene, the villain ties up the protagonist, setting up a dramatic rescue sequence."
  },
  {
    "english": "nowhere and everywhere",
    "chinese": "无处不在",
    "example": "The novel's theme of loneliness feels both nowhere and everywhere in the protagonist's journey."
  },
  {
    "english": "in and of itself",
    "chinese": "本身，就其本质而言",
    "example": "The act of creation is a reward in and of itself for many artists."
  },
  {
    "english": "try as it might",
    "chinese": "尽管努力，但无法做到某事",
    "example": "Try as it might, the film fails to capture the emotional depth of the original novel."
  },
  {
    "english": "anything but",
    "chinese": "一点也不",
    "example": "The movie's ending was anything but predictable, surprising the entire audience."
  },
  {
    "english": "zip past",
    "chinese": "飞驰而过",
    "example": "Cars zip past the cityscape, creating a sense of urgency in the film's opening scene."
  },
  {
    "english": "cross the line",
    "chinese": "越界：超出适当或可接受的范围",
    "example": "The character's behavior in the scene crosses the line between bravery and recklessness."
  },
  {
    "english": "open to debate",
    "chinese": "有争议的",
    "example": "The impact of social media on mental health is still open to debate among researchers."
  }
]