[
  {
    "english": "distort",
    "chinese": "扭曲",
    "example": "Gravitational forces can distort the shape of particles in a spinning disk."
  },
  {
    "english": "interpret",
    "chinese": "解释",
    "example": "Scientists interpret the data to understand how planets accrete from leftover material."
  },
  {
    "english": "representative",
    "chinese": "代表性的",
    "example": "This sample is representative of the rocky planets in our solar system."
  },
  {
    "english": "particle",
    "chinese": "粒子",
    "example": "Charged particles are affected by the star's gravitational force."
  },
  {
    "english": "altitude",
    "chinese": "海拔",
    "example": "At high altitude, the impact of radiation on space probes increases."
  },
  {
    "english": "charged",
    "chinese": "带电的",
    "example": "Charged particles collide in the gaseous disk around a young star."
  },
  {
    "english": "impact",
    "chinese": "影响",
    "example": "The impact of gravitational forces causes clumps of matter to merge."
  },
  {
    "english": "revolutionary",
    "chinese": "革命性的",
    "example": "A revolutionary theory explains how oddball planets form."
  },
  {
    "english": "conventional",
    "chinese": "传统的",
    "example": "Conventional models struggle to explain the unevenness in planet composition."
  },
  {
    "english": "exception",
    "chinese": "例外",
    "example": "This planet is an exception to the prevailing theory of planet formation."
  },
  {
    "english": "dimension",
    "chinese": "维度",
    "example": "Scientists study how gravity works across different dimensions."
  },
  {
    "english": "replenish",
    "chinese": "补充",
    "example": "A space probe must replenish its energy to continue its orbit."
  },
  {
    "english": "orbit (n.)",
    "chinese": "轨道",
    "example": "The planet's orbit is affected by the star's intense radiation."
  },
  {
    "english": "orbit (v.)",
    "chinese": "绕轨道运行",
    "example": "Moons orbit planets due to gravitational forces."
  },
  {
    "english": "prevailing",
    "chinese": "占主导的",
    "example": "The prevailing theory states planets form from swirling disks of matter."
  },
  {
    "english": "spinning",
    "chinese": "旋转的",
    "example": "A spinning disk of gas and dust is the birthplace of planets."
  },
  {
    "english": "disk",
    "chinese": "圆盘",
    "example": "Planets accrete from material in a protoplanetary disk."
  },
  {
    "english": "leftover",
    "chinese": "残留物",
    "example": "Leftover particles collide and form clumps in the disk."
  },
  {
    "english": "swirl",
    "chinese": "旋转",
    "english example": "Gas and dust swirl around the star, creating a spinning disk."
  },
  {
    "english": "collide",
    "chinese": "碰撞",
    "example": "When particles collide, they can stick together and form larger clumps."
  },
  {
    "english": "clump",
    "chinese": "团，块",
    "example": "Small clumps of matter eventually accrete into planets."
  },
  {
    "english": "accrete",
    "chinese": "积聚",
    "example": "Planets accrete by gathering more and more material over time."
  },
  {
    "english": "rocky",
    "chinese": "岩石的",
    "example": "Rocky planets like Earth form closer to the star."
  },
  {
    "english": "core",
    "chinese": "核心",
    "example": "A planet's core is formed from the densest materials that accrete first."
  },
  {
    "english": "oddball",
    "chinese": "古怪的",
    "example": "This oddball planet has an unusual orbit compared to others in the system."
  },
  {
    "english": "gaseous",
    "chinese": "气态的",
    "example": "Gaseous planets like Jupiter form further from the star."
  },
  {
    "english": "unevenness",
    "chinese": "不均匀",
    "example": "Unevenness in the disk can lead to variations in planet composition."
  },
  {
    "english": "gravity",
    "chinese": "重力",
    "example": "Gravity is the force that causes particles to clump together."
  },
  {
    "english": "momentous",
    "chinese": "重要的",
    "example": "The discovery of this planet was a momentous event in astronomy."
  },
  {
    "english": "unconvinced",
    "chinese": "不信服的",
    "example": "Some scientists remain unconvinced by the new theory of planet formation."
  },
  {
    "english": "intense",
    "chinese": "强烈的",
    "example": "Intense radiation from the star can evaporate material from nearby planets."
  },
  {
    "english": "radiation",
    "chinese": "辐射",
    "example": "Space probes must be shielded from harmful solar radiation."
  },
  {
    "english": "migration",
    "chinese": "迁移",
    "example": "Planets can migrate within their star system due to gravitational forces."
  },
  {
    "english": "composition",
    "chinese": "组成",
    "example": "The composition of a planet depends on the materials available during its formation."
  },
  {
    "english": "merge",
    "chinese": "合并",
    "example": "When two clumps merge, they form a larger body."
  },
  {
    "english": "evaporate",
    "chinese": "蒸发",
    "example": "Heat from the star can cause volatile materials to evaporate."
  },
  {
    "english": "space probe",
    "chinese": "航天探测器",
    "example": "A space probe was sent to study the composition of the asteroid."
  },
  {
    "english": "get hands on",
    "chinese": "获取到",
    "example": "Scientists hope to get hands on samples from the distant planet."
  },
  {
    "english": "gravitational force",
    "chinese": "引力，重力",
    "example": "The gravitational force between the star and planet keeps the planet in orbit."
  }
]