[
    {
        "english": "seemingly",
        "chinese": "明显的，表面上",
        "example": "Seemingly, the weather will be fine tomorrow, but the forecast might change."
    },
    {
        "english": "introduce",
        "chinese": "引进",
        "example": "They plan to introduce a new policy to improve efficiency."
    },
    {
        "english": "archaeologist",
        "chinese": "考古学家",
        "example": "The archaeologist discovered ancient tools at the excavation site."
    },
    {
        "english": "archaeology",
        "chinese": "考古学",
        "example": "Studying archaeology helps us understand past human cultures."
    },
    {
        "english": "trace",
        "chinese": "痕迹",
        "example": "We found a trace of the old path in the overgrown forest."
    },
    {
        "english": "deposit",
        "chinese": "沉积物",
        "example": "The deposit of silt made the riverbed shallow over time."
    },
    {
        "english": "assume",
        "chinese": "假定",
        "example": "Don't assume things without checking the facts first."
    },
    {
        "english": "decay",
        "chinese": "腐败",
        "example": "Leaving food out in the heat will cause it to decay quickly."
    },
    {
        "english": "sediment",
        "chinese": "沉淀物",
        "example": "The sediment at the bottom of the lake contains ancient fossils."
    },
    {
        "english": "pottery",
        "chinese": "陶器",
        "example": "The museum displays beautiful pottery from different historical periods."
    },
    {
        "english": "agriculture",
        "chinese": "农业",
        "example": "Modern agriculture uses advanced technology to increase crop yields."
    },
    {
        "english": "mammoth",
        "chinese": "猛犸象",
        "example": "Woolly mammoths roamed the earth during the Ice Age."
    },
    {
        "english": "remains",
        "chinese": "残骸",
        "example": "The remains of the old castle still stand on the hilltop."
    },
    {
        "english": "spear point",
        "chinese": "长矛尖",
        "example": "The archaeologist unearthed a sharp spear point at the dig site."
    },
    {
        "english": "site",
        "chinese": "遗迹",
        "example": "The historical site attracts many tourists interested in ancient history."
    },
    {
        "english": "debris",
        "chinese": "残骸",
        "example": "After the storm, debris was scattered across the yard."
    },
    {
        "english": "distinct",
        "chinese": "明显的",
        "example": "There's a distinct difference between the two species of birds."
    },
    {
        "english": "distribution",
        "chinese": "分布",
        "example": "The even distribution of resources helped the community thrive."
    },
    {
        "english": "simulate",
        "chinese": "模拟",
        "example": "The computer program can simulate weather conditions accurately."
    },
    {
        "english": "decade",
        "chinese": "十年",
        "example": "Over the past decade, technology has advanced rapidly."
    },
    {
        "english": "extinction",
        "chinese": "灭绝",
        "example": "Human activity has led to the extinction of many animal species."
    }
]