[
  {
    "english": "thaw",
    "chinese": "解冻",
    "example": "As the climate warms, Arctic permafrost begins to thaw, causing ground slumping."
  },
  {
    "english": "slumping",
    "chinese": "下沉，塌陷",
    "example": "Slumping hillsides due to thawing ice pose a risk to nearby communities."
  },
  {
    "english": "mineral",
    "chinese": "矿物",
    "example": "Mineral deposits in the sedimentary layers reveal Earth's geological history."
  },
  {
    "english": "cautious",
    "chinese": "小心的，谨慎的",
    "example": "Scientists remain cautious about claiming conclusive evidence for the anomaly."
  },
  {
    "english": "assume",
    "chinese": "假设，认为",
    "example": "Do not assume the slope is stable—conduct a safety inspection first."
  },
  {
    "english": "claim",
    "chinese": "声称，主张",
    "example": "Proponents claim the lava flow indicates a resurgent dormant volcano."
  },
  {
    "english": "conclusive",
    "chinese": "确凿的，决定性的",
    "example": "Conclusive data is needed before declaring the volcano extinct."
  },
  {
    "english": "stabilize",
    "chinese": "稳定",
    "example": "Engineers worked to stabilize the slumping cliff with support columns."
  },
  {
    "english": "slope",
    "chinese": "坡度，斜坡",
    "example": "The steep slope of the mountain makes it vulnerable to landslides."
  },
  {
    "english": "elevate",
    "chinese": "提升，抬高",
    "example": "Elevating the roadbed prevented damage from seasonal thaw cycles."
  },
  {
    "english": "intact",
    "chinese": "完整的，未受损的",
    "example": "The ancient fossil remained intact despite the shifting tectonic plates."
  },
  {
    "english": "sedimentary",
    "chinese": "沉积的",
    "example": "Sedimentary rocks often contain layers of mineral-rich sediments."
  },
  {
    "english": "corridor",
    "chinese": "走廊，通道",
    "example": "The seismic corridor is a boundary where continental plates collide."
  },
  {
    "english": "precaution",
    "chinese": "预防措施",
    "example": "Take precautions against lava flows when living near an active volcano."
  },
  {
    "english": "frequency",
    "chinese": "频率",
    "example": "Monitor the frequency of earthquakes to predict volcanic activity."
  },
  {
    "english": "intensity",
    "chinese": "强度，烈度",
    "example": "The intensity of the eruption exceeded scientists' initial predictions."
  },
  {
    "english": "evaporate",
    "chinese": "蒸发",
    "example": "Water near the lava flow will quickly evaporate into steam."
  },
  {
    "english": "crust",
    "chinese": "地壳",
    "example": "The Earth's crust shifts as tectonic plates move over molten rock."
  },
  {
    "english": "boundary",
    "chinese": "边界",
    "example": "The boundary between two plates is a common site for volcanic activity."
  },
  {
    "english": "continental",
    "chinese": "大陆的",
    "example": "Continental drift explains how continents shift over millions of years."
  },
  {
    "english": "magma",
    "chinese": "岩浆",
    "example": "Magma rising from the mantle forms new crust at plate boundaries."
  },
  {
    "english": "lava",
    "chinese": "熔岩",
    "example": "Flowing lava can reach temperatures hot enough to melt most minerals."
  },
  {
    "english": "anomaly",
    "chinese": "异常，反常",
    "example": "The seismic anomaly suggests a hidden chamber of magma beneath the peak."
  },
  {
    "english": "column",
    "chinese": "柱子",
    "example": "Basalt columns formed when lava cooled rapidly after an eruption."
  },
  {
    "english": "dormant",
    "chinese": "休眠的",
    "example": "A dormant volcano may awaken after centuries of inactivity."
  },
  {
    "english": "extinct",
    "chinese": "灭亡的",
    "example": "Geologists debate whether the volcano is truly extinct or just dormant."
  },
  {
    "english": "topographic",
    "chinese": "地形的",
    "example": "Topographic maps help visualize the slope and elevation of volcanic peaks."
  },
  {
    "english": "peak",
    "chinese": "峰，顶点",
    "example": "The mountain peak is actually the caldera of an ancient volcano."
  },
  {
    "english": "elegant",
    "chinese": "优雅的",
    "example": "The elegant curve of the volcano's slope belies its violent history."
  },
  {
    "english": "consistent",
    "chinese": "一致的",
    "example": "Consistent seismic activity indicates magma may be welling up beneath the surface."
  },
  {
    "english": "critics",
    "chinese": "批评者",
    "example": "Critics argue the data is insufficient to rule out natural causes for the anomaly."
  },
  {
    "english": "alternative",
    "chinese": "替代的",
    "example": "Alternative theories suggest the slumping is due to groundwater rather than thawing."
  },
  {
    "english": "stretch",
    "chinese": "延伸，拉伸",
    "example": "The tectonic plate stretch created a rift valley miles long."
  },
  {
    "english": "proponent",
    "chinese": "拥护者，提倡者",
    "example": "Proponents of the theory put forth evidence of recent magma movement."
  },
  {
    "english": "random",
    "chinese": "随机的",
    "example": "Earthquakes along the fault line do not appear to be random but systematic."
  },
  {
    "english": "prolonged",
    "chinese": "延长的，持续的",
    "example": "Prolonged drought can cause soil to shrink and trigger slope slumping."
  },
  {
    "english": "rule out",
    "chinese": "排除",
    "example": "Scientists cannot rule out the possibility of an impending eruption."
  },
  {
    "english": "tectonic plate",
    "chinese": "地壳板块",
    "example": "Tectonic plate movements are the primary cause of volcanic activity."
  },
  {
    "english": "molten rock",
    "chinese": "熔融岩",
    "example": "Molten rock beneath the crust is called magma until it erupts as lava."
  },
  {
    "english": "well up",
    "chinese": "冒出，涌出",
    "example": "Magma began to well up through the crust, causing the ground to elevate."
  },
  {
    "english": "put forth",
    "chinese": "提出，呈现",
    "example": "Researchers put forth a new model to explain the volcano's resurgence."
  }
]