[
  {
    "english": "deception",
    "chinese": "欺骗",
    "example": "The fish uses deception to attract prey by imitating a smaller creature."
  },
  {
    "english": "imitate",
    "chinese": "模仿",
    "example": "Some birds can imitate the sounds of other animals to communicate."
  },
  {
    "english": "journal",
    "chinese": "期刊",
    "example": "The study was published in a leading scientific journal on marine biology."
  },
  {
    "english": "statistic",
    "chinese": "数据",
    "example": "The statistics show a rise in parasitic relationships within coral reefs."
  },
  {
    "english": "interpret",
    "chinese": "解读",
    "example": "Scientists interpret the fish's behavior as a form of defensive deception."
  },
  {
    "english": "remark",
    "chinese": "言论",
    "example": "The researcher's remark about symbiosis sparked a debate in the field."
  },
  {
    "english": "propulsion",
    "chinese": "推进",
    "example": "The submarine uses electric propulsion to minimize noise and drag."
  },
  {
    "english": "steering",
    "chinese": "掌舵，转向",
    "example": "The robot's steering system allows it to maneuver through tight spaces."
  },
  {
    "english": "brake",
    "chinese": "刹车",
    "example": "Marine vehicles use water resistance as a natural brake when stopping."
  },
  {
    "english": "buoyancy",
    "chinese": "浮力",
    "example": "Adjusting buoyancy helps submarines maintain vertical position in the water."
  },
  {
    "english": "drag",
    "chinese": "阻力",
    "example": "Sleek designs reduce drag, allowing ships to accelerate more efficiently."
  },
  {
    "english": "impede",
    "chinese": "阻碍",
    "example": "Seaweed can impede the movement of boats by wrapping around propellers."
  },
  {
    "english": "maneuver",
    "chinese": "操纵，熟练地移动",
    "example": "Dolphins can maneuver quickly in the water to catch prey."
  },
  {
    "english": "burst",
    "chinese": "爆发",
    "example": "The fish uses a burst of speed to escape predators in the open ocean."
  },
  {
    "english": "vertical",
    "chinese": "垂直的",
    "example": "Vertical diving is a common strategy for birds hunting fish."
  },
  {
    "english": "propeller",
    "chinese": "螺旋桨",
    "example": "The propeller's rotation creates the propulsion needed for the ship to move."
  },
  {
    "english": "accelerate",
    "chinese": "加速",
    "example": "Removing excess weight allows the submarine to accelerate faster."
  },
  {
    "english": "assignment",
    "chinese": "任务，作业",
    "example": "The assignment requires a literature review on marine symbiosis."
  },
  {
    "english": "symbiosis",
    "chinese": "共生",
    "example": "Clownfish and anemones share a classic example of mutualistic symbiosis."
  },
  {
    "english": "parasitic",
    "chinese": "寄生的",
    "example": "Some fish have parasitic relationships that harm their hosts."
  },
  {
    "english": "overlap",
    "chinese": "部分重叠",
    "example": "The habitats of these two species overlap in the coral reef ecosystem."
  },
  {
    "english": "temporary",
    "chinese": "暂时的",
    "example": "Temporary symbiotic relationships can form during migration seasons."
  },
  {
    "english": "visual",
    "chinese": "视觉的",
    "example": "Visual cues help fish identify potential symbiotic partners."
  },
  {
    "english": "cue",
    "chinese": "暗示，提示",
    "example": "Color changes in fish can be a cue for symbiotic behavior."
  },
  {
    "english": "pallet",
    "chinese": "盘",
    "example": "The research team used a pallet to collect samples from the ocean floor."
  },
  {
    "english": "ultimately",
    "chinese": "最终，根本上",
    "example": "Ultimately, the study found that symbiosis improves species survival rates."
  },
  {
    "english": "kidnap",
    "chinese": "绑架",
    "example": "The plot of the novel involves a scientist being kidnapped during a marine expedition."
  },
  {
    "english": "literature review",
    "chinese": "文献综述",
    "example": "The literature review covers decades of research on marine propulsion systems."
  },
  {
    "english": "roam around",
    "chinese": "四处走动",
    "example": "Sharks roam around the ocean in search of prey to feed on."
  },
  {
    "english": "feed on",
    "chinese": "以…为食",
    "example": "Many marine species feed on the plankton found in surface waters."
  }
]