[
  {
    "english": "monochrome",
    "chinese": "单色的",
    "example": "The artist created a stunning monochrome painting using only shades of black and white."
  },
  {
    "english": "counterpart",
    "chinese": "对应方",
    "example": "The cultural institute in Japan found a perfect counterpart in the Chinese art museum for their joint exhibition."
  },
  {
    "english": "Buddhist",
    "chinese": "佛教的",
    "example": "The ancient temple houses several valuable Buddhist sculptures from the Tang Dynasty."
  },
  {
    "english": "deity",
    "chinese": "神",
    "example": "In Hinduism, each deity represents different aspects of the divine universe."
  },
  {
    "english": "supremely",
    "chinese": "极其",
    "example": "The mountain landscape was supremely beautiful, taking the hikers' breath away."
  },
  {
    "english": "tribute",
    "chinese": "歌颂",
    "example": "The poem is a tribute to the power and beauty of nature in its raw form."
  },
  {
    "english": "grandeur",
    "chinese": "宏伟",
    "example": "Visitors are always amazed by the grandeur of the Forbidden City's architecture."
  },
  {
    "english": "vastness",
    "chinese": "巨大",
    "example": "The vastness of the Sahara Desert is both awe-inspiring and humbling."
  },
  {
    "english": "bold",
    "chinese": "勇敢的",
    "example": "The designer's bold color choices made the fashion show truly unforgettable."
  },
  {
    "english": "daring",
    "chinese": "大胆的",
    "example": "The film director is known for his daring narrative techniques that challenge traditional storytelling."
  },
  {
    "english": "capture",
    "chinese": "捕获",
    "example": "The photographer managed to capture the perfect moment of the sunrise over the ocean."
  },
  {
    "english": "stylized",
    "chinese": "非写实的",
    "example": "The animated film features stylized characters with exaggerated features for comedic effect."
  },
  {
    "english": "outline",
    "chinese": "轮廓",
    "example": "She began the drawing by sketching the basic outline of the landscape."
  },
  {
    "english": "misty",
    "chinese": "多雾的",
    "example": "The misty morning created an ethereal atmosphere in the ancient forest."
  },
  {
    "english": "jagged",
    "chinese": "参差不齐的",
    "example": "The jagged edges of the mountain range stood out against the clear sky."
  },
  {
    "english": "sketch",
    "chinese": "素描",
    "example": "He quickly sketched the scene before the moment passed, capturing its essence in simple lines."
  },
  {
    "english": "engulf",
    "chinese": "包围",
    "example": "The small village was engulfed by thick fog, making it impossible to see more than a few meters ahead."
  },
  {
    "english": "lone",
    "chinese": "独自的",
    "example": "A lone traveler explored the abandoned city, documenting its decaying beauty."
  },
  {
    "english": "trail",
    "chinese": "小路",
    "example": "The hiking trail led through dense forests and across sparkling streams."
  },
  {
    "english": "solitary",
    "chinese": "孤独的",
    "example": "The lighthouse stands as a solitary sentinel on the rocky coastline."
  },
  {
    "english": "pavilion",
    "chinese": "亭子",
    "example": "Visitors rested in the pavilion, enjoying the view of the tranquil lake."
  },
  {
    "english": "appeal",
    "chinese": "吸引",
    "example": "The exhibition appeals to both art enthusiasts and casual visitors with its diverse collection."
  },
  {
    "english": "medieval",
    "chinese": "中世纪的",
    "example": "The museum houses a remarkable collection of medieval manuscripts and artworks."
  },
  {
    "english": "compatible",
    "chinese": "契合的；兼容的",
    "example": "The new design is compatible with traditional architectural styles while adding modern elements."
  },
  {
    "english": "extant",
    "chinese": "现存的",
    "example": "One of the extant copies of the ancient scroll is displayed in the national museum."
  },
  {
    "english": "visionary",
    "chinese": "有见识的",
    "example": "The visionary artist predicted trends that would influence the art world for decades."
  },
  {
    "english": "impressionistic",
    "chinese": "印象派的",
    "example": "Her painting style is impressionistic, focusing on light and color rather than detailed realism."
  },
  {
    "english": "differentiate",
    "chinese": "区分",
    "example": "It can be difficult to differentiate between the two artists' styles at first glance."
  },
  {
    "english": "pictorial",
    "chinese": "图片的",
    "example": "The book uses a pictorial approach to explain complex scientific concepts to young readers."
  },
  {
    "english": "suspend",
    "chinese": "悬浮",
    "example": "The installation art piece suspends hundreds of tiny lights from the ceiling, creating a starry effect."
  },
  {
    "english": "integrate",
    "chinese": "整合",
    "example": "The architect managed to integrate traditional motifs into the modern building design seamlessly."
  },
  {
    "english": "coherent",
    "chinese": "连贯的",
    "example": "The exhibition presents a coherent narrative of the artist's career from early works to recent pieces."
  },
  {
    "english": "prevail",
    "chinese": "普遍存在",
    "example": "A minimalist aesthetic prevails in the designer's latest collection, focusing on simplicity and function."
  },
  {
    "english": "incorporate",
    "chinese": "并入",
    "example": "The new design incorporates elements from various cultural traditions, creating a unique fusion."
  },
  {
    "english": "discern",
    "chinese": "辨别",
    "example": "Experts can discern subtle differences in brushwork that distinguish the original painting from a copy."
  },
  {
    "english": "glimpse",
    "chinese": "一瞬间",
    "example": "The documentary offers a rare glimpse into the daily lives of traditional artisans."
  },
  {
    "english": "obscure",
    "chinese": "使模糊",
    "example": "The old photograph's details are obscure, making it difficult to identify the people in it."
  },
  {
    "english": "eminent",
    "chinese": "杰出的",
    "example": "The eminent art historian gave a lecture on the influence of Renaissance painters."
  },
  {
    "english": "reinvigorator",
    "chinese": "使某物焕发新生者",
    "example": "The young painter is seen as a reinvigorator of the abstract expressionist movement."
  },
  {
    "english": "contemporary",
    "chinese": "同代人",
    "example": "The artist's work was not appreciated by his contemporaries but is now highly regarded."
  },
  {
    "english": "artisan",
    "chinese": "手工艺者",
    "example": "The market features products made by local artisans, showcasing traditional craftsmanship."
  },
  {
    "english": "notion",
    "chinese": "观念",
    "example": "The exhibition challenges traditional notions of beauty and artistry."
  },
  {
    "english": "subsequently",
    "chinese": "随后地",
    "example": "The artist first gained recognition in Europe and subsequently became famous worldwide."
  },
  {
    "english": "goldsmithing",
    "chinese": "雕金",
    "example": "Goldsmithing techniques have been passed down for generations in this region."
  },
  {
    "english": "craft",
    "chinese": "手艺",
    "example": "She dedicated her life to perfecting the craft of ceramic making."
  },
  {
    "english": "realm",
    "chinese": "领域",
    "example": "The artist made significant contributions to the realm of contemporary sculpture."
  },
  {
    "english": "epics",
    "chinese": "史诗",
    "example": "The film is based on ancient epics, bringing mythological stories to the big screen."
  },
  {
    "english": "instruction",
    "chinese": "课程",
    "example": "The art school offers instruction in various disciplines, from painting to digital art."
  },
  {
    "english": "amateur",
    "chinese": "业余者",
    "example": "The exhibition includes works by both professional and amateur artists."
  },
  {
    "english": "lesser",
    "chinese": "较小的",
    "example": "The museum also showcases the works of lesser-known artists from the same period."
  },
  {
    "english": "learned",
    "chinese": "学术性的",
    "example": "The article is a learned discussion on the influence of politics on art movements."
  },
  {
    "english": "pronounced",
    "chinese": "显著的",
    "example": "The artist's later works show a pronounced shift towards abstract forms."
  },
  {
    "english": "hindsight",
    "chinese": "事后的领悟",
    "example": "In hindsight, the exhibition marked a turning point in the artist's career."
  },
  {
    "english": "patron",
    "chinese": "赞助者",
    "example": "The artist relied on the support of patrons to fund his ambitious projects."
  },
  {
    "english": "jewel-encrusted",
    "chinese": "镶嵌珠宝的",
    "example": "The museum displays a jewel-encrusted crown that once belonged to a royal family."
  },
  {
    "english": "embroidery",
    "chinese": "刺绣",
    "example": "The dress features intricate embroidery that took months to complete."
  },
  {
    "english": "tapestry",
    "chinese": "挂毯",
    "example": "The ancient tapestry depicts a historical battle in vivid detail."
  },
  {
    "english": "festivity",
    "chinese": "庆祝活动",
    "example": "The town square was decorated for the festivity, with colorful flags and lights."
  },
  {
    "english": "pretension",
    "chinese": "做作",
    "example": "The artist's work is refreshingly free of pretension, focusing on honest expression."
  },
  {
    "english": "satirize",
    "chinese": "讽刺",
    "example": "The cartoon uses humor to satirize the art world's obsession with fame and money."
  }
]