[
  {
    "english": "stencil",
    "chinese": "图案",
    "example": "Archaeologists found ancient stencils of hands on cave walls, suggesting early human artistry."
  },
  {
    "english": "shelter",
    "chinese": "遮蔽处",
    "example": "Early humans sought shelter in caves during harsh weather, leaving behind cultural artifacts."
  },
  {
    "english": "spray",
    "chinese": "喷洒",
    "example": "Prehistoric artists used bone tubes to spray mineral pigments, creating detailed cave paintings."
  },
  {
    "english": "predominant",
    "chinese": "占主导地位的",
    "example": "The predominant climate in the region was temperate, allowing for diverse plant life."
  },
  {
    "english": "dramatic",
    "chinese": "巨大的，令人吃惊的",
    "example": "A dramatic shift in temperature caused the ice sheets to retreat rapidly 12,000 years ago."
  },
  {
    "english": "temperate",
    "chinese": "气候温和的",
    "example": "Temperate forests in Europe supported early agricultural communities due to fertile soil."
  },
  {
    "english": "retreat",
    "chinese": "（冰域、水域）缩小",
    "example": "The retreat of glaciers revealed new land, prompting human migration into northern regions."
  },
  {
    "english": "subtle",
    "chinese": "细微的，微妙的",
    "example": "Subtle changes in pottery design indicate cultural exchanges between distant tribes."
  },
  {
    "english": "momentous",
    "chinese": "重大的",
    "example": "The invention of agriculture was a momentous event in human civilization's development."
  },
  {
    "english": "sparse",
    "chinese": "稀疏的",
    "example": "Sparse vegetation in arid regions required early humans to develop efficient foraging strategies."
  },
  {
    "english": "forager",
    "chinese": "搜寻食物的人",
    "example": "Foragers in the savanna relied on seasonal migrations of animals for sustenance."
  },
  {
    "english": "intellectual",
    "chinese": "高智力的",
    "example": "Intellectual advancements in mathematics allowed ancient civilizations to build complex structures."
  },
  {
    "english": "elite",
    "chinese": "精英人士",
    "example": "The elite in ancient Egypt commissioned grand pyramids as symbols of their power."
  },
  {
    "english": "caste",
    "chinese": "特权阶层",
    "example": "In some ancient societies, the caste system determined access to resources and education."
  },
  {
    "english": "token",
    "chinese": "标记，符号",
    "example": "Clay tokens were used in Mesopotamia as early forms of economic transaction records."
  },
  {
    "english": "transaction",
    "chinese": "交易",
    "example": "Trade routes facilitated the transaction of goods like spices and precious metals."
  },
  {
    "english": "testify",
    "chinese": "证明",
    "example": "Ancient cave paintings testify to early humans' complex relationship with wildlife."
  },
  {
    "english": "modest",
    "chinese": "不高的",
    "example": "Modest settlements along riverbanks evolved into major cities over centuries."
  },
  {
    "english": "contest",
    "chinese": "质疑，反驳",
    "example": "Scholars contest the theory that ancient pyramids were built by enslaved workers."
  },
  {
    "english": "reiterate",
    "chinese": "重申",
    "example": "Archaeologists reiterate the importance of preserving ancient sites from urban development."
  },
  {
    "english": "utilitarian",
    "chinese": "实用的",
    "example": "Early tools were primarily utilitarian, designed for hunting and food preparation."
  },
  {
    "english": "thrill",
    "chinese": "兴奋，刺激",
    "example": "The thrill of the hunt is depicted in ancient rock art across continents."
  },
  {
    "english": "prestige",
    "chinese": "威望",
    "example": "Elite classes used elaborate jewelry to signal their prestige and social status."
  },
  {
    "english": "readily",
    "chinese": "便利地，轻而易举地",
    "example": "Natural resources like flint were readily available near early human settlements."
  },
  {
    "english": "ample",
    "chinese": "足够的",
    "example": "Ample rainfall in the region supported the growth of wheat and barley in ancient farms."
  },
  {
    "english": "sustenance",
    "chinese": "食物，营养",
    "example": "Fishing provided a reliable source of sustenance for coastal communities."
  },
  {
    "english": "fuse",
    "chinese": "融合",
    "example": "Cultural practices from different tribes fused to form unique traditions in Mesoamerica."
  },
  {
    "english": "corridor",
    "chinese": "走廊，地带",
    "example": "The Silk Road was a vital trade corridor connecting Asia and Europe."
  },
  {
    "english": "myth",
    "chinese": "误解，错误观念",
    "example": "The myth that ancient aliens built pyramids is not supported by archaeological evidence."
  },
  {
    "english": "inhospitable",
    "chinese": "荒凉的，不适于居住的",
    "example": "Inhospitable deserts posed significant challenges for ancient migrating groups."
  },
  {
    "english": "incentive",
    "chinese": "动机，诱因",
    "example": "The incentive of fertile land drove humans to settle in river valleys like the Nile."
  },
  {
    "english": "hieroglyph",
    "chinese": "象形文字",
    "example": "Egyptian hieroglyphs were deciphered using the Rosetta Stone in the 19th century."
  },
  {
    "english": "dampen",
    "chinese": "使…潮湿",
    "example": "Clay tablets were dampened before writing to prevent cracks in the drying process."
  },
  {
    "english": "tablet",
    "chinese": "刻写板",
    "example": "Cuneiform writing on clay tablets recorded ancient Mesopotamian legal codes."
  },
  {
    "english": "tamper",
    "chinese": "破坏",
    "example": "Archaeologists caution against tampering with ancient artifacts during excavation."
  },
  {
    "english": "archive",
    "chinese": "档案",
    "example": "The ancient Library of Alexandria was once a vast archive of knowledge."
  },
  {
    "english": "carve",
    "chinese": "刻写",
    "example": "Scribes carved inscriptions on stone pillars to record historical events."
  },
  {
    "english": "residue",
    "chinese": "残留物",
    "example": "Chemical residues on pottery shards reveal ancient cooking practices."
  },
  {
    "english": "alternative",
    "chinese": "另外的",
    "example": "Alternative farming methods like terrace agriculture were developed in mountainous regions."
  },
  {
    "english": "vessel",
    "chinese": "容器",
    "example": "Clay vessels were decorated with motifs reflecting the daily lives of ancient peoples."
  },
  {
    "english": "refine",
    "chinese": "改进",
    "example": "Metallurgy techniques were refined over centuries to produce stronger tools."
  },
  {
    "english": "novel",
    "chinese": "新颖的，珍奇的",
    "example": "Novel approaches to irrigation allowed civilizations to thrive in arid climates."
  },
  {
    "english": "striking",
    "chinese": "引人注目的",
    "example": "The striking similarity between distant cultures' art suggests ancient trade networks."
  },
  {
    "english": "smash",
    "chinese": "打碎",
    "example": "Archaeologists found smashed pottery, possibly from ritualistic destruction."
  },
  {
    "english": "ostentatious",
    "chinese": "炫耀的",
    "example": "Ostentatious tombs of pharaohs displayed wealth and power through elaborate carvings."
  },
  {
    "english": "take over",
    "chinese": "接管",
    "example": "When a dynasty fell, conquerors would take over its infrastructure and traditions."
  },
  {
    "english": "treasure",
    "chinese": "珍视",
    "example": "Ancient cultures treasured jade for its beauty and believed it had spiritual properties."
  },
  {
    "english": "cease",
    "chinese": "停止",
    "example": "The practice of building pyramids ceased in Egypt around 1600 BCE."
  },
  {
    "english": "scribe",
    "chinese": "抄写员",
    "example": "Scribes were highly respected for their ability to read and write in ancient societies."
  },
  {
    "english": "demanding",
    "chinese": "（工作）费力的，难度高的",
    "example": "Constructing megalithic structures like Stonehenge was a demanding physical endeavor."
  },
  {
    "english": "circumscribe",
    "chinese": "限制",
    "example": "Geographical barriers like mountains circumscribed the expansion of early civilizations."
  },
  {
    "english": "division",
    "chinese": "分隔",
    "example": "The division of labor in cities allowed for specialized roles like artisans and traders."
  },
  {
    "english": "arable",
    "chinese": "可耕的",
    "example": "Arable land along rivers was highly valued for its agricultural potential."
  },
  {
    "english": "correspond",
    "chinese": "相符",
    "example": "Artifacts from tombs often correspond to the social status of the deceased."
  },
  {
    "english": "secure",
    "chinese": "取得，实现",
    "example": "Walls were built around cities to secure them from invasions and raids."
  },
  {
    "english": "complex",
    "chinese": "建筑群",
    "example": "The Mayan complex at Tikal included temples, palaces, and plazas."
  },
  {
    "english": "edifice",
    "chinese": "大厦",
    "example": "The Parthenon is an iconic edifice of ancient Greek architecture."
  },
  {
    "english": "grid",
    "chinese": "网格",
    "example": "The grid layout of cities like Mohenjo-daro indicates advanced urban planning."
  },
  {
    "english": "metropolis",
    "chinese": "大城市",
    "example": "Ancient Rome was a sprawling metropolis with a population of over a million."
  },
  {
    "english": "facilitate",
    "chinese": "使…容易",
    "example": "Road networks facilitated the movement of troops and goods in the Roman Empire."
  },
  {
    "english": "innumerable",
    "chinese": "无数的",
    "example": "Innumerable artifacts in museums provide insights into ancient daily life."
  },
  {
    "english": "thoroughly",
    "chinese": "彻底地，完全地",
    "example": "Archaeological sites are thoroughly documented before any excavation begins."
  },
  {
    "english": "encounter",
    "chinese": "偶然遇到",
    "example": "Explorers often encountered ancient ruins while mapping uncharted territories."
  },
  {
    "english": "drawback",
    "chinese": "缺点",
    "example": "A major drawback of nomadic life was the lack of permanent infrastructure."
  },
  {
    "english": "chronology",
    "chinese": "年表",
    "example": "Radiocarbon dating helps establish the chronology of ancient human settlements."
  },
  {
    "english": "sequentially",
    "chinese": "循序地",
    "example": "Artifacts are cataloged sequentially to maintain their archaeological context."
  },
  {
    "english": "deem",
    "chinese": "认为",
    "example": "Scholars deem the Indus Valley Civilization one of the earliest urban societies."
  },
  {
    "english": "bias",
    "chinese": "偏见",
    "example": "Archaeological interpretations must avoid cultural bias to remain objective."
  },
  {
    "english": "inadvertently",
    "chinese": "无意地，不经意地",
    "example": "Excavations sometimes inadvertently damage delicate ancient artifacts."
  },
  {
    "english": "slash-and-burn",
    "chinese": "刀耕火种的",
    "example": "Slash-and-burn agriculture was practiced by some ancient forest-dwelling communities."
  },
  {
    "english": "tap",
    "chinese": "利用，开发",
    "example": "Ancient civilizations tapped into natural resources like copper and tin for toolmaking."
  },
  {
    "english": "artery",
    "chinese": "干线",
    "example": "Rivers were vital arteries for transportation and trade in ancient times."
  },
  {
    "english": "antiquity",
    "chinese": "古代",
    "example": "Many practices in modern society have roots in antiquity."
  },
  {
    "english": "raid",
    "chinese": "劫掠",
    "example": "Fortifications were built to protect cities from barbarian raids."
  },
  {
    "english": "subsist",
    "chinese": "生存，糊口",
    "example": "Hunter-gatherer societies subsisted on wild plants and animals for thousands of years."
  },
  {
    "english": "sedentary",
    "chinese": "定居的",
    "example": "The shift to sedentary life accompanied the development of agriculture."
  },
  {
    "english": "weather",
    "chinese": "风化，受侵蚀",
    "example": "Stone statues weather over time due to exposure to the elements."
  },
  {
    "english": "discard",
    "chinese": "丢弃",
    "example": "Ancient垃圾 dumps (middens) contain discarded tools and food remains, valuable to archaeologists."
  },
  {
    "english": "quarry",
    "chinese": "采石场",
    "example": "Stone quarries were essential for obtaining materials to build monumental structures."
  },
  {
    "english": "implication",
    "chinese": "可能的后果",
    "example": "Overfarming had severe implications for soil fertility in ancient Mesopotamia."
  },
  {
    "english": "strain",
    "chinese": "压力，重负",
    "example": "Building pyramids placed a significant strain on Egypt's economy and workforce."
  },
  {
    "english": "proportion",
    "chinese": "比例",
    "example": "The proportion of agricultural land to urban areas varied across ancient civilizations."
  },
  {
    "english": "substantial",
    "chinese": "大量的",
    "example": "Substantial evidence shows that ancient peoples had sophisticated astronomical knowledge."
  },
  {
    "english": "attest",
    "chinese": "证明",
    "example": "Fossil records attest to the long history of human migration out of Africa."
  },
  {
    "english": "intensification",
    "chinese": "加剧",
    "example": "The intensification of agriculture led to population growth in river valley civilizations."
  },
  {
    "english": "ornament",
    "chinese": "饰品",
    "example": "Gold ornaments in tombs indicate the high social status of the deceased."
  },
  {
    "english": "attire",
    "chinese": "服装",
    "example": "Ancient Egyptian pharaohs wore elaborate attire decorated with precious stones."
  },
  {
    "english": "opulently",
    "chinese": "富裕地",
    "example": "The opulently decorated palace reflected the wealth of the ruling dynasty."
  },
  {
    "english": "outfit",
    "chinese": "装备",
    "example": "Warriors in ancient China wore armor outfits made of leather and metal scales."
  },
  {
    "english": "bracelet",
    "chinese": "手镯",
    "example": "Archaeologists found a bracelet made of seashells in a Neolithic grave."
  },
  {
    "english": "wear",
    "chinese": "磨损",
    "example": "The wear on ancient tools indicates their specific uses in daily life."
  },
  {
    "english": "fashion",
    "chinese": "制作",
    "example": "Early humans fashioned tools from stone, bone, and antler."
  },
  {
    "english": "instill",
    "chinese": "逐渐灌输",
    "example": "Rituals and ceremonies helped instill cultural values in ancient societies."
  },
  {
    "english": "revere",
    "chinese": "尊敬",
    "example": "Ancient peoples revered the Sun as a deity central to their belief systems."
  },
  {
    "english": "intriguing",
    "chinese": "非常有趣的",
    "example": "The intriguing carvings on the Rosetta Stone puzzled scholars for decades."
  },
  {
    "english": "deliberately",
    "chinese": "故意地",
    "example": "Artifacts were sometimes deliberately broken during burial rituals for symbolic purposes."
  },
  {
    "english": "slip",
    "chinese": "滑落",
    "example": "A slip of the chisel can damage ancient stone carvings during restoration."
  },
  {
    "english": "fragment",
    "chinese": "破碎",
    "example": "Pottery fragments are often pieced together to reconstruct ancient vessels."
  },
  {
    "english": "ceremonially",
    "chinese": "仪式上地",
    "example": "Human remains were ceremonially buried with tools and ornaments in ancient times."
  },
  {
    "english": "decease",
    "chinese": "已故的",
    "example": "The tomb was built for a decease noble, adorned with scenes of their life."
  },
  {
    "english": "mourn",
    "chinese": "哀悼",
    "example": "Elaborate funeral rites allowed communities to mourn and honor the dead."
  },
  {
    "english": "indelible",
    "chinese": "不可磨灭的，无法忘记的",
    "example": "Ancient cave art left an indelible mark on the history of human expression."
  },
  {
    "english": "reunite",
    "chinese": "重逢",
    "example": "Archaeological finds sometimes reunite fragmented parts of ancient sculptures."
  },
  {
    "english": "figurine",
    "chinese": "小雕像",
    "example": "Clay figurines of goddesses were common in Neolithic settlements."
  },
  {
    "english": "ankle",
    "chinese": "踝",
    "example": "Bone analysis of ancient skeletons reveals injuries to the ankle from daily activities."
  },
  {
    "english": "feast",
    "chinese": "宴请",
    "example": "Feast remains in archaeological sites suggest communal gatherings and celebrations."
  },
  {
    "english": "paradoxically",
    "chinese": "出乎意料地",
    "example": "Paradoxically, some nomadic tribes had more diverse diets than sedentary farmers."
  },
  {
    "english": "underlie",
    "chinese": "位于…之下",
    "example": "Geological formations underlie the locations chosen for ancient settlements."
  },
  {
    "english": "elevation",
    "chinese": "高度，海拔",
    "example": "Settlements at high elevations faced unique challenges like low oxygen and cold temperatures."
  }
]