[
  {
    "english": "evolutionary",
    "chinese": "进化的",
    "example": "Evolutionary adaptations allow polar bears to thrive in the Arctic's extreme cold."
  },
  {
    "english": "orb",
    "chinese": "球体",
    "example": "The planet's orbit around the sun forms a near-perfect orb shape."
  },
  {
    "english": "weave",
    "chinese": "编制",
    "example": "Spiders weave intricate webs to capture insects for food."
  },
  {
    "english": "incorporate",
    "chinese": "加入",
    "example": "Modern bird nests often incorporate synthetic materials like plastic alongside natural fibers."
  },
  {
    "english": "zigzag",
    "chinese": "Z 字形的",
    "example": "Fish use zigzag movements to escape from predators in the ocean."
  },
  {
    "english": "ultraviolet",
    "chinese": "紫外线",
    "example": "Bees can see ultraviolet patterns on flowers, which guide them to nectar."
  },
  {
    "english": "alert",
    "chinese": "使警惕",
    "example": "The alarm call of a bird alerts the flock to the presence of a predator."
  },
  {
    "english": "reflect",
    "chinese": "反射",
    "example": "Chameleons reflect different colors to communicate or camouflage themselves."
  },
  {
    "english": "specialize",
    "chinese": "专门从事",
    "example": "Some birds specialize in cracking seeds, while others feed on nectar."
  },
  {
    "english": "nectar",
    "chinese": "花蜜",
    "example": "Butterflies rely on nectar from flowers as their primary food source."
  },
  {
    "english": "constitute",
    "chinese": "组成",
    "example": "Cells constitute the basic building blocks of all living organisms."
  },
  {
    "english": "ornamental",
    "chinese": "装饰性的",
    "example": "Peacock feathers serve both ornamental and mating purposes."
  },
  {
    "english": "correlation",
    "chinese": "相关性",
    "example": "There's a clear correlation between climate change and species migration patterns."
  },
  {
    "english": "rate",
    "chinese": "率",
    "example": "The metabolic rate of hibernating animals decreases significantly during winter."
  },
  {
    "english": "capture",
    "chinese": "捕捉",
    "example": "Predatory plants like Venus flytraps capture insects for nutrients."
  },
  {
    "english": "deprive",
    "chinese": "剥夺",
    "example": "Deforestation deprives many species of their natural habitats."
  },
  {
    "english": "forage",
    "chinese": "觅食",
    "example": "Antelopes forage for vegetation in the African savanna."
  },
  {
    "english": "counterbalance",
    "chinese": "抗衡",
    "example": "The bright colors of poison dart frogs counterbalance their small size as a defense mechanism."
  },
  {
    "english": "swerve",
    "chinese": "转向",
    "example": "Prey animals often swerve abruptly to evade predators during chases."
  },
  {
    "english": "collide",
    "chinese": "碰撞",
    "example": "Male deer collide with their antlers during mating competitions."
  },
  {
    "english": "camouflage",
    "chinese": "掩盖",
    "example": "Stick insects camouflage themselves to resemble twigs and avoid detection."
  },
  {
    "english": "sac",
    "chinese": "囊",
    "example": "Some fish have an air sac that helps them control buoyancy in water."
  },
  {
    "english": "debris",
    "chinese": "碎片",
    "example": "Seabirds often mistake plastic debris for food, leading to ingestion risks."
  },
  {
    "english": "perch",
    "chinese": "栖息",
    "example": "Eagles perch on high cliffs to spot prey from a distance."
  },
  {
    "english": "concealment",
    "chinese": "隐藏",
    "example": "Octopuses use ink and color-changing skin for concealment from predators."
  },
  {
    "english": "enclosed",
    "chinese": "密闭的",
    "example": "Honeybees live in enclosed hives that protect them from the elements."
  },
  {
    "english": "offspring",
    "chinese": "后代",
    "example": "Female lions often move their offspring to new dens to avoid predators."
  },
  {
    "english": "severe",
    "chinese": "严重的",
    "example": "Severe droughts can devastate entire ecosystems and their species."
  },
  {
    "english": "conservation",
    "chinese": "保护",
    "example": "Conservation efforts aim to protect endangered species from extinction."
  },
  {
    "english": "radically",
    "chinese": "彻底地",
    "example": "Climate change is radically altering migration patterns of many bird species."
  },
  {
    "english": "rebound",
    "chinese": "恢复",
    "example": "Populations of some species can rebound if their habitats are restored."
  },
  {
    "english": "prohibit",
    "chinese": "禁止",
    "example": "International laws prohibit the hunting of endangered marine species."
  },
  {
    "english": "bottleneck",
    "chinese": "瓶颈期",
    "example": "A population bottleneck can reduce genetic diversity in species."
  },
  {
    "english": "inbreeding",
    "chinese": "近亲繁殖",
    "example": "Inbreeding in small populations can lead to increased genetic disorders."
  },
  {
    "english": "enhance",
    "chinese": "加强",
    "example": "Some animals enhance their survival by living in social groups."
  },
  {
    "english": "proliferation",
    "chinese": "扩散",
    "example": "The proliferation of invasive species can harm native ecosystems."
  },
  {
    "english": "detrimental",
    "chinese": "毁灭性的",
    "example": "Pollution has a detrimental effect on marine life and coral reefs."
  },
  {
    "english": "selectively",
    "chinese": "有选择地",
    "example": "Animals often selectively eat certain plants to obtain specific nutrients."
  },
  {
    "english": "captive",
    "chinese": "被圈养的",
    "example": "Captive breeding programs help increase populations of endangered species."
  },
  {
    "english": "interbreeding",
    "chinese": "杂交繁殖",
    "example": "Interbreeding between different species can sometimes produce hybrid offspring."
  },
  {
    "english": "crossover",
    "chinese": "转变的",
    "example": "A crossover in behavior allows some species to adapt to urban environments."
  },
  {
    "english": "occurrence",
    "chinese": "发生的事件",
    "example": "The occurrence of natural disasters can significantly impact local ecosystems."
  },
  {
    "english": "persecution",
    "chinese": "迫害",
    "example": "The persecution of predators like wolves has disrupted many ecosystems."
  },
  {
    "english": "elimination",
    "chinese": "消除",
    "example": "The elimination of a top predator can cause a trophic cascade in an ecosystem."
  },
  {
    "english": "carcass",
    "chinese": "尸体",
    "example": "Scavengers like vultures feed on animal carcasses, aiding in decomposition."
  },
  {
    "english": "culpability",
    "chinese": "罪过",
    "example": "Human activities bear much culpability for the current biodiversity crisis."
  },
  {
    "english": "alpine",
    "chinese": "高山的",
    "example": "Alpine plants have adapted to survive in cold, high-altitude environments."
  },
  {
    "english": "entrails",
    "chinese": "内脏（复数）",
    "example": "Some predators feed on the entrails of their prey first for vital nutrients."
  },
  {
    "english": "sufficient",
    "chinese": "充足的",
    "example": "A sufficient food supply is crucial for the survival of any species."
  },
  {
    "english": "canine",
    "chinese": "犬的",
    "example": "Canine species like wolves hunt in packs to take down larger prey."
  },
  {
    "english": "carnivore",
    "chinese": "肉食动物",
    "example": "Carnivores play a key role in maintaining balance in ecosystems."
  },
  {
    "english": "ferocious",
    "chinese": "凶猛的",
    "example": "Ferocious predators like lions are apex species in their habitats."
  },
  {
    "english": "repertoire",
    "chinese": "一系列",
    "example": "Birds have a repertoire of calls for different social interactions."
  },
  {
    "english": "instinct",
    "chinese": "天性",
    "example": "Migration is an innate instinct in many bird species."
  },
  {
    "english": "niche",
    "chinese": "生态位",
    "chinese": "生态位",
    "example": "Each species occupies a unique niche within its ecosystem."
  },
  {
    "english": "tundra",
    "chinese": "冻原",
    "example": "The Arctic tundra is home to species adapted to extreme cold conditions."
  },
  {
    "english": "hemisphere",
    "chinese": "半球",
    "example": "Some species migrate between hemispheres to follow seasonal resources."
  },
  {
    "english": "encroach",
    "chinese": "侵占",
    "example": "Human development continues to encroach on natural habitats worldwide."
  },
  {
    "english": "sighting",
    "chinese": "目睹",
    "example": "The rare bird sighting excited ornithologists studying local fauna."
  },
  {
    "english": "permanent",
    "chinese": "永久的",
    "example": "Climate change is causing permanent shifts in many species' ranges."
  }
]