[
    {
        "english": "utilize",
        "chinese": "使用",
        "example": "They utilize advanced technology to improve production efficiency."
    },
    {
        "english": "emperor",
        "chinese": "皇帝",
        "example": "The emperor ruled the empire with absolute power in ancient times."
    },
    {
        "english": "empress",
        "chinese": "皇后",
        "example": "The empress was known for her wisdom and kindness towards the people."
    },
    {
        "english": "empire",
        "chinese": "帝国",
        "example": "The Roman Empire once covered a vast area of Europe and Africa."
    },
    {
        "english": "kingdom",
        "chinese": "王国",
        "example": "The kingdom prospered under the rule of the wise king."
    },
    {
        "english": "object",
        "chinese": "物品",
        "example": "The ancient object was discovered during the archaeological excavation."
    },
    {
        "english": "item",
        "chinese": "物品",
        "example": "Please check each item on the shopping list before leaving the store."
    },
    {
        "english": "goods",
        "chinese": "商品",
        "example": "The port handles a large quantity of goods from all over the world."
    },
    {
        "english": "craft",
        "chinese": "工艺品",
        "example": "The market is famous for its traditional handcrafted goods and local crafts."
    },
    {
        "english": "specialization",
        "chinese": "专业化",
        "example": "Specialization in a specific field can lead to greater expertise and success."
    },
    {
        "english": "commercialization",
        "chinese": "商业化",
        "example": "The commercialization of the product has brought significant profits to the company."
    },
    {
        "english": "surplus",
        "chinese": "剩余，盈余",
        "example": "The farm produced a surplus of wheat, which was sold to other regions."
    },
    {
        "english": "stimulate",
        "chinese": "刺激",
        "example": "The new policy aims to stimulate economic growth and create more jobs."
    },
    {
        "english": "honor",
        "chinese": "荣誉",
        "example": "Winning the championship brought great honor to the entire team."
    },
    {
        "english": "mass",
        "chinese": "大量的",
        "example": "The mass production of goods made them more affordable for consumers."
    },
    {
        "english": "conquest",
        "chinese": "征服",
        "example": "The conquest of new territories expanded the empire's influence and resources."
    },
    {
        "english": "depict",
        "chinese": "描绘",
        "example": "The painting depicts a beautiful landscape with mountains and a river."
    },
    {
        "english": "exceptional",
        "chinese": "特殊的",
        "example": "Her exceptional talent in music amazed everyone at the concert."
    },
    {
        "english": "flourish",
        "chinese": "繁荣",
        "example": "The city's economy began to flourish after the new trade routes were established."
    },
    {
        "english": "supervise",
        "chinese": "监督",
        "example": "A manager is responsible for supervising the daily operations of the department."
    },
    {
        "english": "oversee",
        "chinese": "监督",
        "example": "The project manager will oversee the entire construction process to ensure quality."
    },
    {
        "english": "steel",
        "chinese": "钢",
        "example": "Steel is widely used in construction due to its strength and durability."
    },
    {
        "english": "iron",
        "chinese": "铁",
        "example": "The ancient blacksmith crafted tools and weapons from iron."
    },
    {
        "english": "ceremony",
        "chinese": "仪式",
        "example": "The opening ceremony of the festival featured traditional dances and music."
    },
    {
        "english": "sufficient",
        "chinese": "足够的",
        "example": "Make sure you have sufficient supplies before starting the long journey."
    },
    {
        "english": "carbon",
        "chinese": "碳",
        "example": "Carbon emissions have become a major environmental concern worldwide."
    },
    {
        "english": "impurity",
        "chinese": "杂质",
        "example": "Removing impurities from the metal is an important step in the refining process."
    },
    {
        "english": "jade",
        "chinese": "玉",
        "example": "Jade has been valued for its beauty and symbolism in many ancient cultures."
    },
    {
        "english": "bronze",
        "chinese": "青铜",
        "example": "The bronze statue stood in the center of the square, representing the city's history."
    },
    {
        "english": "supervisor",
        "chinese": "监督者",
        "example": "The supervisor checked the work of the employees to ensure it met the standards."
    },
    {
        "english": "philosophy",
        "chinese": "哲学",
        "example": "Studying philosophy can help you think deeply about life and the world."
    },
    {
        "english": "unify",
        "chinese": "统一",
        "example": "The leader worked to unify the different regions into a single nation."
    },
    {
        "english": "rival",
        "chinese": "对手",
        "example": "The two companies have been rivals in the market for many years."
    },
    {
        "english": "fragmented",
        "chinese": "分裂的",
        "example": "The fragmented kingdom was eventually united under one ruler."
    },
    {
        "english": "morality",
        "chinese": "道德",
        "example": "Teaching morality and ethics is an important part of education."
    },
    {
        "english": "obligation",
        "chinese": "义务",
        "example": "As citizens, we have an obligation to follow the laws of the country."
    },
    {
        "english": "subject",
        "chinese": "臣民",
        "example": "The subjects of the king respected him for his fairness and wisdom."
    },
    {
        "english": "ceramics",
        "chinese": "陶瓷",
        "example": "The museum has a large collection of ancient ceramics from different dynasties."
    },
    {
        "english": "porcelain",
        "chinese": "瓷器",
        "example": "Chinese porcelain was highly valued and traded along the Silk Road."
    },
    {
        "english": "pottery",
        "chinese": "陶器",
        "example": "The pottery workshop teaches people how to make traditional ceramic items."
    },
    {
        "english": "precise",
        "chinese": "精确的",
        "example": "Making precision instruments requires very precise measurements and skills."
    },
    {
        "english": "interchangeable",
        "chinese": "可互换的",
        "example": "The parts of the machine are interchangeable, making repairs easier."
    },
    {
        "english": "foundation",
        "chinese": "基础",
        "example": "A strong foundation in math is essential for studying advanced science."
    },
    {
        "english": "elaborate",
        "chinese": "精心制作的",
        "example": "The elaborate design of the palace took many years to complete."
    },
    {
        "english": "refined",
        "chinese": "精美的",
        "example": "The refined craftsmanship of the jewelry made it a valuable treasure."
    },
    {
        "english": "confine",
        "chinese": "限制",
        "example": "Don't confine your thinking to traditional methods; try something new."
    },
    {
        "english": "manufacture",
        "chinese": "制造",
        "example": "The factory manufactures a wide range of products for domestic and international markets."
    },
    {
        "english": "replace",
        "chinese": "替代",
        "example": "Electric cars are gradually replacing traditional gasoline-powered vehicles."
    },
    {
        "english": "exceptional",
        "chinese": "卓越的",
        "example": "His exceptional leadership skills inspired the team to achieve great results."
    },
    {
        "english": "equip",
        "chinese": "使……装备",
        "example": "The school aims to equip students with the skills needed for the future job market."
    },
    {
        "english": "estimate",
        "chinese": "估计",
        "example": "The company estimated the cost of the project to be around $1 million."
    },
    {
        "english": "depiction",
        "chinese": "描绘",
        "example": "The book's vivid depiction of life in the countryside felt very realistic."
    },
    {
        "english": "vast",
        "chinese": "广阔的",
        "example": "The vast desert stretched as far as the eye could see, with no sign of life."
    },
    {
        "english": "acrobat",
        "chinese": "杂技演员",
        "example": "The acrobat's amazing performance won loud applause from the audience."
    }
]