[
  {
    "english": "mass consumption",
    "chinese": "大众消费",
    "example": "The rise of mass consumption in the 20th century transformed global manufacturing economies."
  },
  {
    "english": "format",
    "chinese": "形式",
    "example": "E-books have revolutionized the format in which we consume written content."
  },
  {
    "english": "parlor",
    "chinese": "店堂",
    "example": "Early film parlors in the 1900s were some of the first public spaces for mass entertainment."
  },
  {
    "english": "projector",
    "chinese": "放映机，投影仪",
    "example": "Modern projectors can display high-definition images in large auditoriums."
  },
  {
    "english": "purchase",
    "chinese": "购买",
    "example": "Consumers increasingly rely on online platforms to purchase everyday goods."
  },
  {
    "english": "admission",
    "chinese": "入场费",
    "example": "The museum offers free admission to students to promote cultural accessibility."
  },
  {
    "english": "ultimate",
    "chinese": "最终的",
    "example": "Sustainability has become the ultimate goal for many modern businesses."
  },
  {
    "english": "spectator",
    "chinese": "观众",
    "example": "Spectators at the digital art exhibition interacted with immersive installations."
  },
  {
    "english": "assemble",
    "chinese": "汇编，组装",
    "example": "Tech companies assemble components from global suppliers to build smartphones."
  },
  {
    "english": "substance",
    "chinese": "本质，实质",
    "example": "The research paper lacks substance despite its elaborate terminology."
  },
  {
    "english": "marvel",
    "chinese": "奇迹，成就",
    "example": "The Great Wall of China is a marvel of ancient engineering."
  },
  {
    "english": "manipulation",
    "chinese": "操作，使用",
    "example": "Digital manipulation of images has transformed the advertising industry."
  },
  {
    "english": "celluloid",
    "chinese": "（旧时摄影用的）胶片，赛璐珞片",
    "example": "Early filmmakers used celluloid to create the first motion pictures."
  },
  {
    "english": "dimension",
    "chinese": "尺寸",
    "example": "3D printing allows creators to produce objects in any imaginable dimension."
  },
  {
    "english": "ballad",
    "chinese": "民谣，叙事诗歌",
    "example": "Traditional ballads often recount historical events through musical storytelling."
  },
  {
    "english": "minority",
    "chinese": "少数",
    "example": "Minority languages are often preserved through digital archiving projects."
  },
  {
    "english": "amount to",
    "chinese": "等同于",
    "example": "These small actions amount to significant environmental benefits over time."
  },
  {
    "english": "treasured",
    "chinese": "珍藏的",
    "example": "Museums worldwide hold treasured artifacts from ancient civilizations."
  },
  {
    "english": "intensive reading",
    "chinese": "精读",
    "example": "Intensive reading of academic papers helps students master complex theories."
  },
  {
    "english": "devotion",
    "chinese": "宗教敬拜",
    "example": "The temple's architecture reflects the ancient civilization's devotion to the sun god."
  },
  {
    "english": "slash",
    "chinese": "大大降低",
    "example": "The company decided to slash production costs by adopting new technologies."
  },
  {
    "english": "accelerate",
    "chinese": "加快",
    "example": "Government policies aim to accelerate the transition to renewable energy."
  },
  {
    "english": "cable",
    "chinese": "电缆",
    "example": "Underwater cables transmit internet data across vast ocean distances."
  },
  {
    "english": "inaugurate",
    "chinese": "开创",
    "example": "The invention of the printing press inaugurated the modern era of information dissemination."
  },
  {
    "english": "radical",
    "chinese": "彻底的",
    "example": "Radical changes in urban planning are needed to address climate challenges."
  },
  {
    "english": "subject",
    "chinese": "易遭受…的",
    "example": "Coastal cities are subject to increasing risks from rising sea levels."
  },
  {
    "english": "proliferate",
    "chinese": "激增",
    "example": "Social media platforms have caused information to proliferate at unprecedented speeds."
  },
  {
    "english": "erroneous",
    "chinese": "错误的",
    "example": "Erroneous data can lead to flawed conclusions in scientific research."
  },
  {
    "english": "grid",
    "chinese": "方格",
    "example": "Urban planners use grid systems to organize city streets efficiently."
  },
  {
    "english": "longitude",
    "chinese": "经度",
    "example": "GPS technology precisely calculates longitude and latitude for global positioning."
  },
  {
    "english": "compile",
    "chinese": "汇编，编写",
    "example": "Scholars compile historical records to reconstruct ancient civilizations' daily lives."
  },
  {
    "english": "trait",
    "chinese": "特点",
    "example": "One key trait of successful startups is adaptability to market changes."
  },
  {
    "english": "retain",
    "chinese": "保留",
    "example": "Digital archives help retain cultural heritage for future generations."
  },
  {
    "english": "hemisphere",
    "chinese": "半球",
    "example": "Climate patterns differ significantly between the northern and southern hemispheres."
  },
  {
    "english": "overthrow",
    "chinese": "推翻",
    "example": "Innovations in renewable energy could overthrow traditional fossil fuel industries."
  },
  {
    "english": "predecessor",
    "chinese": "前一代，前辈",
    "example": "This new software version addresses issues present in its predecessor."
  },
  {
    "english": "context",
    "chinese": "背景",
    "example": "Understanding historical context is crucial for interpreting ancient art."
  },
  {
    "english": "undermine",
    "chinese": "逐渐削弱",
    "example": "Misinformation can undermine public trust in scientific institutions."
  },
  {
    "english": "stimulus",
    "chinese": "刺激物",
    "example": "Economic stimulus packages aim to boost growth during recessions."
  },
  {
    "english": "doctrine",
    "chinese": "学说，信条",
    "example": "Enlightenment doctrines emphasized reason and individual rights."
  },
  {
    "english": "scribe",
    "chinese": "抄写员",
    "example": "In ancient Egypt, scribes played a vital role in recording historical events."
  },
  {
    "english": "monopoly",
    "chinese": "垄断",
    "example": "Antitrust laws prevent corporations from establishing market monopolies."
  },
  {
    "english": "renowned",
    "chinese": "有名的",
    "example": "The renowned scientist published groundbreaking research on climate systems."
  },
  {
    "english": "edition",
    "chinese": "版本",
    "example": "The revised edition of the textbook includes updated scientific findings."
  },
  {
    "english": "obscure",
    "chinese": "未被发现的",
    "example": "Archaeologists discovered an obscure ancient village buried under volcanic ash."
  },
  {
    "english": "secular",
    "chinese": "世俗的",
    "example": "The Renaissance saw a shift toward secular themes in art and literature."
  },
  {
    "english": "patronage",
    "chinese": "赞助",
    "example": "Artists in the Middle Ages relied on royal patronage to fund their work."
  },
  {
    "english": "inclined",
    "chinese": "倾向于",
    "example": "Younger generations are inclined to use digital platforms for learning."
  },
  {
    "english": "uncover",
    "chinese": "发现",
    "example": "DNA analysis helped uncover new insights into ancient human migration patterns."
  },
  {
    "english": "anatomy",
    "chinese": "身体结构",
    "example": "Medical students study human anatomy to understand physiological functions."
  },
  {
    "english": "acumen",
    "chinese": "聪明，敏锐",
    "example": "Business leaders need financial acumen to navigate economic uncertainties."
  },
  {
    "english": "ascendance",
    "chinese": "优势地位",
    "example": "The internet's ascendance has transformed global communication systems."
  },
  {
    "english": "dye",
    "chinese": "染料",
    "example": "Natural dyes were used in ancient textiles to create vibrant colors."
  },
  {
    "english": "impose",
    "chinese": "强制执行",
    "example": "Governments impose regulations to protect consumers from fraudulent practices."
  },
  {
    "english": "prevail",
    "chinese": "盛行",
    "example": "Democratic values gradually began to prevail in modern political systems."
  },
  {
    "english": "counterpart",
    "chinese": "对应的事物",
    "example": "The metric system in the U.S. has yet to replace its imperial counterpart fully."
  },
  {
    "english": "project",
    "chinese": "投影，放映",
    "example": "Interactive installations project digital images onto physical spaces."
  },
  {
    "english": "device",
    "chinese": "设备",
    "example": "Wearable devices have become essential for monitoring personal health."
  },
  {
    "english": "successive",
    "chinese": "连续的",
    "example": "Successive droughts have severely impacted agricultural yields in the region."
  },
  {
    "english": "exhibitor",
    "chinese": "放映商",
    "example": "Independent exhibitors often showcase alternative films in local cinemas."
  },
  {
    "english": "readily",
    "chinese": "快捷便利地",
    "example": "Digital libraries allow users to readily access millions of publications."
  },
  {
    "english": "advent",
    "chinese": "出现，到来",
    "example": "The advent of social media transformed how information spreads globally."
  },
  {
    "english": "spectacle",
    "chinese": "精彩的表演",
    "example": "The opening ceremony of the Olympics is a global spectacle."
  },
  {
    "english": "ceremony",
    "chinese": "庆典，仪式",
    "example": "Traditional ceremonies often incorporate elements of local culture and history."
  },
  {
    "english": "accompany",
    "chinese": "附加，兼带",
    "example": "Music often accompanies silent films to enhance emotional impact."
  },
  {
    "english": "reproduce",
    "chinese": "再现",
    "example": "3D printers can reproduce complex objects with high precision."
  },
  {
    "english": "commonplace",
    "chinese": "平凡普通的",
    "example": "Smartphones have become commonplace in daily life worldwide."
  },
  {
    "english": "strip",
    "chinese": "条，带",
    "example": "Film strips were the primary medium for motion pictures before digital technology."
  },
  {
    "english": "minuscule",
    "chinese": "微小的",
    "example": "Minuscule particles in the atmosphere contribute to air pollution."
  },
  {
    "english": "unprecedented",
    "chinese": "前所未有的",
    "example": "The pandemic caused unprecedented disruptions to global supply chains."
  },
  {
    "english": "circulate",
    "chinese": "流通",
    "example": "Central banks regulate how currency circulates in the economy."
  },
  {
    "english": "literacy",
    "chinese": "识字，有读写能力",
    "example": "Global literacy rates have improved significantly over the past century."
  },
  {
    "english": "watershed",
    "chinese": "分水岭",
    "example": "The invention of the printing press was a watershed moment in human history."
  },
  {
    "english": "discard",
    "chinese": "丢弃",
    "example": "Electronic waste is often discarded improperly, causing environmental harm."
  },
  {
    "english": "diversion",
    "chinese": "消遣，娱乐",
    "example": "Streaming services provide endless diversion for modern audiences."
  },
  {
    "english": "spark",
    "chinese": "引发",
    "example": "Scientific breakthroughs often spark new technological innovations."
  },
  {
    "english": "diffusion",
    "chinese": "传播，扩散",
    "example": "The diffusion of agricultural techniques across continents transformed human societies."
  },
  {
    "english": "track",
    "chinese": "轨道",
    "example": "Satellites orbit Earth on precise tracks for communication and research."
  },
  {
    "english": "mileage",
    "chinese": "里程，英里数",
    "example": "Electric vehicles have significantly improved their mileage in recent years."
  },
  {
    "english": "culminate",
    "chinese": "以…告终",
    "example": "Years of research culminated in the development of a life-saving vaccine."
  },
  {
    "english": "refine",
    "chinese": "提炼",
    "example": "Scientists refine data to ensure accuracy in their research findings."
  },
  {
    "english": "manufacturer",
    "chinese": "生产商",
    "example": "Car manufacturers are shifting toward electric vehicle production."
  },
  {
    "english": "cautiously",
    "chinese": "慎重地",
    "example": "Researchers approach new theories cautiously to avoid premature conclusions."
  },
  {
    "english": "circumference",
    "chinese": "圆周长",
    "example": "The circumference of Earth is approximately 40,075 kilometers."
  },
  {
    "english": "latitude",
    "chinese": "纬度",
    "example": "Temperature variations are more extreme at higher latitudes."
  },
  {
    "english": "atlas",
    "chinese": "地图册",
    "example": "Modern atlases incorporate satellite imagery for detailed geographical representation."
  },
  {
    "english": "accumulate",
    "chinese": "累积",
    "example": "Plastic waste continues to accumulate in ocean ecosystems, threatening marine life."
  },
  {
    "english": "accuracy",
    "chinese": "准确性",
    "example": "GPS technology provides remarkable accuracy in determining location."
  },
  {
    "english": "counterbalance",
    "chinese": "抵消，起平衡作用",
    "example": "Renewable energy sources help counterbalance carbon emissions from fossil fuels."
  },
  {
    "english": "symmetry",
    "chinese": "对称",
    "example": "Ancient architects often incorporated symmetry in temple designs."
  },
  {
    "english": "intellectual",
    "chinese": "知识的，脑力的",
    "example": "Intellectual curiosity drives scientific exploration and discovery."
  },
  {
    "english": "undergo",
    "chinese": "经历",
    "example": "Climate models undergo constant refinement to improve predictive accuracy."
  },
  {
    "english": "dramatic",
    "chinese": "突出的，显著的",
    "example": "Dramatic changes in climate patterns have impacted agricultural systems globally."
  },
  {
    "english": "cosmos",
    "chinese": "宇宙",
    "example": "Astronomers study the cosmos to understand its origin and evolution."
  },
  {
    "english": "exemplary",
    "chinese": "典范的",
    "example": "The sustainable city project serves as an exemplary model for urban development."
  },
  {
    "english": "movable type",
    "chinese": "活字印刷术",
    "example": "Movable type revolutionized publishing by enabling mass production of books."
  },
  {
    "english": "obsolete",
    "chinese": "过时的，淘汰的",
    "example": "Floppy disks have become obsolete with the rise of cloud storage."
  },
  {
    "english": "collaborate",
    "chinese": "合作",
    "example": "Scientists collaborate across borders to address global challenges like climate change."
  },
  {
    "english": "conceivable",
    "chinese": "可理解的",
    "example": "It is conceivable that artificial intelligence will transform various industries in the coming years."
  },
  {
    "english": "disseminate",
    "chinese": "散布，传播",
    "example": "Social media platforms are used to disseminate information rapidly worldwide."
  },
  {
    "english": "revival",
    "chinese": "复兴",
    "example": "There has been a revival of interest in traditional crafts among younger generations."
  },
  {
    "english": "align",
    "chinese": "与…一致",
    "example": "Company policies should align with environmental sustainability goals."
  },
  {
    "english": "render",
    "chinese": "使…成为",
    "example": "Climate change could render certain regions uninhabitable in the future."
  },
  {
    "english": "forefront",
    "chinese": "最重要的位置",
    "example": "Technology companies are at the forefront of innovation in artificial intelligence."
  },
  {
    "english": "rendition",
    "chinese": "视觉形象",
    "example": "The artist's rendition of the ancient city amazed visitors at the exhibition."
  },
  {
    "english": "attribute",
    "chinese": "把…归因于",
    "example": "Researchers attribute the rise in allergies to environmental factors."
  },
  {
    "english": "novice",
    "chinese": "新手，初学者",
    "example": "Novice programmers often start by learning basic coding languages."
  },
  {
    "english": "rinse",
    "chinese": "漂洗",
    "example": "Textile factories rinse fabrics to remove excess dye and chemicals."
  },
  {
    "english": "repressive",
    "chinese": "压制的，专制的",
    "example": "Repressive policies often lead to social unrest and political change."
  },
  {
    "english": "disperse",
    "chinese": "分散",
    "example": "Wind can disperse seeds over long distances, aiding plant reproduction."
  },
  {
    "english": "greed",
    "chinese": "贪欲",
    "example": "Corporate greed has been linked to environmental degradation and social inequality."
  },
  {
    "english": "decentralize",
    "chinese": "分散",
    "example": "Technology allows companies to decentralize their operations globally."
  }
]