[
  {
    "english": "device",
    "chinese": "设备",
    "example": "She used a special device to measure the temperature accurately."
  },
  {
    "english": "landscape",
    "chinese": "风景，地形",
    "example": "The landscape of the mountain range is breathtakingly beautiful."
  },
  {
    "english": "dominate",
    "chinese": "支配",
    "example": "This company dominates the market with its innovative products."
  },
  {
    "english": "occupy",
    "chinese": "占据，占用",
    "example": "The old building occupies a large area in the city center."
  },
  {
    "english": "closure",
    "chinese": "关闭；封闭；了结",
    "example": "The closure of the factory led to many job losses."
  },
  {
    "english": "herd",
    "chinese": "兽群，牧群",
    "example": "A herd of deer was grazing in the meadow at dawn."
  },
  {
    "english": "annually",
    "chinese": "每年，每年一次",
    "example": "The international conference is held annually in different cities."
  },
  {
    "english": "chemical",
    "chinese": "化学的",
    "example": "Chemical reactions can produce heat and light under certain conditions."
  },
  {
    "english": "decay",
    "chinese": "腐烂",
    "example": "The fallen leaves will gradually decay and become part of the soil."
  },
  {
    "english": "preservation",
    "chinese": "保存",
    "example": "The preservation of ancient artifacts is crucial for historical research."
  },
  {
    "english": "literally",
    "chinese": "字面上地",
    "example": "The word \"literally\" means exactly what it says, not metaphorically."
  },
  {
    "english": "sufficiently",
    "chinese": "足够地，充分地",
    "example": "She didn't prepare sufficiently for the exam and failed to get a good grade."
  },
  {
    "english": "composition",
    "chinese": "构成，组成",
    "example": "The composition of the earth's atmosphere includes oxygen, nitrogen, and other gases."
  },
  {
    "english": "crystal",
    "chinese": "结晶，晶体",
    "example": "Sugar forms small crystals when it is heated and then cooled."
  },
  {
    "english": "relatively",
    "chinese": "相对地",
    "example": "This book is relatively easy compared to the others on the same subject."
  },
  {
    "english": "fulfill",
    "chinese": "完成，达到",
    "example": "He worked hard to fulfill his dream of becoming a doctor."
  },
  {
    "english": "imitation",
    "chinese": "仿制品，模仿",
    "example": "The painting is an imitation of a famous masterpiece from the Renaissance."
  },
  {
    "english": "fantasy",
    "chinese": "幻想，想象",
    "example": "The story is a work of fantasy, combining magic and adventure."
  },
  {
    "english": "permit",
    "chinese": "许可，准许",
    "example": "Visitors are not permitted to take photos in the museum."
  },
  {
    "english": "anxiety",
    "chinese": "焦虑，忧虑",
    "example": "Many students experience anxiety before important exams."
  },
  {
    "english": "confront",
    "chinese": "面对",
    "example": "We must confront the challenges ahead with courage and determination."
  },
  {
    "english": "household",
    "chinese": "一家人",
    "example": "The whole household gathered together for the holiday dinner."
  },
  {
    "english": "autonomy",
    "chinese": "自治",
    "example": "The region was granted a high degree of autonomy in managing its internal affairs."
  },
  {
    "english": "instability",
    "chinese": "不稳定",
    "example": "Political instability can have a negative impact on the economy."
  },
  {
    "english": "originally",
    "chinese": "原来地",
    "example": "This song was originally written in Spanish and later translated into English."
  },
  {
    "english": "available",
    "chinese": "可获得的",
    "example": "There are several available seats left for the concert tomorrow."
  },
  {
    "english": "phenomenon",
    "chinese": "现象",
    "example": "The Northern Lights is a natural phenomenon that attracts many tourists."
  },
  {
    "english": "cooperation",
    "chinese": "合作",
    "example": "Success in this project relies on close cooperation among all team members."
  },
  {
    "english": "principle",
    "chinese": "原则",
    "example": "He always acts according to the principle of honesty and integrity."
  },
  {
    "english": "conventional",
    "chinese": "传统的",
    "example": "Conventional methods of teaching are being combined with new technologies."
  },
  {
    "english": "spectrum",
    "chinese": "光谱，波谱",
    "example": "The rainbow shows the full spectrum of visible light."
  },
  {
    "english": "bull",
    "chinese": "公牛",
    "example": "Bulls are often used in traditional farming for plowing fields."
  },
  {
    "english": "celebrity",
    "chinese": "名人",
    "example": "Many celebrities use their influence to raise awareness about social issues."
  },
  {
    "english": "spoon",
    "chinese": "勺子",
    "example": "She used a spoon to stir the sugar into her coffee."
  },
  {
    "english": "athlete",
    "chinese": "运动员",
    "example": "The athlete trained hard for years before competing in the Olympics."
  },
  {
    "english": "fuel",
    "chinese": "燃料",
    "example": "Gasoline is a common fuel used in most cars today."
  },
  {
    "english": "fate",
    "chinese": "命运",
    "example": "Some people believe that fate determines what happens in their lives."
  },
  {
    "english": "chart",
    "chinese": "图表",
    "example": "The chart shows the sales figures for each month of the year."
  },
  {
    "english": "absorb",
    "chinese": "吸收",
    "example": "Sponges can absorb a large amount of water."
  },
  {
    "english": "fiber",
    "chinese": "纤维",
    "example": "Eating foods high in fiber is good for digestive health."
  },
  {
    "english": "flaw",
    "chinese": "缺陷",
    "example": "The diamond had a small flaw that was barely visible to the naked eye."
  },
  {
    "english": "combat",
    "chinese": "战斗",
    "example": "Soldiers were sent to combat the enemy forces near the border."
  },
  {
    "english": "horn",
    "chinese": "角",
    "example": "The rhinoceros has a large horn on its nose."
  },
  {
    "english": "herder",
    "chinese": "牧羊人",
    "example": "The herder guided the sheep to graze in the green pastures."
  },
  {
    "english": "evaluate",
    "chinese": "评估",
    "example": "Teachers evaluate students' performance through tests and assignments."
  },
  {
    "english": "conduct",
    "chinese": "传导",
    "example": "Metals like copper and aluminum can conduct electricity well."
  },
  {
    "english": "compose",
    "chinese": "组成",
    "example": "Water is composed of two hydrogen atoms and one oxygen atom."
  },
  {
    "english": "fiction",
    "chinese": "虚构作品",
    "example": "Science fiction often explores possible future scenarios."
  },
  {
    "english": "motive",
    "chinese": "动机",
    "example": "The police are trying to determine the motive behind the crime."
  },
  {
    "english": "construct",
    "chinese": "建造",
    "example": "They plan to construct a new bridge over the river."
  },
  {
    "english": "perspective",
    "chinese": "视角",
    "example": "Looking at the problem from a different perspective can lead to new solutions."
  },
  {
    "english": "primary",
    "chinese": "主要的",
    "example": "The primary goal of this project is to improve public transportation."
  },
  {
    "english": "flourish",
    "chinese": "繁荣",
    "example": "The arts flourished during the Renaissance period."
  },
  {
    "english": "diminish",
    "chinese": "减少",
    "example": "The effects of the medication will gradually diminish over time."
  },
  {
    "english": "fossilize",
    "chinese": "变成化石",
    "example": "It takes millions of years for organic matter to fossilize."
  },
  {
    "english": "presence",
    "chinese": "存在",
    "example": "The presence of water is essential for life as we know it."
  },
  {
    "english": "navigation",
    "chinese": "航行",
    "example": "Modern ships use advanced technology for navigation at sea."
  },
  {
    "english": "reverse",
    "chinese": "相反",
    "example": "The reverse of this coin features a portrait of the king."
  },
  {
    "english": "dense",
    "chinese": "密集的",
    "example": "The dense forest made it difficult to see far ahead."
  },
  {
    "english": "puzzling",
    "chinese": "令人困惑的",
    "example": "The mysterious disappearance of the hiker remains a puzzling case."
  },
  {
    "english": "trigger",
    "chinese": "触发",
    "example": "Certain foods can trigger allergies in some people."
  },
  {
    "english": "encounter",
    "chinese": "遇到",
    "example": "During the hike, we encountered a group of rare birds."
  },
  {
    "english": "effectiveness",
    "chinese": "有效性",
    "example": "The effectiveness of the new treatment is being studied in clinical trials."
  },
  {
    "english": "scarce",
    "chinese": "稀缺的",
    "example": "Clean water is becoming increasingly scarce in some regions."
  },
  {
    "english": "mixture",
    "chinese": "混合物",
    "example": "The drink is a mixture of fruit juices and soda."
  },
  {
    "english": "emphasize",
    "chinese": "强调",
    "example": "The teacher emphasized the importance of practicing regularly."
  },
  {
    "english": "define",
    "chinese": "定义",
    "example": "It is difficult to define exactly what constitutes art."
  },
  {
    "english": "temperature",
    "chinese": "温度",
    "example": "The temperature in the desert can vary greatly between day and night."
  },
  {
    "english": "dwelling",
    "chinese": "住所",
    "example": "Their dwelling was a small cottage surrounded by trees."
  },
  {
    "english": "geometric",
    "chinese": "几何的",
    "example": "The building has a unique geometric design with many angles."
  },
  {
    "english": "precede",
    "chinese": "在...之前",
    "example": "A heavy rainstorm preceded the thunder and lightning."
  },
  {
    "english": "implement",
    "chinese": "实施",
    "example": "The government plans to implement new policies to reduce pollution."
  },
  {
    "english": "consequence",
    "chinese": "后果",
    "example": "There can be serious consequences for breaking the law."
  },
  {
    "english": "accustom",
    "chinese": "使...习惯于",
    "example": "It took him a while to accustom himself to the new schedule."
  },
  {
    "english": "ash",
    "chinese": "灰烬",
    "example": "After the fire, only ash and rubble remained of the old house."
  },
  {
    "english": "demonstrate",
    "chinese": "展示",
    "example": "The scientist will demonstrate the experiment to the class."
  },
  {
    "english": "relevant",
    "chinese": "相关的",
    "example": "Please provide only relevant information for the investigation."
  },
  {
    "english": "vertical",
    "chinese": "垂直的",
    "example": "The wall was not perfectly vertical, which caused some structural issues."
  },
  {
    "english": "fracture",
    "chinese": "断裂",
    "example": "The doctor said he had a fracture in his wrist and needed a cast."
  },
  {
    "english": "scholar",
    "chinese": "学者",
    "example": "The scholar has written many books on ancient history."
  },
  {
    "english": "empirical",
    "chinese": "经验的",
    "example": "Empirical evidence is based on observation and experimentation."
  },
  {
    "english": "conductance",
    "chinese": "电导率",
    "example": "The conductance of the material was measured in the laboratory."
  },
  {
    "english": "spine",
    "chinese": "脊柱",
    "example": "Injuries to the spine can cause serious and long-lasting problems."
  },
  {
    "english": "tissue",
    "chinese": "组织",
    "example": "Muscle tissue allows the body to move and function."
  },
  {
    "english": "prey",
    "chinese": "猎物",
    "example": "The lion stalked its prey quietly through the grass."
  },
  {
    "english": "suppress",
    "chinese": "抑制",
    "example": "Medication can help suppress the symptoms of the illness."
  },
  {
    "english": "reconstruction",
    "chinese": "重建",
    "example": "The reconstruction of the city after the earthquake took many years."
  },
  {
    "english": "archaeology",
    "chinese": "考古学",
    "example": "Archaeology helps us understand the lives of people from the past."
  },
  {
    "english": "linguistic",
    "chinese": "语言的",
    "example": "Linguistic studies focus on the structure and use of language."
  }
]