[
    {
        "english": "comprise",
        "chinese": "包含",
        "example": "The course comprises 12 modules, each focusing on different aspects of environmental science."
    },
    {
        "english": "layer",
        "chinese": "层",
        "example": "The Earth's crust is made up of several layers, each with distinct geological properties."
    },
    {
        "english": "glacial",
        "chinese": "冰川的",
        "example": "Glacial movements over millions of years have shaped the unique landscape of the Rocky Mountains."
    },
    {
        "english": "deposit",
        "chinese": "沉积层",
        "example": "Fossils are often found in sedimentary deposits, preserving traces of ancient life forms."
    },
    {
        "english": "aforementioned",
        "chinese": "上述的",
        "example": "The aforementioned study provides compelling evidence for the new climate change model."
    },
    {
        "english": "landmass",
        "chinese": "陆块",
        "example": "The breakup of the supercontinent Pangaea into separate landmasses occurred over millions of years."
    },
    {
        "english": "pamphlet",
        "chinese": "小册子",
        "example": "The organization distributed a pamphlet explaining the importance of marine conservation efforts."
    },
    {
        "english": "drift",
        "chinese": "漂移",
        "example": "Continental drift theory explains how Earth's continents move slowly across the planet's surface."
    },
    {
        "english": "lateral",
        "chinese": "侧面的",
        "example": "Lateral thinking helps solve problems by approaching them from unconventional perspectives."
    },
    {
        "english": "envision",
        "chinese": "想象",
        "example": "Scientists envision a future where renewable energy sources power most of the world's infrastructure."
    },
    {
        "english": "equator",
        "chinese": "赤道",
        "example": "Countries near the equator experience relatively consistent temperatures throughout the year."
    },
    {
        "english": "rotation",
        "chinese": "旋转",
        "example": "Earth's rotation on its axis causes the cycle of day and night we experience daily."
    },
    {
        "english": "supposedly",
        "chinese": "据说",
        "example": "The ancient artifact is supposedly over 2,000 years old, but experts are still verifying its origin."
    },
    {
        "english": "gigantic",
        "chinese": "巨大的",
        "example": "The company made a gigantic investment in renewable energy to reduce its carbon footprint."
    },
    {
        "english": "tidal",
        "chinese": "潮汐的",
        "example": "Tidal energy harnesses the power of ocean tides to generate clean, renewable electricity."
    },
    {
        "english": "meteorologist",
        "chinese": "气象学家",
        "example": "Meteorologists use advanced technology to predict weather patterns and issue severe storm warnings."
    },
    {
        "english": "portray",
        "chinese": "描绘",
        "example": "The artist's painting portrays a serene landscape with rolling hills and a peaceful river."
    },
    {
        "english": "grand",
        "chinese": "宏大的",
        "example": "The architect designed a grand building that would become a landmark in the city center."
    },
    {
        "english": "series",
        "chinese": "系列",
        "example": "The museum is hosting a series of exhibitions showcasing art from different historical periods."
    },
    {
        "english": "sequence",
        "chinese": "序列",
        "example": "DNA sequencing has revolutionized the field of genetics, allowing scientists to study genetic codes in detail."
    },
    {
        "english": "identical",
        "chinese": "一样的",
        "example": "Identical twins share the same genetic makeup but can develop different personalities and interests."
    },
    {
        "english": "proximity",
        "chinese": "接近",
        "example": "The proximity of the school to the park makes it an ideal location for outdoor classes."
    },
    {
        "english": "ardent",
        "chinese": "热忱的",
        "example": "She is an ardent supporter of animal rights, volunteering at the local shelter every weekend."
    },
    {
        "english": "reptile",
        "chinese": "爬行动物",
        "example": "Reptiles, such as snakes and lizards, are cold-blooded animals that rely on external heat sources."
    },
    {
        "english": "physiology",
        "chinese": "生理",
        "example": "Human physiology studies how the body's systems work together to maintain life and health."
    },
    {
        "english": "adjacent",
        "chinese": "邻近的",
        "example": "The two countries share a border and have established trade routes between adjacent regions."
    },
    {
        "english": "entertain",
        "chinese": "对…抱有希望",
        "example": "The team does not entertain the idea of losing the championship and is training rigorously."
    },
    {
        "english": "intensive",
        "chinese": "密集的",
        "example": "Patients with severe injuries often require intensive care in specialized hospital units."
    },
    {
        "english": "forecast",
        "chinese": "预报",
        "example": "The weather forecast predicts heavy rainfall and strong winds for the coastal areas tomorrow."
    },
    {
        "english": "interval",
        "chinese": "间隔",
        "example": "The doctor recommended taking the medication at four-hour intervals for best results."
    },
    {
        "english": "seismic",
        "chinese": "地震的",
        "example": "Seismic waves generated by earthquakes provide valuable information about Earth's interior."
    },
    {
        "english": "fault",
        "chinese": "断层",
        "example": "Most earthquakes occur along fault lines where tectonic plates meet and interact."
    },
    {
        "english": "segment",
        "chinese": "部分",
        "example": "The marketing team analyzed different customer segments to tailor their advertising strategies."
    },
    {
        "english": "plot",
        "chinese": "绘制（图表，曲线）",
        "example": "Scientists plot data points on a graph to visualize trends and patterns in experimental results."
    },
    {
        "english": "magnitude",
        "chinese": "震级",
        "example": "The earthquake had a magnitude of 7.5, causing significant damage to the surrounding area."
    },
    {
        "english": "diagram",
        "chinese": "图表",
        "example": "The teacher used a diagram to explain the complex process of photosynthesis to the students."
    },
    {
        "english": "recurrence",
        "chinese": "复发",
        "example": "Doctors monitor patients for recurrence of symptoms after completing treatment for the disease."
    },
    {
        "english": "precursor",
        "chinese": "前兆",
        "example": "Some scientists believe that certain animal behaviors can be precursors to upcoming earthquakes."
    },
    {
        "english": "prior to",
        "chinese": "在…之前",
        "example": "Prior to the trip, they researched the local culture and customs to ensure a respectful visit."
    },
    {
        "english": "velocity",
        "chinese": "速率",
        "example": "The velocity of a falling object increases as it gets closer to the Earth's surface due to gravity."
    },
    {
        "english": "resistance",
        "chinese": "阻力",
        "example": "Aerodynamic design helps reduce air resistance, allowing vehicles to move more efficiently."
    },
    {
        "english": "preliminary",
        "chinese": "初步的",
        "example": "The research team released preliminary findings, indicating a potential breakthrough in cancer treatment."
    },
    {
        "english": "deformation",
        "chinese": "变形",
        "example": "The metal structure showed signs of deformation after being exposed to extreme temperatures."
    },
    {
        "english": "dilatancy",
        "chinese": "膨胀",
        "example": "Dilatancy in soil can cause instability, leading to landslides in hilly areas."
    },
    {
        "english": "hypothesis",
        "chinese": "假说",
        "example": "The scientist proposed a hypothesis to explain the mysterious disappearance of marine species in the area."
    },
    {
        "english": "swell",
        "chinese": "膨胀",
        "example": "Wood will swell when exposed to moisture, which can cause doors to stick in humid environments."
    },
    {
        "english": "transmit",
        "chinese": "传递",
        "example": "Nerve cells transmit electrical signals throughout the body, allowing for communication between different systems."
    },
    {
        "english": "rupture",
        "chinese": "破裂",
        "example": "A ruptured pipe caused flooding in the basement, requiring extensive repairs to the property."
    },
    {
        "english": "elevation",
        "chinese": "升高",
        "example": "The elevation in blood pressure can be a warning sign of underlying health issues that need medical attention."
    },
    {
        "english": "indicator",
        "chinese": "迹象",
        "example": "Changes in bird migration patterns can be indicators of climate change affecting their natural habitats."
    },
    {
        "english": "composition",
        "chinese": "组成",
        "example": "The composition of the Earth's atmosphere consists mainly of nitrogen, oxygen, and trace amounts of other gases."
    },
    {
        "english": "radon",
        "chinese": "氡",
        "example": "Homeowners are advised to test for radon, a radioactive gas that can accumulate in basements and pose health risks."
    },
    {
        "english": "vicinity",
        "chinese": "附近",
        "example": "There are several hiking trails in the vicinity of the mountain village, attracting outdoor enthusiasts year-round."
    },
    {
        "english": "imminent",
        "chinese": "即将发生的",
        "example": "The community prepared for the imminent arrival of the hurricane by securing buildings and evacuating low-lying areas."
    },
    {
        "english": "correlated",
        "chinese": "与…有关",
        "example": "Studies have shown that regular exercise is strongly correlated with improved mental health and well-being."
    },
    {
        "english": "influx",
        "chinese": "流入",
        "example": "The city experienced an influx of tourists during the summer months, boosting the local economy significantly."
    },
    {
        "english": "aftermath",
        "chinese": "后果",
        "example": "In the aftermath of the earthquake, rescue teams worked tirelessly to search for survivors and provide aid."
    },
    {
        "english": "substantially",
        "chinese": "非常",
        "example": "The new policy has substantially reduced carbon emissions, exceeding the initial environmental targets."
    },
    {
        "english": "advisory",
        "chinese": "警报",
        "example": "The National Weather Service issued a winter storm advisory for the northern regions of the country."
    },
    {
        "english": "refinement",
        "chinese": "改进",
        "example": "Continuous refinement of the product design has led to increased customer satisfaction and sales."
    }
]