[
  {
    "english": "hunter-gatherer",
    "chinese": "狩猎采集者",
    "example": "Hunter-gatherer societies relied on wild plants and animals for sustenance before the rise of agriculture."
  },
  {
    "english": "alternative",
    "chinese": "可供替代的",
    "example": "Farmers are exploring alternative crops to adapt to changing climate conditions."
  },
  {
    "english": "emerge",
    "chinese": "出现",
    "example": "New agricultural techniques emerged during the Green Revolution to increase crop yields."
  },
  {
    "english": "unpredictable",
    "chinese": "不可预测的",
    "example": "Unpredictable weather patterns pose challenges for traditional farming practices."
  },
  {
    "english": "practice",
    "chinese": "实施",
    "example": "Sustainable farming practices help preserve soil health and biodiversity."
  },
  {
    "english": "succumb to",
    "chinese": "屈从于",
    "example": "Crops may succumb to pests if proper preventive measures aren't taken."
  },
  {
    "english": "elevation",
    "chinese": "海拔",
    "example": "Farmers at high elevations often grow specialized crops adapted to cold climates."
  },
  {
    "english": "phase",
    "chinese": "阶段",
    "example": "The agricultural cycle consists of planting, growing, and harvesting phases."
  },
  {
    "english": "insufficient",
    "chinese": "不充足的",
    "example": "Insufficient rainfall can lead to crop failure in arid regions."
  },
  {
    "english": "entail",
    "chinese": "涉及",
    "example": "Modern farming often entails the use of advanced technology and genetic modification."
  },
  {
    "english": "ditch",
    "chinese": "水沟",
    "example": "Ditches are dug to drain excess water from fields during the rainy season."
  },
  {
    "english": "canal",
    "chinese": "灌溉渠",
    "example": "Ancient canals in Mesopotamia were crucial for irrigating crops in arid areas."
  },
  {
    "english": "runoff",
    "chinese": "径流",
    "example": "Planting trees can reduce surface runoff and prevent soil erosion."
  },
  {
    "english": "carve",
    "chinese": "雕刻",
    "example": "Farmers carve terraces into hillsides to create flat surfaces for planting."
  },
  {
    "english": "irrigation",
    "chinese": "灌溉",
    "example": "Drip irrigation systems conserve water and improve crop efficiency."
  },
  {
    "english": "pump",
    "chinese": "泵",
    "example": "Water pumps are used to draw groundwater for irrigation in dry regions."
  },
  {
    "english": "conservative",
    "chinese": "保守的",
    "example": "Conservative farming methods prioritize long-term soil health over short-term gains."
  },
  {
    "english": "initially",
    "chinese": "一开始地",
    "example": "Initially, farmers used simple tools, but technology later transformed agriculture."
  },
  {
    "english": "adopt",
    "chinese": "采取",
    "example": "Many countries adopt sustainable agriculture policies to address climate change."
  },
  {
    "english": "tempting",
    "chinese": "诱人的",
    "example": "Using excessive pesticides might seem tempting, but it harms the environment."
  },
  {
    "english": "multiply",
    "chinese": "变多",
    "example": "Pest populations can multiply rapidly if not controlled early."
  },
  {
    "english": "marginal",
    "chinese": "边缘的",
    "example": "Marginal lands are often used for grazing due to poor soil fertility."
  },
  {
    "english": "befall",
    "chinese": "发生在某人身上",
    "example": "Droughts can befall agricultural regions, causing severe food shortages."
  },
  {
    "english": "floodplain",
    "chinese": "河漫滩",
    "example": "Floodplains are highly fertile and ideal for growing crops like rice."
  },
  {
    "english": "adjacent",
    "chinese": "附近的",
    "example": "Adjacent fields are often used for different crops to maximize biodiversity."
  },
  {
    "english": "exceed",
    "chinese": "超过",
    "example": "Exceeding the recommended pesticide dosage can harm both crops and consumers."
  },
  {
    "english": "capacity",
    "chinese": "容量",
    "example": "The water storage capacity of dams is crucial for irrigation during dry seasons."
  },
  {
    "english": "gamble",
    "chinese": "赌博",
    "example": "Relying solely on rainfall for irrigation is a gamble in unpredictable climates."
  },
  {
    "english": "collapse",
    "chinese": "崩溃",
    "example": "Soil erosion can lead to the collapse of agricultural systems over time."
  },
  {
    "english": "exhaust",
    "chinese": "枯竭的",
    "example": "Overfarming can exhaust soil nutrients, reducing its fertility."
  },
  {
    "english": "sufficiently",
    "chinese": "充分地",
    "example": "Crops need sufficiently fertile soil and water to grow successfully."
  },
  {
    "english": "shift",
    "chinese": "转换",
    "example": "Farmers often shift crop types based on changing market demands and climate conditions."
  },
  {
    "english": "redistribute",
    "chinese": "重新分配",
    "example": "Irrigation systems redistribute water from rivers to dry agricultural areas."
  },
  {
    "english": "self-sufficient",
    "chinese": "自给自足的",
    "example": "Many rural communities aim to be self-sufficient in food production."
  },
  {
    "english": "descendent",
    "chinese": "后代",
    "example": "Modern crops are often descendants of wild plants domesticated by ancient farmers."
  },
  {
    "english": "pest",
    "chinese": "害虫",
    "example": "Farmers use various methods to control pest populations without harming the environment."
  },
  {
    "english": "species",
    "chinese": "物种",
    "example": "Some plant species have natural resistance to common agricultural pests."
  },
  {
    "english": "ground mole",
    "chinese": "鼹鼠",
    "example": "Ground moles can damage crop roots, posing a challenge for farmers."
  },
  {
    "english": "predator",
    "chinese": "捕食者",
    "example": "Introducing natural predators can be an effective way to control pest populations."
  },
  {
    "english": "parasite",
    "chinese": "寄生生物",
    "example": "Parasitic plants can attach to crops and steal nutrients, reducing yields."
  },
  {
    "english": "nonindigenous",
    "chinese": "非本土的",
    "example": "Nonindigenous pests can cause severe damage to local agricultural systems."
  },
  {
    "english": "eradicate",
    "chinese": "根除",
    "example": "Eradicating invasive pest species requires a combination of methods and long-term planning."
  },
  {
    "english": "measure",
    "chinese": "措施",
    "example": "Governments implement strict measures to prevent the spread of agricultural pests."
  },
  {
    "english": "sulfur",
    "chinese": "硫",
    "example": "Sulfur is often used as a natural pesticide to control fungal diseases in crops."
  },
  {
    "english": "arsenic",
    "chinese": "砷",
    "example": "Arsenic contamination in soil can pose risks to both crops and human health."
  },
  {
    "english": "fungal",
    "chinese": "真菌的",
    "example": "Fungal infections can devastate crops if not properly managed."
  },
  {
    "english": "intend",
    "chinese": "打算",
    "example": "Farmers intend to use organic methods to grow crops without harmful chemicals."
  },
  {
    "english": "target",
    "chinese": "目标",
    "example": "Modern pesticides are designed to target specific pest species while sparing beneficial insects."
  },
  {
    "english": "eliminate",
    "chinese": "消除",
    "example": "Integrated pest management aims to eliminate the need for excessive pesticide use."
  },
  {
    "english": "suppression",
    "chinese": "抑制",
    "example": "Natural predators provide effective suppression of pest populations in organic farming."
  },
  {
    "english": "rebound",
    "chinese": "回弹",
    "example": "Overusing pesticides can lead to pest rebound as populations develop resistance."
  },
  {
    "english": "insidious",
    "chinese": "危险的；潜伏的",
    "example": "Insidious pests like nematodes can damage roots without obvious above-ground symptoms."
  },
  {
    "english": "pesticide",
    "chinese": "杀虫剂",
    "example": "The excessive use of pesticides has raised concerns about environmental and human health."
  },
  {
    "english": "resistance",
    "chinese": "抵抗力",
    "example": "Many pest species have developed resistance to commonly used pesticides."
  },
  {
    "english": "acquire",
    "chinese": "获得",
    "example": "Pests can acquire resistance to pesticides through genetic mutations."
  },
  {
    "english": "overcome",
    "chinese": "克服",
    "example": "Farmers must overcome pest resistance by using diverse and sustainable methods."
  },
  {
    "english": "evolve",
    "chinese": "进化",
    "example": "Pest species evolve rapidly in response to environmental pressures like pesticides."
  },
  {
    "english": "outbreak",
    "chinese": "爆发",
    "example": "Warm temperatures can lead to sudden outbreaks of insect pests in crops."
  },
  {
    "english": "citrus",
    "chinese": "柑橘类果实",
    "example": "Citrus crops are often affected by fungal diseases and insect pests."
  },
  {
    "english": "orchard",
    "chinese": "果园",
    "example": "Orchards require careful pest management to protect fruit trees from damage."
  },
  {
    "english": "caterpillar",
    "chinese": "毛毛虫",
    "example": "Caterpillars can defoliate crops quickly if their populations are not controlled."
  },
  {
    "english": "array of",
    "chinese": "大批",
    "example": "An array of pests and diseases can affect crops throughout their growing season."
  },
  {
    "english": "habitat",
    "chinese": "栖息地",
    "example": "Creating diverse habitats on farms can attract beneficial insects that prey on pests."
  },
  {
    "english": "cactus",
    "chinese": "仙人掌",
    "example": "Cactus plants are adapted to arid habitats and are less prone to certain pests."
  },
  {
    "english": "moth",
    "chinese": "蛾子",
    "example": "Moth larvae can cause significant damage to stored grains and crops."
  },
  {
    "english": "prickly pear",
    "chinese": "仙人果",
    "example": "Prickly pear cacti are sometimes used in agroforestry systems to diversify farms."
  },
  {
    "english": "backfire",
    "chinese": "适得其反",
    "example": "Using too much pesticide can backfire by killing beneficial insects as well."
  },
  {
    "english": "possess",
    "chinese": "拥有",
    "example": "Some plants possess natural compounds that repel pests without harmful chemicals."
  },
  {
    "english": "inherent",
    "chinese": "固有的",
    "example": "Crop varieties with inherent pest resistance are preferred in sustainable agriculture."
  },
  {
    "english": "assess",
    "chinese": "评估",
    "example": "Farmers assess pest damage to determine the best course of action for control."
  },
  {
    "english": "alien",
    "chinese": "外来的",
    "example": "Alien invasive species can disrupt local ecosystems and damage agricultural crops."
  },
  {
    "english": "invader",
    "chinese": "入侵者",
    "example": "Invasive plant species can act as hosts for new pest invaders in agricultural areas."
  },
  {
    "english": "entomologist",
    "chinese": "昆虫学家",
    "example": "Entomologists study insect behavior to develop effective pest management strategies."
  },
  {
    "english": "holistic",
    "chinese": "整体的",
    "example": "Holistic pest management considers the entire ecosystem when controlling pests."
  },
  {
    "english": "integrate",
    "chinese": "整合",
    "example": "Farmers integrate multiple pest control methods for more effective management."
  },
  {
    "english": "aesthetic",
    "chinese": "美学的",
    "example": "Aesthetic considerations in farming can include planting flowers to attract beneficial insects."
  },
  {
    "english": "mortality",
    "chinese": "死亡率",
    "example": "High pest mortality can be achieved through natural predators rather than chemicals."
  },
  {
    "english": "intensity",
    "chinese": "强度",
    "example": "The intensity of pest outbreaks can vary depending on climate and environmental factors."
  },
  {
    "english": "tolerate",
    "chinese": "忍受",
    "example": "Some crop varieties are bred to tolerate certain pests and diseases."
  },
  {
    "english": "derive",
    "chinese": "获得",
    "example": "Farmers derive pest control solutions from traditional knowledge and modern science."
  }
]