[
  {
    "english": "vine",
    "chinese": "藤蔓",
    "example": "The vine climbed up the trellis, producing clusters of juicy grapes in the summer."
  },
  {
    "english": "root",
    "chinese": "根",
    "example": "Trees develop deep roots to absorb water and nutrients from the soil."
  },
  {
    "english": "maize",
    "chinese": "玉米",
    "example": "Maize is a staple crop in many countries, providing food for both humans and animals."
  },
  {
    "english": "shadow",
    "chinese": "阴影",
    "example": "Plants growing in the shadow of tall trees may not receive enough sunlight."
  },
  {
    "english": "conserve",
    "chinese": "保存",
    "example": "Cacti have adapted to conserve water in arid desert environments."
  },
  {
    "english": "moisture",
    "chinese": "水分",
    "example": "Mulch helps retain soil moisture, reducing the need for frequent watering."
  },
  {
    "english": "sideways",
    "chinese": "向侧面地",
    "example": "Strong winds caused the rain to fall sideways, soaking everyone at the picnic."
  },
  {
    "english": "shed",
    "chinese": "脱落",
    "example": "Maple trees shed their leaves in the fall, creating a carpet of color on the ground."
  },
  {
    "english": "maple",
    "chinese": "枫树",
    "example": "Maple syrup is made from the sap of maple trees, collected in early spring."
  },
  {
    "english": "avocado",
    "chinese": "牛油果",
    "example": "Avocado trees require well-drained soil and plenty of sunlight to thrive."
  },
  {
    "english": "nutrient",
    "chinese": "营养物质",
    "example": "Compost adds essential nutrients to the soil, promoting healthy plant growth."
  },
  {
    "english": "remain",
    "chinese": "保留",
    "example": "Dead leaves remain on the forest floor, decomposing to form rich humus."
  },
  {
    "english": "nourish",
    "chinese": "滋养",
    "example": "The river nourishes the surrounding farmland, allowing crops to grow abundantly."
  },
  {
    "english": "aerial",
    "chinese": "空中的",
    "example": "Aerial roots of some plants can absorb moisture directly from the air."
  },
  {
    "english": "absorb",
    "chinese": "吸收",
    "example": "Sponges absorb water, helping to keep the soil moist around plant roots."
  },
  {
    "english": "swamp",
    "chinese": "沼泽",
    "example": "Cypress trees are well-adapted to growing in swamp environments with standing water."
  },
  {
    "english": "survival",
    "chinese": "生存",
    "example": "The survival of plants in harsh climates depends on their ability to conserve resources."
  },
  {
    "english": "function",
    "chinese": "功能",
    "example": "The primary function of roots is to anchor the plant and absorb water and nutrients."
  },
  {
    "english": "mature",
    "chinese": "成熟的",
    "example": "Mature maize plants can reach heights of up to 10 feet under ideal growing conditions."
  },
  {
    "english": "phenomenon",
    "chinese": "现象",
    "example": "The changing colors of autumn leaves are a natural phenomenon caused by seasonal changes."
  },
  {
    "english": "stem",
    "chinese": "茎",
    "example": "The stem of a plant transports water and nutrients from the roots to the leaves."
  },
  {
    "english": "adequately",
    "chinese": "充分地",
    "example": "Plants need to be watered adequately, especially during hot summer months."
  },
  {
    "english": "fibrous",
    "chinese": "纤维状的",
    "example": "Grasses have fibrous root systems that help prevent soil erosion."
  },
  {
    "english": "shallow",
    "chinese": "浅的",
    "example": "Shallow roots are common in plants growing in sandy soils where water is scarce."
  },
  {
    "english": "segment",
    "chinese": "部分",
    "example": "Each segment of the root has a specific role in absorbing water and nutrients."
  },
  {
    "english": "marsh",
    "chinese": "沼泽地",
    "example": "Marsh plants often have specialized roots that allow them to grow in waterlogged soil."
  },
  {
    "english": "attach",
    "chinese": "附着",
    "example": "Vines attach themselves to structures using tendrils or aerial roots."
  },
  {
    "english": "expose",
    "chinese": "暴露",
    "example": "Exposing roots can damage plants, so it's important to keep them covered with soil."
  },
  {
    "english": "retain",
    "chinese": "保持",
    "example": "Clay soil can retain moisture better than sandy soil, but it may drain more slowly."
  },
  {
    "english": "edge",
    "chinese": "边缘",
    "example": "Plants growing on the edge of a forest may experience more sunlight than those in the center."
  },
  {
    "english": "dry out",
    "chinese": "干燥",
    "example": "Potted plants can dry out quickly in hot weather, so they need frequent watering."
  },
  {
    "english": "prevent damage",
    "chinese": "防止损害",
    "example": "Mulching around plants helps prevent damage from weeds and extreme temperatures."
  },
  {
    "english": "conserve moisture",
    "chinese": "保存水分",
    "example": "Using a layer of gravel on top of soil can help conserve moisture in arid regions."
  },
  {
    "english": "conserve nutrients",
    "chinese": "保存养分",
    "example": "Crop rotation is a method used to conserve nutrients in the soil for future plantings."
  },
  {
    "english": "get blown away",
    "chinese": "被吹走",
    "example": "Lightweight seeds can easily get blown away by the wind, helping plants spread to new areas."
  },
  {
    "english": "at the approach of …",
    "chinese": "在……接近时",
    "example": "At the approach of winter, many plants enter a dormant state to conserve energy."
  },
  {
    "english": "build up",
    "chinese": "积累",
    "example": "Over time, organic matter builds up in the soil, improving its fertility."
  },
  {
    "english": "develop into maturity",
    "chinese": "发育成熟",
    "example": "Maize takes about 3 months to develop into maturity from the time of planting."
  },
  {
    "english": "compensate for",
    "chinese": "弥补",
    "example": "Plants may develop deeper roots to compensate for a lack of surface water."
  },
  {
    "english": "cling to",
    "chinese": "紧紧附着",
    "example": "Moss can cling to rocks and trees, thriving in environments where other plants can't grow."
  }
]