[
  {
    "english": "goods",
    "chinese": "商品",
    "example": "The merchant traded various goods along the ancient Silk Road."
  },
  {
    "english": "melon",
    "chinese": "甜瓜",
    "example": "Watermelon and cantaloupe are popular types of melon in summer."
  },
  {
    "english": "camel",
    "chinese": "骆驼",
    "example": "Camels were essential for transporting goods across the desert in ancient times."
  },
  {
    "english": "date",
    "chinese": "枣；日期",
    "example": "Dates are a common fruit in the Middle East and were traded along the Silk Road. / Please check the date on the product label."
  },
  {
    "english": "trade",
    "chinese": "贸易；交易",
    "example": "The two countries have a long history of trade. / They trade spices for silk with local merchants."
  },
  {
    "english": "musical instrument",
    "chinese": "乐器",
    "example": "The lute was a popular musical instrument in ancient Chinese dynasties."
  },
  {
    "english": "route",
    "chinese": "路线",
    "example": "The Silk Road was an important trade route connecting Asia and Europe."
  },
  {
    "english": "jade",
    "chinese": "玉",
    "example": "Jade ornaments were highly valued in ancient Chinese and Native American cultures."
  },
  {
    "english": "export",
    "chinese": "出口",
    "example": "China used to export silk, tea, and porcelain to the West."
  },
  {
    "english": "settler",
    "chinese": "定居者",
    "example": "European settlers arrived in America and established colonies."
  },
  {
    "english": "merchant",
    "chinese": "商人",
    "example": "The merchant traveled long distances to sell his goods."
  },
  {
    "english": "Native American",
    "chinese": "美洲原住民",
    "example": "Native Americans had rich cultural traditions long before European settlers arrived."
  },
  {
    "english": "dynasty",
    "chinese": "王朝",
    "example": "The Tang Dynasty was a golden age of trade and culture in China."
  },
  {
    "english": "tribe",
    "chinese": "部落",
    "example": "Nomadic tribes along the trade route often interacted with merchants."
  },
  {
    "english": "silk",
    "chinese": "丝绸",
    "example": "Silk was one of the most famous goods traded on the Silk Road."
  },
  {
    "english": "religious persecution",
    "chinese": "宗教迫害",
    "example": "Some settlers moved to new lands to escape religious persecution."
  },
  {
    "english": "gunpowder",
    "chinese": "火药",
    "example": "Gunpowder, invented in ancient China, was later exported to other parts of the world."
  },
  {
    "english": "feast",
    "chinese": "盛宴",
    "example": "Merchants and settlers would gather for a feast after completing a successful trade."
  },
  {
    "english": "spice",
    "chinese": "香料",
    "example": "Spices like pepper and cinnamon were highly valued and traded across continents."
  },
  {
    "english": "colony",
    "chinese": "殖民地",
    "example": "European countries established colonies to expand their trade networks."
  },
  {
    "english": "raisin",
    "chinese": "葡萄干",
    "example": "Raisins were a popular dried fruit traded along with other food goods."
  },
  {
    "english": "independence",
    "chinese": "独立",
    "example": "Many colonies fought for independence from their ruling countries."
  },
  {
    "english": "carpet",
    "chinese": "地毯",
    "example": "Elaborate carpets were often traded as luxury goods."
  },
  {
    "english": "declare",
    "chinese": "宣布",
    "example": "The country declared its independence after a long war."
  },
  {
    "english": "safe",
    "chinese": "保险箱",
    "example": "The merchant kept valuable goods and documents in a safe."
  },
  {
    "english": "arrest",
    "chinese": "逮捕",
    "example": "The police arrested the thief who stole goods from the market."
  },
  {
    "english": "crew",
    "chinese": "船员",
    "example": "The crew of the trading ship protected the goods during the voyage."
  },
  {
    "english": "move on",
    "chinese": "继续前进",
    "example": "After trading in one city, the merchant would move on to the next along the route."
  },
  {
    "english": "lifeboat",
    "chinese": "救生艇",
    "example": "The crew used a lifeboat to escape when the ship encountered a storm."
  },
  {
    "english": "make peace with",
    "chinese": "与……讲和",
    "example": "The tribe decided to make peace with the settlers to ensure safe trade."
  },
  {
    "english": "necklace",
    "chinese": "项链",
    "example": "She wore a jade necklace that was traded from a distant land."
  },
  {
    "english": "originally",
    "chinese": "最初",
    "example": "The trade route was originally used for silk, but later included many other goods."
  },
  {
    "english": "diamond",
    "chinese": "钻石",
    "example": "Diamonds were rare and valuable goods traded by wealthy merchants."
  },
  {
    "english": "smoothly",
    "chinese": "顺利地",
    "example": "The trade negotiations went smoothly, and both sides reached an agreement."
  },
  {
    "english": "uneventful",
    "chinese": "平静的",
    "example": "The uneventful journey meant the goods arrived safely at their destination."
  },
  {
    "english": "fictional",
    "chinese": "虚构的",
    "example": "The story of the merchant is fictional but based on real historical trade routes."
  }
]