[
  {
    "english": "seagoing",
    "chinese": "远洋的",
    "example": "Seagoing vessels have been used for trade across oceans for thousands of years."
  },
  {
    "english": "exhibit",
    "chinese": "展示，展览",
    "example": "The aquarium will exhibit rare deep-sea creatures in its new underwater tunnel."
  },
  {
    "english": "mature",
    "chinese": "成熟的",
    "example": "Mature salmon return to their birthplace to breed in freshwater streams."
  },
  {
    "english": "salmon",
    "chinese": "三文鱼",
    "example": "Salmon migrate thousands of miles from the ocean to spawn in rivers."
  },
  {
    "english": "breed",
    "chinese": "繁殖",
    "example": "Many sea creatures breed in shallow waters to protect their offspring."
  },
  {
    "english": "hatch",
    "chinese": "孵化",
    "example": "Turtle eggs hatch on the beach, and the young make their way to the sea."
  },
  {
    "english": "dart",
    "chinese": "飞奔，急驰",
    "example": "Fish dart through the coral reef to avoid predators in the ocean."
  },
  {
    "english": "spawn",
    "chinese": "产卵",
    "example": "Frogs spawn in ponds, and their tadpoles develop in the freshwater."
  },
  {
    "english": "obtain",
    "chinese": "获得",
    "example": "Seabirds obtain food by diving into the ocean to catch fish."
  },
  {
    "english": "baboon",
    "chinese": "狒狒",
    "example": "Baboons live in social groups and forage for food during the day."
  },
  {
    "english": "predator",
    "chinese": "捕食者",
    "example": "Sharks are apex predators that play a crucial role in marine ecosystems."
  },
  {
    "english": "alert",
    "chinese": "警告",
    "example": "Birds emit loud calls to alert their flock about approaching predators."
  },
  {
    "english": "spread",
    "chinese": "散布，传播",
    "example": "Bees spread pollen from flower to flower, aiding in plant reproduction."
  },
  {
    "english": "forage",
    "chinese": "觅食",
    "example": "Baboons forage for fruits, leaves, and insects in their natural habitat."
  },
  {
    "english": "feed",
    "chinese": "喂养",
    "example": "Mother whales feed their calves with nutrient-rich milk for several months."
  },
  {
    "english": "groom",
    "chinese": "打理（毛发）",
    "example": "Monkeys groom each other to maintain social bonds and remove parasites."
  },
  {
    "english": "migrate",
    "chinese": "迁徙",
    "example": "Many bird species migrate south for the winter to find food."
  },
  {
    "english": "freshwater",
    "chinese": "淡水",
    "example": "Salmon start their lives in freshwater rivers before moving to the ocean."
  },
  {
    "english": "survival",
    "chinese": "生存",
    "example": "Camouflage is a key survival strategy for many species in the wild."
  },
  {
    "english": "temporarily",
    "chinese": "暂时地",
    "example": "Seals rest on beaches temporarily before returning to the ocean to feed."
  },
  {
    "english": "capacity",
    "chinese": "容量",
    "example": "The whale's stomach has a large capacity to hold tons of small fish and krill."
  },
  {
    "english": "allocation",
    "chinese": "分配",
    "example": "Animals have to make careful allocation of energy for foraging and reproduction."
  },
  {
    "english": "reproduce",
    "chinese": "繁殖",
    "example": "Most sea creatures reproduce by laying eggs in the water."
  },
  {
    "english": "fulfill",
    "chinese": "满足",
    "example": "Animals migrate to fulfill their survival needs, such as finding food and suitable habitats."
  },
  {
    "english": "disrupt",
    "chinese": "扰乱",
    "example": "Pollution can disrupt the natural breeding cycles of marine species."
  },
  {
    "english": "distinct",
    "chinese": "独特的，明显不同的",
    "example": "Each species has distinct coloring to adapt to its environment."
  },
  {
    "english": "coloring",
    "chinese": "颜色，外观",
    "example": "The frog's bright coloring warns predators of its toxicity."
  },
  {
    "english": "employ",
    "chinese": "使用",
    "example": "Octopuses employ camouflage to blend in with their surroundings."
  },
  {
    "english": "prey",
    "chinese": "猎物",
    "example": "Eagles spot their prey from high in the sky before diving to catch it."
  },
  {
    "english": "pollen",
    "chinese": "花粉",
    "example": "Bees collect pollen to feed their young and help plants reproduce."
  },
  {
    "english": "nectar",
    "chinese": "花蜜",
    "example": "Butterflies feed on nectar from flowers using their long tongues."
  },
  {
    "english": "species",
    "chinese": "物种",
    "example": "Many species of fish are threatened by overfishing and ocean pollution."
  },
  {
    "english": "vulnerable",
    "chinese": "脆弱的，易受伤害的",
    "example": "Baby sea turtles are vulnerable to predators when they hatch and head to the ocean."
  },
  {
    "english": "salt water",
    "chinese": "盐水",
    "example": "Sharks are adapted to live in salt water but can't survive in freshwater."
  },
  {
    "english": "a certain age",
    "chinese": "某个年龄",
    "example": "Salmon return to freshwater to spawn when they reach a certain age."
  },
  {
    "english": "survival needs",
    "chinese": "生存需求",
    "example": "Animals' behaviors are often driven by their survival needs, like finding food and shelter."
  },
  {
    "english": "in response to",
    "chinese": "响应",
    "example": "Birds migrate south in response to the changing seasons and food availability."
  },
  {
    "english": "engage in",
    "chinese": "从事",
    "example": "Monkeys engage in grooming to maintain social relationships within their group."
  },
  {
    "english": "attempts to",
    "chinese": "尝试",
    "example": "The seal attempts to catch fish by darting through the water quickly."
  },
  {
    "english": "physical features",
    "chinese": "身体特征",
    "example": "The chameleon's physical features allow it to change color and blend into its environment."
  },
  {
    "english": "defense mechanism",
    "chinese": "防御机制",
    "example": "A turtle's shell is its primary defense mechanism against predators."
  },
  {
    "english": "transfer pollen",
    "chinese": "传播花粉",
    "example": "Bees transfer pollen between flowers as they collect nectar, aiding in plant growth."
  },
  {
    "english": "a limited number of",
    "chinese": "有限的数量",
    "example": "Only a limited number of species can survive in the extreme conditions of the deep sea."
  },
  {
    "english": "spread far apart",
    "chinese": "散布得很远",
    "example": "The islands in the archipelago are spread far apart, each with unique species."
  },
  {
    "english": "spread out",
    "chinese": "扩散开",
    "english": "spread out",
    "chinese": "扩散开",
    "example": "When threatened, the school of fish spreads out to confuse predators."
  },
  {
    "english": "search for food",
    "chinese": "觅食",
    "example": "Bears come out of hibernation to search for food in the spring."
  },
  {
    "english": "grow to full size",
    "chinese": "长到完全大小",
    "example": "Salmon take several years to grow to full size in the ocean before spawning."
  },
  {
    "english": "dart back down into safety",
    "chinese": "迅速回到安全处",
    "example": "When a predator approaches, the fish darts back down into safety among the coral."
  },
  {
    "english": "sea creatures",
    "chinese": "海洋生物",
    "example": "Many sea creatures have adapted to survive in the deep, dark parts of the ocean."
  }
]