[
  {
    "english": "instinctual",
    "chinese": "本能的",
    "example": "Newborn babies have instinctual reflexes, like sucking and grasping."
  },
  {
    "english": "cumulative",
    "chinese": "累积的",
    "example": "Cumulative exposure to sunlight without sunscreen can cause long-term skin damage."
  },
  {
    "english": "modify",
    "chinese": "修改",
    "example": "Scientists can modify animal behavior through repeated training and conditioning."
  },
  {
    "english": "ritual",
    "chinese": "仪式",
    "example": "Many animals perform mating rituals to attract a partner during the breeding season."
  },
  {
    "english": "innovation",
    "chinese": "创新",
    "example": "The innovation of tool use was a major step in human evolutionary history."
  },
  {
    "english": "exposure",
    "chinese": "暴露，显露",
    "example": "Long-term exposure to cold temperatures can trigger dormancy in some animals."
  },
  {
    "english": "reference",
    "chinese": "参考，参照",
    "example": "Animals often use the position of the sun as a reference for navigation."
  },
  {
    "english": "dormancy",
    "chinese": "休眠",
    "example": "Many plants enter a state of dormancy during the winter months."
  },
  {
    "english": "dormant",
    "chinese": "休眠的",
    "example": "A dormant volcano shows no signs of activity but could erupt in the future."
  },
  {
    "english": "inactivity",
    "chinese": "静止",
    "example": "Inactivity during hibernation helps animals conserve energy when food is scarce."
  },
  {
    "english": "nourishment",
    "chinese": "滋养",
    "example": "Mothers provide nourishment to their young through milk or regurgitated food."
  },
  {
    "english": "elaborate",
    "chinese": "精细的，复杂的",
    "example": "Birds build elaborate nests using twigs, grass, and other natural materials."
  },
  {
    "english": "subsequent",
    "chinese": "随后的",
    "example": "Subsequent generations of animals may adapt to new environmental challenges."
  },
  {
    "english": "scarce",
    "chinese": "稀少的",
    "example": "When food is scarce, animals may travel long distances in search of nourishment."
  },
  {
    "english": "a shared behavior",
    "chinese": "一个共同的行为",
    "example": "Migration is a shared behavior among many species of birds and mammals."
  },
  {
    "english": "pass on",
    "chinese": "传递",
    "example": "Parents pass on their instincts and behaviors to their offspring."
  },
  {
    "english": "a challenging part",
    "chinese": "一个有难度的部分",
    "example": "Avoiding predators is a challenging part of survival for many small animals."
  },
  {
    "english": "environmental factor",
    "chinese": "环境因素",
    "example": "Temperature is an important environmental factor affecting animal behavior."
  },
  {
    "english": "add to",
    "chinese": "增加",
    "example": "New innovations in behavior can add to a species' chances of survival."
  },
  {
    "english": "future generation",
    "chinese": "下一代",
    "example": "Cumulative adaptations help future generations thrive in changing environments."
  },
  {
    "english": "brush off",
    "chinese": "洗刷掉",
    "example": "Animals often brush off dirt and parasites to maintain their health."
  },
  {
    "english": "introduce an innovation",
    "chinese": "引入一项创新",
    "example": "Scientists can introduce an innovation to study how animals adapt to new situations."
  },
  {
    "english": "develop ability",
    "chinese": "发展能力",
    "example": "Practice and experience help animals develop ability to solve problems."
  },
  {
    "english": "stop trying",
    "chinese": "停止尝试",
    "example": "Animals may stop trying to access a food source if it's too difficult to reach."
  },
  {
    "english": "give up on",
    "chinese": "在...上放弃",
    "example": "Don't give up on understanding animal behavior—it's full of fascinating insights."
  },
  {
    "english": "take measures to do",
    "chinese": "采取措施去做...",
    "example": "Conservationists take measures to protect animals from harmful environmental factors."
  }
]