[
  {
    "english": "introductory",
    "chinese": "入门的，基础（课程）的",
    "example": "I'm taking an introductory course in coding to build basic programming skills."
  },
  {
    "english": "determine",
    "chinese": "决定",
    "example": "Your prior knowledge will help determine which introductory course is right for you."
  },
  {
    "english": "overwhelming",
    "chinese": "难以承受的",
    "example": "The amount of homework in college can feel overwhelming at first."
  },
  {
    "english": "analysis (pl. analyses)",
    "chinese": "分析",
    "example": "The professor required a detailed analysis of the novel in our introductory literature class."
  },
  {
    "english": "consume",
    "chinese": "消费，消耗",
    "example": "Studying for exams can consume all your free time during finals week."
  },
  {
    "english": "accommodation",
    "chinese": "住宿",
    "example": "The university provides accommodation for students taking introductory summer courses."
  },
  {
    "english": "interact",
    "chinese": "互动",
    "example": "Online platforms allow students to interact with peers in introductory virtual courses."
  },
  {
    "english": "overhead",
    "chinese": "经费",
    "example": "The overhead for maintaining labs makes introductory science courses expensive."
  },
  {
    "english": "initiative",
    "chinese": "倡议，动议",
    "example": "The university launched an initiative to improve introductory course materials."
  },
  {
    "english": "installation",
    "chinese": "安装，安置",
    "example": "The installation of new software delayed the start of our introductory tech class."
  },
  {
    "english": "dramatically",
    "chinese": "戏剧性地，引人注目地",
    "example": "Her grades improved dramatically after tutoring in the introductory math course."
  },
  {
    "english": "guidance",
    "chinese": "指导，引导",
    "example": "TA们 provide guidance to students struggling in introductory physics."
  },
  {
    "english": "inevitable",
    "chinese": "无法避免的",
    "example": "Making mistakes is inevitable when learning a new skill in an introductory course."
  },
  {
    "english": "time consuming",
    "chinese": "费时的",
    "example": "Completing the analysis for my introductory statistics class was very time consuming."
  },
  {
    "english": "ahead of schedule",
    "chinese": "比计划提前",
    "example": "We finished the introductory project ahead of schedule thanks to good teamwork."
  },
  {
    "english": "absolute quiet",
    "chinese": "绝对安静",
    "example": "I need absolute quiet to focus on my introductory programming assignments."
  },
  {
    "english": "get in the zone",
    "chinese": "进入状态",
    "example": "Listening to classical music helps me get in the zone for studying introductory calculus."
  },
  {
    "english": "go in a different direction",
    "chinese": "改变方向",
    "example": "The professor decided to go in a different direction with the introductory lecture."
  },
  {
    "english": "halfway through",
    "chinese": "中途，半途",
    "example": "I realized I needed a tutor halfway through the introductory chemistry course."
  },
  {
    "english": "provide for ...",
    "chinese": "提供",
    "example": "The scholarship provides for accommodation and books for introductory course students."
  },
  {
    "english": "up there",
    "chinese": "在那里",
    "example": "The best study spots on campus are up there on the third floor of the library."
  },
  {
    "english": "spend a fortune on …",
    "chinese": "在…上花钱",
    "example": "Don't spend a fortune on textbooks for introductory courses—buy used ones instead."
  },
  {
    "english": "make sense",
    "chinese": "有道理，讲得通",
    "example": "Taking an introductory course before the advanced one just makes sense."
  },
  {
    "english": "introductory course",
    "chinese": "基础课，入门课",
    "example": "Introductory courses are designed to give students a foundation in the subject."
  },
  {
    "english": "electricity bill",
    "chinese": "电费账单",
    "example": "Leaving computers on in labs increases the department's electricity bill significantly."
  }
]