[
  {
    "english": "assignment",
    "chinese": "作业，任务",
    "example": "The professor gave a challenging assignment that requires extensive research."
  },
  {
    "english": "academically",
    "chinese": "学术上",
    "example": "She performs well academically and is a top student in her class."
  },
  {
    "english": "perform",
    "chinese": "表现，执行",
    "example": "Students are expected to perform well on both written and practical exams."
  },
  {
    "english": "invest",
    "chinese": "投资",
    "example": "The university plans to invest in new science equipment for research labs."
  },
  {
    "english": "equipment",
    "chinese": "设备，器材",
    "example": "The school provides advanced equipment for students in the engineering program."
  },
  {
    "english": "staff",
    "chinese": "员工，职员",
    "example": "The teaching staff includes experienced professors and supportive advisors."
  },
  {
    "english": "maintain",
    "chinese": "维护，保养",
    "example": "It's important to maintain lab equipment regularly for accurate results."
  },
  {
    "english": "facility",
    "chinese": "设施，设备",
    "example": "The sports facility on campus has a gym, swimming pool, and tennis courts."
  },
  {
    "english": "fund",
    "chinese": "资金，基金",
    "example": "The government provides funds for universities to expand research programs."
  },
  {
    "english": "expand",
    "chinese": "扩展，扩大",
    "example": "The university is expanding its library to accommodate more students."
  },
  {
    "english": "resentful",
    "chinese": "感到怨恨的",
    "example": "Some students feel resentful about the new mandatory attendance policy."
  },
  {
    "english": "genuinely",
    "chinese": "真诚地，真正地",
    "example": "The teacher genuinely cares about her students' academic and personal growth."
  },
  {
    "english": "inspire",
    "chinese": "激励，启发",
    "example": "Good teachers can inspire students to pursue their academic passions."
  },
  {
    "english": "mandatory",
    "chinese": "强制的，必须的",
    "example": "Attending the orientation session is mandatory for all incoming freshmen."
  },
  {
    "english": "eliminate",
    "chinese": "消除，淘汰",
    "example": "The new policy aims to eliminate irrelevant assignments and reduce student stress."
  },
  {
    "english": "irrelevant",
    "chinese": "无关的，不相关的",
    "example": "Try to avoid including irrelevant information in your academic papers."
  },
  {
    "english": "distract",
    "chinese": "分散注意力",
    "example": "Noisy surroundings can distract students from their assignments and studying."
  },
  {
    "english": "unpleasant",
    "chinese": "令人不愉快的",
    "example": "An unpleasant incident in class made the professor rethink the assignment structure."
  },
  {
    "english": "additional",
    "chinese": "额外的，附加的",
    "example": "Students may need additional equipment for the advanced science lab assignments."
  }
]