[
  {
    "english": "generate",
    "chinese": "产生",
    "example": "Social media campaigns can generate significant interest in new products."
  },
  {
    "english": "demand",
    "chinese": "需求",
    "example": "The new eco-friendly product met the growing demand for sustainable consumer goods."
  },
  {
    "english": "crucial",
    "chinese": "关键的",
    "example": "Understanding consumer behavior is crucial for developing effective marketing strategies."
  },
  {
    "english": "strategy",
    "chinese": "策略",
    "example": "The company's marketing strategy focuses on social media to reach younger audiences."
  },
  {
    "english": "primary",
    "chinese": "主要的",
    "example": "The primary goal of the campaign is to increase brand awareness among urban consumers."
  },
  {
    "english": "stimulation",
    "chinese": "刺激",
    "example": "Limited-time offers provide the necessary stimulation to drive immediate purchases."
  },
  {
    "english": "category",
    "chinese": "类别",
    "example": "The product falls under the category of sustainable household goods."
  },
  {
    "english": "emphasize",
    "chinese": "强调",
    "example": "The advertisement emphasizes the product's durability and eco-friendly features."
  },
  {
    "english": "speciality",
    "chinese": "专长",
    "example": "The agency's speciality is creating viral marketing campaigns for tech startups."
  },
  {
    "english": "promote",
    "chinese": "促销",
    "example": "They plan to promote the new beverage through a series of influencer partnerships."
  },
  {
    "english": "exceptional",
    "chinese": "杰出的",
    "example": "Exceptional customer service can significantly enhance a brand's reputation."
  },
  {
    "english": "appeal",
    "chinese": "吸引力",
    "example": "The campaign's appeal to nostalgia resonated with consumers in their 40s and 50s."
  },
  {
    "english": "nostalgia",
    "chinese": "怀旧",
    "example": "Nostalgia for 90s trends inspired the brand's latest product design."
  },
  {
    "english": "sentimental",
    "chinese": "情感的",
    "example": "Sentimental marketing stories can create a deeper emotional connection with customers."
  },
  {
    "english": "beverage",
    "chinese": "饮料",
    "example": "The new beverage combines traditional flavors with modern health trends."
  },
  {
    "english": "broad",
    "chinese": "广泛的",
    "example": "A broad marketing approach ensures the campaign reaches diverse consumer groups."
  },
  {
    "english": "sway",
    "chinese": "影响",
    "example": "Positive reviews can sway potential customers to try a new product."
  },
  {
    "english": "incentive",
    "chinese": "激励",
    "example": "Offering a discount is a common incentive to encourage first-time purchases."
  },
  {
    "english": "backfire",
    "chinese": "适得其反",
    "example": "The humor in the ad backfired, offending some viewers instead of entertaining them."
  },
  {
    "english": "persuade",
    "chinese": "说服",
    "example": "Testimonials from experts can help persuade consumers of a product's effectiveness."
  },
  {
    "english": "testimonial",
    "chinese": "证明",
    "example": "Including customer testimonials in ads increases trust in the brand."
  },
  {
    "english": "merit",
    "chinese": "优点",
    "example": "The campaign highlights the product's merits compared to competitors."
  },
  {
    "english": "approach",
    "chinese": "方法",
    "example": "A data-driven approach to marketing ensures strategies are based on consumer insights."
  },
  {
    "english": "release",
    "chinese": "发布",
    "example": "The brand will release a limited edition product to generate buzz."
  },
  {
    "english": "image",
    "chinese": "形象",
    "example": "Rebranding can help a company refresh its image and attract new customers."
  },
  {
    "english": "uniqueness",
    "chinese": "独特性",
    "example": "Emphasizing the product's uniqueness is key to standing out in a crowded market."
  },
  {
    "english": "longing",
    "chinese": "渴望",
    "example": "The ad taps into consumers' longing for simplicity in a fast-paced world."
  },
  {
    "english": "conflict with …",
    "chinese": "与……冲突",
    "example": "The new strategy shouldn't conflict with the brand's established values."
  },
  {
    "english": "brand-new",
    "chinese": "全新的",
    "example": "A brand-new marketing campaign was launched to promote the company's sustainability efforts."
  },
  {
    "english": "make fun of …",
    "chinese": "取笑……",
    "example": "Humorous ads should avoid making fun of any demographic to prevent backlash."
  },
  {
    "english": "marketing strategy",
    "chinese": "营销策略",
    "example": "The marketing strategy combines social media ads with in-store promotions."
  },
  {
    "english": "generate demand",
    "chinese": "产生需求",
    "example": "Limited-time offers are an effective way to generate demand for new products."
  },
  {
    "english": "at high speeds",
    "chinese": "以高速",
    "example": "Social media allows information to spread at high speeds, ideal for viral campaigns."
  },
  {
    "english": "browse the Internet",
    "chinese": "浏览互联网",
    "example": "Consumers often browse the Internet to research products before purchasing."
  },
  {
    "english": "appeal to …",
    "chinese": "吸引……",
    "example": "The campaign aims to appeal to environmentally conscious millennials."
  },
  {
    "english": "reflect on the past",
    "chinese": "回顾过去",
    "example": "Nostalgic ads make consumers reflect on the past, creating emotional connections."
  },
  {
    "english": "extra incentive",
    "chinese": "额外激励",
    "example": "Free shipping is an extra incentive that encourages larger online orders."
  },
  {
    "english": "past customer",
    "chinese": "过去的客户",
    "example": "Email campaigns targeting past customers can boost repeat purchases."
  },
  {
    "english": "old-fashioned",
    "chinese": "老式的",
    "example": "Old-fashioned print ads still have value in reaching older demographic groups."
  }
]