[
  {
    "english": "required",
    "chinese": "必须的，规定的",
    "example": "Attending the career workshop is required for all seniors in their final semester."
  },
  {
    "english": "conduct",
    "chinese": "实施，进行",
    "example": "The career-services center will conduct practice interviews for students next week."
  },
  {
    "english": "employer",
    "chinese": "雇主",
    "example": "Many employers prefer candidates who have relevant internship experience."
  },
  {
    "english": "session",
    "chinese": "一段时间，时段",
    "example": "I signed up for a resume-writing session at the career center."
  },
  {
    "english": "realistic",
    "chinese": "现实的",
    "example": "It's important to have a realistic understanding of the job market in your field."
  },
  {
    "english": "relaxed",
    "chinese": "放松的",
    "example": "Try to stay relaxed during job interviews to make a good impression."
  },
  {
    "english": "timing",
    "chinese": "时机",
    "example": "The timing of your job application can significantly affect your chances of getting hired."
  },
  {
    "english": "stressful",
    "chinese": "有压力的",
    "example": "Balancing job searches and final exams can be really stressful."
  },
  {
    "english": "option",
    "chinese": "选择",
    "example": "Working a part-time job is a great option for gaining practical skills."
  },
  {
    "english": "assignment",
    "chinese": "作业",
    "example": "I need to finish my research paper assignment before focusing on job applications."
  },
  {
    "english": "gym",
    "chinese": "健身房",
    "example": "Going to the gym helps me relax when job hunting gets stressful."
  },
  {
    "english": "practice interviews",
    "chinese": "模拟面试",
    "example": "Practice interviews can really improve your confidence for real job interviews."
  },
  {
    "english": "career-services center",
    "chinese": "职业服务中心",
    "example": "Visit the career-services center for free resume reviews and job search tips."
  },
  {
    "english": "job interviews",
    "chinese": "求职面试",
    "example": "Preparing for job interviews takes a lot of time and effort."
  },
  {
    "english": "improve the chances of getting a job",
    "chinese": "提高找工作的机会",
    "example": "Gaining relevant skills can greatly improve the chances of getting a job."
  },
  {
    "english": "student volunteers",
    "chinese": "学生志愿者",
    "example": "Student volunteers help organize career fairs on campus."
  },
  {
    "english": "final semester",
    "chinese": "最后一个学期",
    "example": "Many students start job hunting in their final semester."
  },
  {
    "english": "look for jobs",
    "chinese": "找工作",
    "example": "I spend two hours every day looking for jobs that match my skills."
  },
  {
    "english": "take it seriously",
    "chinese": "认真对待",
    "example": "You should take it seriously when employers ask for an interview."
  },
  {
    "english": "work on",
    "chinese": "做，处理",
    "example": "I need to work on my cover letter before sending out job applications."
  },
  {
    "english": "research paper",
    "chinese": "研究论文",
    "example": "Finishing the research paper is my top priority this month."
  },
  {
    "english": "take final exams",
    "chinese": "参加期末考试",
    "example": "Students are busy taking final exams in the last month of the semester."
  },
  {
    "english": "work a part-time job",
    "chinese": "做兼职",
    "example": "I work a part-time job at the campus bookstore to gain work experience."
  },
  {
    "english": "keep track of",
    "chinese": "跟踪",
    "example": "Use a spreadsheet to keep track of the jobs you've applied to."
  },
  {
    "english": "fit into the very full schedules",
    "chinese": "融入紧张的日程安排",
    "example": "It's hard to fit job hunting into very full schedules during finals week."
  },
  {
    "english": "free of charge",
    "chinese": "免费",
    "example": "The career center offers resume reviews free of charge to all students."
  },
  {
    "english": "reduce car traffic",
    "chinese": "减少汽车交通",
    "example": "Biking to campus can help reduce car traffic and lower carbon emissions."
  },
  {
    "english": "on campus",
    "chinese": "在校园内",
    "example": "There are many job opportunities on campus for students."
  },
  {
    "english": "get more exercise",
    "chinese": "多锻炼",
    "example": "Walking to academic buildings helps me get more exercise every day."
  },
  {
    "english": "academic buildings",
    "chinese": "教学楼",
    "example": "The academic buildings are spread out, so give yourself enough time to get to class."
  },
  {
    "english": "get around",
    "chinese": "四处走动",
    "example": "Bicycles are a great way to get around campus quickly."
  },
  {
    "english": "the roads get really busy",
    "chinese": "道路变得非常繁忙",
    "example": "The roads get really busy during rush hour, so plan your commute accordingly."
  },
  {
    "english": "way better",
    "chinese": "好得多",
    "example": "Taking the bus to campus is way better than driving in heavy traffic."
  },
  {
    "english": "go jogging",
    "chinese": "去慢跑",
    "example": "I go jogging around campus to relieve stress from job hunting."
  },
  {
    "english": "set aside extra time",
    "chinese": "额外留出时间",
    "example": "Set aside extra time for job interviews during your final semester."
  }
]