[
  {
    "english": "library",
    "chinese": "图书馆",
    "example": "I spend most weekends studying in the library because it's quiet and has lots of resources."
  },
  {
    "english": "cafeteria",
    "chinese": "食堂",
    "example": "The cafeteria serves a variety of dishes, so you can always find something you like."
  },
  {
    "english": "dormitory",
    "chinese": "宿舍",
    "example": "Living in a dormitory is a great way to make new friends when you first start college."
  },
  {
    "english": "gallery",
    "chinese": "美术馆，画廊",
    "example": "There's a new exhibition at the campus gallery featuring local artists—want to check it out?"
  },
  {
    "english": "way",
    "chinese": "远远地，大大地",
    "example": "The new library is way bigger than the old one—they even have a quiet zone on the top floor."
  },
  {
    "english": "editor",
    "chinese": "编辑",
    "example": "She works as an editor for the school newspaper, helping to review and improve articles."
  },
  {
    "english": "aerobics",
    "chinese": "健美操",
    "example": "I joined an aerobics class at the gym—it's a fun way to stay fit and meet people."
  },
  {
    "english": "internship",
    "chinese": "实习",
    "example": "Getting an internship during college can really help you gain practical experience in your field."
  },
  {
    "english": "funding",
    "chinese": "资助",
    "example": "The university offers funding for students who want to start their own research projects."
  },
  {
    "english": "automatically",
    "chinese": "自动地",
    "example": "The lights in the classroom turn on automatically when someone enters the room."
  },
  {
    "english": "gymnasium",
    "chinese": "体育馆",
    "example": "We have PE class in the gymnasium every Tuesday and Thursday."
  },
  {
    "english": "bare",
    "chinese": "光秃秃的",
    "example": "The dorm room was bare when I first moved in, but I soon decorated it with posters and photos."
  },
  {
    "english": "laundry",
    "chinese": "洗衣房",
    "example": "Remember to bring enough coins for the laundry machines—they don't accept cards."
  },
  {
    "english": "bulletin",
    "chinese": "公告栏",
    "example": "Check the bulletin board near the cafeteria for updates on upcoming events and clubs."
  },
  {
    "english": "eliminate",
    "chinese": "去除，消除",
    "example": "The new policy aims to eliminate long waiting times for student registration."
  },
  {
    "english": "residency",
    "chinese": "居住，住所",
    "example": "International students usually apply for campus residency before the semester starts."
  },
  {
    "english": "ensure",
    "chinese": "保证，确保",
    "example": "Arrive early to ensure you get a good seat for the welcome speech."
  },
  {
    "english": "install",
    "chinese": "安装",
    "example": "They're installing new computers in the library—they should be ready next week."
  },
  {
    "english": "renovate",
    "chinese": "翻新，修复",
    "example": "The university is renovating the old dormitories to make them more comfortable."
  },
  {
    "english": "freshman",
    "chinese": "新生",
    "example": "Freshman orientation helps new students get familiar with the campus and their classes."
  },
  {
    "english": "upperclassman",
    "chinese": "高年级学生",
    "example": "My upperclassman gave me some great tips on which professors to take."
  },
  {
    "english": "admission director",
    "chinese": "招生官",
    "example": "The admission director will be available to answer questions about the application process."
  },
  {
    "english": "explore potential careers",
    "chinese": "探索职业路径",
    "example": "The career fair is a good opportunity to explore potential careers and talk to industry professionals."
  },
  {
    "english": "on the edge of...",
    "chinese": "几乎..., 在...的边缘",
    "example": "I was on the edge of being late for class because the bus was delayed."
  },
  {
    "english": "registration fee",
    "chinese": "注册费，报名费",
    "example": "You need to pay the registration fee before you can sign up for the summer course."
  },
  {
    "english": "interaction and networking with...",
    "chinese": "和...互动、社交",
    "example": "Joining a club allows for more interaction and networking with students who share your interests."
  },
  {
    "english": "come in handy",
    "chinese": "派上用场",
    "example": "Learning basic cooking skills will come in handy when you live in a dorm without a cafeteria."
  },
  {
    "english": "mock interview",
    "chinese": "模拟面试",
    "example": "The career center offers mock interviews to help students prepare for real job interviews."
  },
  {
    "english": "parking lot",
    "chinese": "停车场",
    "example": "The parking lot near the dormitory fills up quickly in the morning, so get there early."
  },
  {
    "english": "go to and from classes",
    "chinese": "上学、放学",
    "example": "Many students bike to go to and from classes, which is both fast and good exercise."
  },
  {
    "english": "free of charge",
    "chinese": "免费",
    "example": "The gymnasium offers some fitness classes free of charge for full-time students."
  },
  {
    "english": "computer lab",
    "chinese": "机房，电脑室",
    "example": "I often finish my assignments in the computer lab because the software there is more advanced."
  },
  {
    "english": "career center",
    "chinese": "职业发展中心",
    "example": "Visit the career center for help with resume writing and job search strategies."
  },
  {
    "english": "make a difference",
    "chinese": "有影响，起作用",
    "example": "Volunteering at the campus library can really make a difference in the lives of other students."
  },
  {
    "english": "increase the appeal of...",
    "chinese": "提升...的吸引力",
    "example": "Adding more green spaces will increase the appeal of the campus to prospective students."
  },
  {
    "english": "postpone enrollment",
    "chinese": "延迟入学",
    "example": "She decided to postpone enrollment for a year to travel and gain life experience."
  },
  {
    "english": "printing center",
    "chinese": "打印中心",
    "example": "The printing center is open 24/7, so you can print your assignments anytime."
  },
  {
    "english": "gap year",
    "chinese": "间隔年",
    "example": "Taking a gap year allowed him to explore his interests before deciding on a major."
  },
  {
    "english": "financial support",
    "chinese": "经济支持",
    "example": "The university provides financial support to students who demonstrate financial need."
  },
  {
    "english": "prospective new students",
    "chinese": "准新生",
    "example": "A tour of the campus is organized for prospective new students and their families."
  },
  {
    "english": "set aside...",
    "chinese": "把...放在一边",
    "example": "Set aside some time each day to review what you learned in class."
  },
  {
    "english": "in advance",
    "chinese": "提前",
    "example": "It's a good idea to apply for campus housing in advance to secure a spot."
  },
  {
    "english": "scenic spots",
    "chinese": "景点",
    "example": "The campus is located near several scenic spots, perfect for weekend trips."
  },
  {
    "english": "overhead lights",
    "chinese": "顶灯",
    "example": "The overhead lights in the classroom can be adjusted to different brightness levels."
  },
  {
    "english": "air-conditioning",
    "chinese": "空调",
    "example": "Most classrooms and dormitories have air-conditioning, which is great in the summer."
  },
  {
    "english": "default settings",
    "chinese": "默认设置",
    "example": "Remember to check the default settings on the printer before you start your job."
  }
]