[
  {
    "english": "harmless and well-intended white lies",
    "chinese": "无害且善意的善意谎言",
    "example": "Telling harmless and well-intended white lies to avoid hurting someone's feelings is a common practice in daily interactions."
  },
  {
    "english": "to compliment our friends",
    "chinese": "赞美我们的朋友",
    "example": "She told a small fib to compliment our friend’s new haircut, even though it wasn’t her favorite style."
  },
  {
    "english": "establish mutual trust",
    "chinese": "建立相互信任",
    "example": "Sharing personal stories honestly is key to establish mutual trust in a friendship."
  },
  {
    "english": "encourage open communication",
    "chinese": "鼓励开放的交流",
    "example": "Creating a judgment-free environment can encourage open communication among team members."
  },
  {
    "english": "build stronger relationships",
    "chinese": "建立更牢固的关系",
    "example": "Spending quality time together helps build stronger relationships between family members."
  },
  {
    "english": "avoid misunderstandings and conflicts",
    "chinese": "避免误解和冲突",
    "example": "Clarifying expectations upfront can avoid misunderstandings and conflicts at work."
  },
  {
    "english": "show support and respect",
    "chinese": "表示支持和尊重",
    "example": "Attending a colleague’s presentation shows support and respect for their efforts."
  },
  {
    "english": "protect their feelings",
    "chinese": "保护他们的感受",
    "example": "He paused before speaking, trying to protect her feelings while giving feedback."
  },
  {
    "english": "have a condescending attitude",
    "chinese": "有一种居高临下的态度",
    "example": "Speaking in a patronizing tone can make others feel you have a condescending attitude."
  },
  {
    "english": "lead to a vicious circle",
    "chinese": "导致恶性循环",
    "example": "Skipping workouts due to fatigue can lead to a vicious circle of low energy."
  },
  {
    "english": "another noteworthy aspect is that",
    "chinese": "句式：另一个值得注意的方面是",
    "example": "Another noteworthy aspect is that regular exercise improves both physical and mental health."
  },
  {
    "english": "in a nutshell",
    "chinese": "简而言之",
    "example": "In a nutshell, the project requires teamwork, creativity, and attention to detail."
  },
  {
    "english": "a stepping stone to success",
    "chinese": "通往成功的垫脚石",
    "example": "Internships often serve as a stepping stone to success in a professional career."
  },
  {
    "english": "controversial topics",
    "chinese": "有争议的话题",
    "example": "Discussing controversial topics in a classroom requires respect for different opinions."
  },
  {
    "english": "a wide range of",
    "chinese": "各种各样的",
    "example": "The museum displays a wide range of ancient artifacts from different civilizations."
  },
  {
    "english": "align closely with our own situations",
    "chinese": "符合我们自己的情况",
    "example": "Stories that align closely with our own situations are easier to relate to."
  },
  {
    "english": "turn out",
    "chinese": "结果是...",
    "example": "The casual gathering turned out to be a memorable event for everyone involved."
  },
  {
    "english": "white lie",
    "chinese": "善意的谎言",
    "example": "She told a white lie about being busy to avoid an awkward social event."
  },
  {
    "english": "social interactions",
    "chinese": "社会交往",
    "example": "Active listening is crucial in effective social interactions."
  },
  {
    "english": "utterly frank",
    "chinese": "完全的诚实",
    "example": "Being utterly frank with your partner can strengthen your relationship in the long run."
  },
  {
    "english": "pure sincerity",
    "chinese": "纯粹的真诚",
    "example": "His speech moved the audience with its pure sincerity and vulnerability."
  },
  {
    "english": "hurt one's feelings",
    "chinese": "伤害某人的感情",
    "example": "Careless comments can easily hurt one's feelings, even if unintended."
  },
  {
    "english": "express our appreciation",
    "chinese": "表达我们的感激",
    "example": "Writing a handwritten note is a thoughtful way to express our appreciation."
  },
  {
    "english": "guarantee a solid friendship",
    "chinese": "保证牢固的友谊",
    "example": "Shared experiences and mutual respect guarantee a solid friendship over time."
  },
  {
    "english": "contribute to",
    "chinese": "有助于",
    "example": "Planting trees can contribute to improving the local environment."
  },
  {
    "english": "supporting details",
    "chinese": "支持性细节",
    "example": "Adding supporting details to your essay makes your argument more convincing."
  },
  {
    "english": "on every occasion",
    "chinese": "在每一个场合",
    "example": "She brings a positive attitude to work on every occasion, inspiring her colleagues."
  },
  {
    "english": "dishonest deed",
    "chinese": "不诚实的行为",
    "example": "Stealing even a small item is a dishonest deed that affects trust."
  },
  {
    "english": "feel hurt",
    "chinese": "感觉到受伤害",
    "example": "He tried to hide how much the rejection made him feel hurt."
  },
  {
    "english": "be capable of doing sth.",
    "chinese": "能够做某事",
    "example": "With practice, anyone can be capable of playing a musical instrument."
  },
  {
    "english": "in addition",
    "chinese": "除此之外",
    "example": "In addition to regular exercise, a balanced diet is key to good health."
  },
  {
    "english": "cover up",
    "chinese": "覆盖",
    "example": "Using concealer can help cover up minor blemishes on the skin."
  },
  {
    "english": "provide valuable insights",
    "chinese": "提供有价值的见解",
    "example": "Reading biographies of successful people can provide valuable insights into their strategies."
  },
  {
    "english": "tell truths from falsehoods",
    "chinese": "从谎言中辨别出真相",
    "example": "Critical thinking helps us tell truths from falsehoods in online information."
  },
  {
    "english": "for someone's good",
    "chinese": "为了某人的好",
    "example": "Parents often make sacrifices for someone's good, even if it's not understood at the time."
  },
  {
    "english": "seemingly harmless",
    "chinese": "看似无害的",
    "example": "Seemingly harmless habits like procrastination can accumulate into major issues."
  },
  {
    "english": "unforeseen consequence",
    "chinese": "不可预知的后果",
    "example": "Cutting corners in a project can lead to unforeseen consequence later on."
  },
  {
    "english": "the best policy",
    "chinese": "最好的做法",
    "example": "In most cases, honesty really is the best policy in personal relationships."
  },
  {
    "english": "in most cases",
    "chinese": "在大多数情况下",
    "example": "In most cases, planning ahead saves time and reduces stress."
  },
  {
    "english": "hold high expectation",
    "chinese": "抱持很高的期望",
    "example": "Teachers should hold high expectation for all students, regardless of their background."
  },
  {
    "english": "do sb. a favor",
    "chinese": "帮某人一个忙",
    "example": "Can you do me a favor and pick up the documents from the office?"
  },
  {
    "english": "completely unfair",
    "chinese": "完全不公平",
    "example": "It's completely unfair to judge someone based on their appearance rather than actions."
  },
  {
    "english": "in certain situations",
    "chinese": "在某些情况下",
    "example": "In certain situations, breaking a small rule might be necessary to prevent a larger problem."
  },
  {
    "english": "participate in",
    "chinese": "参与",
    "example": "Students are encouraged to participate in extracurricular activities on campus."
  },
  {
    "english": "make decision",
    "chinese": "做决策",
    "example": "Gathering all facts before making a decision ensures better outcomes."
  },
  {
    "english": "respond to",
    "chinese": "回应",
    "example": "The company quickly responded to customer complaints with a sincere apology."
  },
  {
    "english": "of the same age",
    "chinese": "同龄的",
    "example": "Children of the same age often have similar interests and developmental needs."
  },
  {
    "english": "throughout their lives",
    "chinese": "贯穿他们的一生",
    "example": "Learning new skills can bring joy and fulfillment throughout their lives."
  }
]