[
  {
    "english": "seem to diminish",
    "chinese": "似乎在缩小",
    "example": "Cultural differences seem to diminish as global communication becomes more frequent."
  },
  {
    "english": "cultural elements become a regular part of daily life",
    "chinese": "文化元素成为日常生活的一部分",
    "example": "Through globalization, cultural elements from around the world become a regular part of daily life."
  },
  {
    "english": "regardless of their nationality",
    "chinese": "不论他们的国籍",
    "example": "People worldwide enjoy similar entertainment regardless of their nationality."
  },
  {
    "english": "a diverse range of foods",
    "chinese": "各种各样的食物",
    "example": "Urban areas offer a diverse range of foods from different cultural backgrounds."
  },
  {
    "english": "gather at the same international restaurants",
    "chinese": "聚在同样的国际餐厅",
    "example": "Friends gather at the same international restaurants to enjoy global cuisines together."
  },
  {
    "english": "share meals that once seemed exotic",
    "chinese": "分享曾经看似异国风味的食物",
    "example": "They share meals that once seemed exotic but now feel familiar and comforting."
  },
  {
    "english": "now a familiar part of our routine",
    "chinese": "现在是我们日常生活中熟悉的一部分",
    "example": "Eating sushi has become now a familiar part of our routine in many cities."
  },
  {
    "english": "watch international movies with my peers",
    "chinese": "和我的同伴一起看国际电影",
    "example": "I often watch international movies with my peers to explore different cultures."
  },
  {
    "english": "discuss similar themes and emotions",
    "chinese": "讨论相似的主题和情感",
    "example": "Viewers discuss similar themes and emotions portrayed in films from various countries."
  },
  {
    "english": "from different backgrounds",
    "chinese": "来自不同背景",
    "example": "People from different backgrounds can find common ground through shared cultural experiences."
  },
  {
    "english": "shared experiences",
    "chinese": "共同的经历",
    "example": "Shared experiences with global media create bonds between people worldwide."
  },
  {
    "english": "adopt similar tastes and interests",
    "chinese": "采纳了相似的品味和兴趣",
    "example": "Young people often adopt similar tastes and interests through social media influences."
  },
  {
    "english": "make us feel more alike despite our different origins",
    "chinese": "尽管我们的出身不同，仍让我们感觉更相似",
    "example": "These shared interests make us feel more alike despite our different origins."
  },
  {
    "english": "access information about distinct cultures",
    "chinese": "获取有关不同文化的信息",
    "example": "The internet allows easy access to information about distinct cultures worldwide."
  },
  {
    "english": "learn from each other",
    "chinese": "互相学习",
    "example": "Cultural exchange programs help people learn from each other's traditions and values."
  },
  {
    "english": "result in a reduction in these differences",
    "chinese": "导致这些差异的减少",
    "example": "Increased interaction often results in a reduction in cultural differences over time."
  },
  {
    "english": "limited knowledge about American culture",
    "chinese": "对美国文化的了解有限",
    "example": "Previously, people had limited knowledge about American culture in many regions."
  },
  {
    "english": "due to the long distance between our countries",
    "chinese": "由于我们两国之间的长距离",
    "example": "Due to the long distance between our countries, cultural exchange was once difficult."
  },
  {
    "english": "their eating habits, clothing styles, and daily routines",
    "chinese": "他们的饮食习惯、穿衣风格和日常作息",
    "example": "She was curious about their eating habits, clothing styles, and daily routines."
  },
  {
    "english": "with the advent of the internet",
    "chinese": "随着互联网的到来",
    "example": "With the advent of the internet, global cultural exchange accelerated rapidly."
  },
  {
    "english": "access to a wide range of American movies and TV shows",
    "chinese": "接触到各种各样的美国电影和电视节目",
    "example": "Streaming services provide access to a wide range of American movies and TV shows."
  },
  {
    "english": "adopt western habits",
    "chinese": "采用了西方的习惯",
    "example": "Some individuals adopt western habits after being exposed to foreign media."
  },
  {
    "english": "cultural exchanges have made our lifestyles more similar",
    "chinese": "文化交流使我们的生活方式更加相似",
    "example": "Over time, cultural exchanges have made our lifestyles more similar on a global scale."
  }
]