[
  {
    "english": "artificial",
    "chinese": "人工的，人造的",
    "example": "Artificial terrains in theme parks often mimic natural landscapes for visitors."
  },
  {
    "english": "terrain",
    "chinese": "地形;地势",
    "example": "The hilly terrain made it difficult to transport the artificial structures."
  },
  {
    "english": "saw",
    "chinese": "锯",
    "example": "Workers used a saw to cut down the tree, leaving only a stump behind."
  },
  {
    "english": "stump",
    "chinese": "树桩;残肢;树墩",
    "example": "An artificial stump was placed in the garden to mimic a natural landscape."
  },
  {
    "english": "malaria",
    "chinese": "疟疾",
    "example": "Mosquitoes carrying malaria pose a significant health risk in tropical regions."
  },
  {
    "english": "mosquito",
    "chinese": "蚊子",
    "example": "Artificial ponds can sometimes attract mosquitoes if not properly maintained."
  },
  {
    "english": "opponent",
    "chinese": "对手;反对者",
    "example": "The project's opponents argued that artificial structures would harm the natural terrain."
  },
  {
    "english": "yield",
    "chinese": "产生(收益、效益等)",
    "example": "The artificial intelligence system yielded significant benefits for the company's operations."
  },
  {
    "english": "justify",
    "chinese": "证明正当；证明…正确(或正当、有理)",
    "example": "The team tried to justify the use of artificial materials by citing cost savings."
  },
  {
    "english": "attach",
    "chinese": "把…固定，把…附(在…上)",
    "example": "They attached artificial leaves to the tree stump to make it look more natural."
  },
  {
    "english": "immigrant",
    "chinese": "(外来)移民;外侨",
    "example": "Immigrants often bring new techniques for creating artificial landscapes."
  },
  {
    "english": "coincidence",
    "chinese": "巧合; (令人吃惊的)巧事",
    "example": "It was no coincidence that the artificial pond attracted the same mosquito species as natural ones."
  },
  {
    "english": "critics",
    "chinese": "评论家;批评者",
    "example": "Critics argued that the artificial structure disrupted the natural terrain's balance."
  },
  {
    "english": "hydrocarbon",
    "chinese": "烃;碳氢化合物",
    "example": "Many artificial materials are derived from hydrocarbons, such as plastics."
  },
  {
    "english": "elliptical",
    "chinese": "椭圆形;椭圆的",
    "example": "The artificial lake had an elliptical shape, different from the typical circular ponds."
  },
  {
    "english": "circular",
    "chinese": "圆形的;圆的",
    "example": "They designed a circular artificial garden in the center of the city."
  },
  {
    "english": "depression",
    "chinese": "洼地;不景气",
    "example": "An artificial depression in the terrain was created to collect rainwater."
  },
  {
    "english": "meteorite",
    "chinese": "陨石",
    "example": "Scientists study meteorites to understand the composition of artificial celestial bodies."
  },
  {
    "english": "equator",
    "chinese": "赤道",
    "example": "Artificial satellites often orbit around the Earth's equator."
  },
  {
    "english": "dune",
    "chinese": "(风吹积成的)沙丘",
    "example": "Artificial dunes were built to protect the coastline from erosion."
  },
  {
    "english": "predominantly",
    "chinese": "主要地;多数情况下",
    "example": "The region is predominantly covered in artificial landscapes designed for tourism."
  },
  {
    "english": "celestial",
    "chinese": "天空的;天上的",
    "example": "Artificial celestial objects, like satellites, help with communication and navigation."
  },
  {
    "english": "gravitational",
    "chinese": "引力的;重力引起的",
    "example": "Gravitational forces affect both natural and artificial celestial bodies."
  },
  {
    "english": "methane",
    "chinese": "甲烷;沼气",
    "example": "Artificial sources of methane, such as landfills, contribute to greenhouse gas emissions."
  },
  {
    "english": "precipitate",
    "chinese": "使突然陷入(某种状态);使…突然降临",
    "example": "The artificial structure precipitated a change in the local terrain's drainage patterns."
  },
  {
    "english": "dissolve",
    "chinese": "使(固体)溶解",
    "example": "Artificial salts can dissolve more quickly in water than natural ones."
  },
  {
    "english": "evenly",
    "chinese": "均匀;平均地",
    "example": "They spread the artificial fertilizer evenly across the field."
  },
  {
    "english": "displace",
    "chinese": "移动;置换;取代",
    "example": "Artificial materials can sometimes displace natural ones in construction projects."
  },
  {
    "english": "orient",
    "chinese": "朝向;适应",
    "example": "Artificial satellites must be oriented correctly to maintain their orbit."
  },
  {
    "english": "typical",
    "chinese": "典型的;有代表性的",
    "example": "A typical artificial intelligence system requires significant computational power."
  }
]