[
  {
    "english": "add lanes to highways",
    "chinese": "给高速公路增加车道",
    "example": "Adding lanes to highways is a common strategy to improve traffic flow during peak hours."
  },
  {
    "english": "construct new roads",
    "chinese": "建造新的道路",
    "example": "Local governments often construct new roads to accommodate growing suburban populations."
  },
  {
    "english": "focus on improvements",
    "chinese": "专注在改进（公路）上",
    "example": "The transportation plan will focus on improvements to existing highways before building new ones."
  },
  {
    "english": "modernize existing train and bus systems",
    "chinese": "现代化现存的火车和公交系统",
    "example": "Modernizing existing train and bus systems can significantly enhance public transportation efficiency."
  },
  {
    "english": "make the most sense",
    "chinese": "（在逻辑上）最为合理或最令人信服",
    "example": "Upgrading public transit makes the most sense for cities looking to reduce traffic congestion."
  },
  {
    "english": "help reduce the congestion problem",
    "chinese": "帮助减少拥堵的问题",
    "example": "Adding lanes to highways can help reduce the congestion problem during morning commutes."
  },
  {
    "english": "motivate more people to take public transit",
    "chinese": "激励更多的人来乘坐公共交通",
    "example": "Modernizing bus systems can motivate more people to take public transit instead of driving."
  },
  {
    "english": "take years to modernize",
    "chinese": "需要好多年来完成现代化",
    "example": "Large-scale projects to modernize train systems can take years to complete."
  },
  {
    "english": "see improvements in transportation",
    "chinese": "交通方面进行了改进",
    "example": "Cities that invest in infrastructure often see improvements in transportation within a few years."
  },
  {
    "english": "upgrade roadways to handle more traffic",
    "chinese": "升级道路来应对更多的交通",
    "example": "Local governments are upgrading roadways to handle more traffic from suburban developments."
  },
  {
    "english": "make car trips more efficient",
    "chinese": "使得汽车行驶更高效",
    "example": "Adding express lanes can make car trips more efficient for long-distance commuters."
  },
  {
    "english": "produce fewer emissions",
    "chinese": "产生更少的排放",
    "example": "Efficient traffic flow helps cars produce fewer emissions by reducing idling time."
  },
  {
    "english": "reduce the risk of accidents",
    "chinese": "减少事故的风险",
    "example": "Upgraded roadways with clear signage can reduce the risk of accidents significantly."
  },
  {
    "english": "enhance access to jobs, education, and healthcare",
    "chinese": "增加了接触（好的）工作，教育和医疗的机会",
    "example": "Improved public transit enhances access to jobs, education, and healthcare for urban residents."
  },
  {
    "english": "accommodate future population and economic growth",
    "chinese": "承载未来的人口和经济增长",
    "example": "City planners must design infrastructure to accommodate future population and economic growth."
  },
  {
    "english": "boost economic activity",
    "chinese": "促进经济活动",
    "example": "Efficient transportation systems can boost economic activity by improving logistics and trade."
  },
  {
    "english": "reduce logistics costs",
    "chinese": "减少物流的成本",
    "example": "Upgraded highways can reduce logistics costs for businesses by improving delivery times."
  },
  {
    "english": "provide affordable and accessible transport options",
    "chinese": "提供负担得起的，可获得的交通选择",
    "example": "Modernized bus and train systems provide affordable and accessible transport options for all residents."
  },
  {
    "english": "enhance social equity",
    "chinese": "增强社会平等",
    "example": "Accessible public transit can enhance social equity by connecting underserved communities to opportunities."
  },
  {
    "english": "improvement in overall air quality",
    "chinese": "空气质量的改善",
    "example": "Reduced traffic congestion often leads to an improvement in overall air quality."
  }
]