[
  {
    "english": "identify health problems",
    "chinese": "识别健康问题",
    "example": "Regular check-ups help doctors identify health problems at an early stage."
  },
  {
    "english": "with advances in..",
    "chinese": "随着...的进步",
    "example": "With advances in medical technology, more diseases can be treated effectively."
  },
  {
    "english": "treatment options",
    "chinese": "治疗方案",
    "example": "The doctor discussed various treatment options with the patient before making a plan."
  },
  {
    "english": "have a greater awareness of",
    "chinese": "对...有更高的认识",
    "example": "People today have a greater awareness of the importance of mental health."
  },
  {
    "english": "exercise regularly",
    "chinese": "定期锻炼",
    "example": "Exercising regularly not only keeps you fit but also improves mood."
  },
  {
    "english": "reduce stress",
    "chinese": "减轻压力",
    "example": "Practicing yoga is an effective way to reduce stress and anxiety."
  },
  {
    "english": "adopt healthier behavior",
    "chinese": "养成更健康的行为",
    "example": "Quitting smoking and eating a balanced diet are ways to adopt healthier behavior."
  },
  {
    "english": "significant emphasis on",
    "chinese": "对...的重视",
    "example": "Modern education places significant emphasis on practical skills alongside theory."
  },
  {
    "english": "preventative care",
    "chinese": "预防保健",
    "example": "Investing in preventative care can save costs on medical treatments in the long run."
  },
  {
    "english": "a sedentary lifestyle",
    "chinese": "久坐的生活方式",
    "example": "A sedentary lifestyle has been linked to various health issues like obesity and diabetes."
  },
  {
    "english": "when it comes to...",
    "chinese": "句式：当谈到...时",
    "example": "When it comes to time management, setting clear priorities is essential."
  },
  {
    "english": "the bright sides of...",
    "chinese": "...的积极面",
    "example": "Despite challenges, there are always the bright sides of every situation that deserve attention."
  },
  {
    "english": "counteract the downsides",
    "chinese": "抵消不利因素",
    "example": "Regular breaks can help counteract the downsides of working long hours."
  },
  {
    "english": "lead a stressful and hectic life",
    "chinese": "过着紧张忙碌的生活",
    "example": "Many urban professionals lead a stressful and hectic life, affecting their well-being."
  },
  {
    "english": "food and nutrition",
    "chinese": "食物和营养",
    "example": "Understanding food and nutrition is key to maintaining a healthy body."
  },
  {
    "english": "work-life balance",
    "chinese": "工作与生活的平衡",
    "example": "Achieving a work-life balance is a challenge for many people in today's fast-paced world."
  },
  {
    "english": "disposable incomes",
    "chinese": "可支配收入",
    "example": "With higher disposable incomes, people are more willing to invest in health and wellness."
  },
  {
    "english": "have...at one's disposal",
    "chinese": "有...可供使用",
    "example": "Students with laptops have vast educational resources at their disposal."
  },
  {
    "english": "fitness facility",
    "chinese": "健身设施",
    "example": "The new apartment complex offers modern fitness facilities for residents."
  },
  {
    "english": "keep track of one's health conditions",
    "chinese": "跟踪自己的健康状况",
    "example": "Wearable devices help users keep track of their health conditions in real time."
  },
  {
    "english": "cellphone applications",
    "chinese": "手机应用",
    "example": "There are numerous cellphone applications designed to promote healthy living."
  },
  {
    "english": "be unheard of",
    "chinese": "句式：前所未闻的",
    "example": "Working from home was unheard of for many industries before the pandemic."
  },
  {
    "english": "deterioration in mental health",
    "chinese": "心理健康恶化",
    "example": "Prolonged isolation can lead to deterioration in mental health for some individuals."
  },
  {
    "english": "have arisen",
    "chinese": "句式：已经产生",
    "example": "New challenges have arisen in public health due to changing lifestyles."
  },
  {
    "english": "preserve the planet we live on",
    "chinese": "保护我们居住的地球",
    "example": "Every individual can contribute to preserving the planet we live on through small actions."
  },
  {
    "english": "come to realize",
    "chinese": "开始意识到",
    "example": "People are coming to realize the importance of environmental protection for future generations."
  },
  {
    "english": "play a part in doing...",
    "chinese": "在做...中发挥作用",
    "example": "Governments play a crucial part in implementing policies to combat climate change."
  },
  {
    "english": "survive and thrive",
    "chinese": "生存并繁荣",
    "example": "Organizations must adapt to changes to survive and thrive in a competitive market."
  },
  {
    "english": "at the cost of...",
    "chinese": "以...为代价",
    "example": "Industrial development should not be achieved at the cost of environmental degradation."
  },
  {
    "english": "living standards",
    "chinese": "生活水平",
    "example": "Technological innovations have significantly improved living standards worldwide."
  },
  {
    "english": "be switched to...",
    "chinese": "被切换到",
    "example": "Many industries have been switched to renewable energy sources to reduce carbon emissions."
  },
  {
    "english": "emit waste water and gases",
    "chinese": "排放废水和废气",
    "example": "Strict regulations are needed to control factories from emitting waste water and gases."
  },
  {
    "english": "on a daily basis",
    "chinese": "每天",
    "example": "Simple habits like recycling can make a difference on a daily basis."
  },
  {
    "english": "life expectancy",
    "chinese": "预期寿命",
    "example": "Improvements in healthcare have led to an increase in global life expectancy."
  },
  {
    "english": "have access to information",
    "chinese": "有获取信息的途径",
    "example": "The internet allows people to have access to information from around the world."
  },
  {
    "english": "be marked by...",
    "chinese": "以...为标志",
    "example": "The 21st century is marked by rapid technological advancements and global connectivity."
  },
  {
    "english": "rely on...",
    "chinese": "依赖",
    "example": "Many cities rely on tourism as a major source of economic income."
  },
  {
    "english": "relate to...",
    "chinese": "与...相关",
    "example": "Health issues often relate to one's lifestyle and eating habits."
  },
  {
    "english": "mental health",
    "chinese": "心理健康",
    "example": "Mental health is just as important as physical health and should not be ignored."
  },
  {
    "english": "take medication",
    "chinese": "服药",
    "example": "Patients should follow the doctor's advice when taking medication for chronic illnesses."
  },
  {
    "english": "suffer from...",
    "chinese": "遭受",
    "example": "Millions of people worldwide suffer from allergies and respiratory problems due to pollution."
  },
  {
    "english": "stay ahead",
    "chinese": "保持领先",
    "example": "Continuous learning is essential to stay ahead in a rapidly changing job market."
  },
  {
    "english": "gain competitive advantage",
    "chinese": "获得竞争优势",
    "example": "Innovative products help companies gain competitive advantage in the global market."
  },
  {
    "english": "under great pressure",
    "chinese": "在巨大压力下",
    "example": "Students under great pressure may experience burnout if they don't take breaks."
  },
  {
    "english": "be delighted",
    "chinese": "感到高兴",
    "example": "She was delighted to hear that her health condition had improved significantly."
  },
  {
    "english": "in terms of...",
    "chinese": "在...方面",
    "example": "In terms of environmental impact, electric vehicles are much better than gasoline cars."
  },
  {
    "english": "some believe... while others do not think so.",
    "chinese": "句型：一些人认为...，而另一些人则不这么认为。",
    "example": "Some believe technology has improved life quality, while others do not think so due to its negative effects."
  },
  {
    "english": "environmental protection",
    "chinese": "环境保护",
    "example": "International cooperation is vital for effective environmental protection and sustainability."
  },
  {
    "english": "make contribution",
    "chinese": "做出贡献",
    "example": "Every individual can make a contribution to reducing plastic waste in daily life."
  },
  {
    "english": "living essential",
    "chinese": "生活必需品",
    "example": "Access to clean water and fresh air are basic living essentials for all humans."
  },
  {
    "english": "a multitude of...",
    "chinese": "大量的",
    "example": "A multitude of studies have shown the benefits of regular exercise for overall health."
  }
]