[
  {
    "english": "inhabit",
    "chinese": "居住在;栖居于",
    "example": "Prairie dogs inhabit vast networks of burrows in the North American grasslands."
  },
  {
    "english": "endangered",
    "chinese": "濒危的",
    "example": "The black-footed ferret, which preys on prairie dogs, is an endangered species."
  },
  {
    "english": "depleted",
    "chinese": "耗尽的；废弃的",
    "example": "Overgrazing has turned many fertile fields into depleted, barren lands."
  },
  {
    "english": "controversy",
    "chinese": "争议;(公开的)争论",
    "example": "There is ongoing controversy about whether to cull prairie dog colonies to protect crops."
  },
  {
    "english": "graze",
    "chinese": "放牧；吃草",
    "example": "Cattle graze alongside prairie dog towns, sometimes disturbing their burrows."
  },
  {
    "english": "burrow",
    "chinese": "(动物的)洞穴，洞穴通道",
    "example": "Prairie dogs maintain complex burrow systems with multiple entrances and chambers."
  },
  {
    "english": "hazard",
    "chinese": "危险;危害",
    "example": "Flooding is a major hazard for prairie dog burrows during the rainy season."
  },
  {
    "english": "plague",
    "chinese": "瘟疫;(老鼠或昆虫等肆虐造成的)灾害",
    "example": "Sylvatic plague, spread by fleas, has decimated prairie dog populations."
  },
  {
    "english": "infect",
    "chinese": "传染; 使携带病菌",
    "example": "Fleas can infect prairie dogs with deadly diseases like the plague."
  },
  {
    "english": "transmit",
    "chinese": "传输;使通过",
    "example": "Infected fleas transmit the plague bacteria between prairie dogs."
  },
  {
    "english": "ecological",
    "chinese": "生态的;生态学的",
    "example": "Prairie dogs play a vital ecological role in maintaining grassland health."
  },
  {
    "english": "reputation",
    "chinese": "名誉;名声",
    "example": "Prairie dogs have a reputation for being pests due to their burrowing habits."
  },
  {
    "english": "feed",
    "chinese": "动物的饲料",
    "example": "Farmers sometimes use prairie dog habitats as feed for livestock."
  },
  {
    "english": "prairie dog",
    "chinese": "草原犬鼠(生活于北美地穴)",
    "example": "Prairie dogs are social rodents that live in large colonies called towns."
  },
  {
    "english": "flea",
    "chinese": "跳蚤;蚤",
    "example": "Fleas are common parasites on prairie dogs and other small mammals."
  },
  {
    "english": "salamander",
    "chinese": "蝾螈(两栖动物，形似蜥蜴)",
    "example": "Some salamander species take shelter in abandoned prairie dog burrows."
  },
  {
    "english": "coyote",
    "chinese": "丛林狼，草原狼",
    "example": "Coyotes often prey on prairie dogs, helping to control their population."
  },
  {
    "english": "detect",
    "chinese": "发现;查明",
    "example": "Prairie dogs can detect predators like coyotes from great distances."
  },
  {
    "english": "drift",
    "chinese": "漂流;漂移",
    "example": "Soil drift can sometimes block the entrances to prairie dog burrows."
  },
  {
    "english": "motionless",
    "chinese": "一动不动的;静止的",
    "example": "A prairie dog will stay motionless when it senses a potential threat."
  },
  {
    "english": "objection",
    "chinese": "反对;异议",
    "example": "Environmentalists have raised objections to the poisoning of prairie dog colonies."
  },
  {
    "english": "snap up",
    "chinese": "抢购，赶紧买下（便宜或心仪之物）",
    "example": "Collectors sometimes snap up prairie dog-themed merchandise at wildlife parks."
  },
  {
    "english": "cuttlefish",
    "chinese": "墨鱼;乌贼",
    "example": "Cuttlefish, like other cephalopods, have remarkable camouflage abilities."
  },
  {
    "english": "relative",
    "chinese": "亲戚;亲属",
    "example": "Cuttlefish are close relatives of octopuses and squids."
  },
  {
    "english": "cephalopod",
    "chinese": "头足动物(如章鱼和乌贼)",
    "example": "Cephalopods like cuttlefish have highly developed nervous systems."
  },
  {
    "english": "debris",
    "chinese": "碎片;残骸",
    "example": "Cuttlefish often hide among underwater debris to avoid predators."
  },
  {
    "english": "particles",
    "chinese": "颗粒;粒子",
    "example": "Cuttlefish can change skin color by manipulating pigmented particles called chromatophores."
  },
  {
    "english": "spot",
    "chinese": "看出, 注意到",
    "example": "It's difficult to spot a cuttlefish when it blends into its surroundings."
  },
  {
    "english": "startling",
    "chinese": "惊人的;让人震惊的",
    "example": "The cuttlefish's ability to mimic patterns is nothing short of startling."
  },
  {
    "english": "vulnerable",
    "chinese": "脆弱的;(身体上或感情上)易受…伤害的",
    "example": "Young cuttlefish are particularly vulnerable to predation in their first weeks of life."
  }
]