[
  {
    "english": "develop sustainable energy sources",
    "chinese": "开发可持续能源",
    "example": "Many countries are investing in research to develop sustainable energy sources like solar and wind power."
  },
  {
    "english": "solar and wind energy",
    "chinese": "太阳能和风能",
    "example": "Solar and wind energy are renewable resources that produce little to no pollution."
  },
  {
    "english": "preserve natural places",
    "chinese": "保护自然环境",
    "example": "Organizations work to preserve natural places like forests and wetlands for future generations."
  },
  {
    "english": "heavily polluting companies",
    "chinese": "污染严重的公司",
    "example": "The government should regulate heavily polluting companies to reduce environmental damage."
  },
  {
    "english": "encourage energy conservation",
    "chinese": "鼓励节约能源",
    "example": "Tax incentives can encourage energy conservation in both households and businesses."
  },
  {
    "english": "establish car-free zones",
    "chinese": "建立无车区",
    "example": "Establishing car-free zones in cities can improve air quality and promote sustainable transportation."
  },
  {
    "english": "educate the general public about the importance of",
    "chinese": "教育公众了解…的重要性",
    "example": "Schools should educate the general public about the importance of recycling and waste reduction."
  },
  {
    "english": "cause/prevent environmental damage",
    "chinese": "造成/防止环境破坏",
    "example": "Industrial activities can cause severe environmental damage if not properly regulated."
  },
  {
    "english": "impose penalties on",
    "chinese": "对...施加惩罚",
    "example": "Governments can impose penalties on companies that violate environmental protection laws."
  },
  {
    "english": "environmentally-friendly",
    "chinese": "对环境友好的",
    "example": "Using environmentally-friendly products helps reduce the carbon footprint of households."
  },
  {
    "english": "deter offenders from doing",
    "chinese": "阻止罪犯，让他们不去做……",
    "example": "Strict regulations can deter offenders from engaging in illegal logging activities."
  },
  {
    "english": "increase revenue for the government",
    "chinese": "增加政府收入",
    "example": "Taxes on carbon emissions can increase revenue for the government while reducing pollution."
  },
  {
    "english": "have financial resources",
    "chinese": "有财力",
    "example": "Only companies with sufficient financial resources can invest in green technologies."
  },
  {
    "english": "solve the problem at the root",
    "chinese": "从根本上解决问题",
    "example": "To solve the problem at the root, we must address the causes of environmental degradation."
  },
  {
    "english": "have long-term effects on",
    "chinese": "有长期影响",
    "example": "Climate change will have long-term effects on global ecosystems and human societies."
  },
  {
    "english": "increase sb's environmental awareness",
    "chinese": "提高某人的环保意识",
    "example": "Environmental campaigns aim to increase people's environmental awareness and promote action."
  },
  {
    "english": "hold sb accountable for their actions",
    "chinese": "让某人对自己的行为负责",
    "example": "Legal systems must hold corporations accountable for their environmental impact."
  },
  {
    "english": "invest in sustainable practices",
    "chinese": "投资可持续发展的做法",
    "example": "Businesses that invest in sustainable practices often gain a competitive edge in the market."
  },
  {
    "english": "react to market demand",
    "chinese": "对市场需求做出反应",
    "example": "Companies must react to market demand for eco-friendly products to stay relevant."
  },
  {
    "english": "a short-sighted policy",
    "chinese": "短视的政策",
    "example": "Ignoring renewable energy in favor of fossil fuels is a short-sighted policy for the environment."
  },
  {
    "english": "record-breaking",
    "chinese": "破纪录的，数额巨大的",
    "example": "The heatwave caused record-breaking temperatures across the country."
  },
  {
    "english": "compensate for the loss of profits",
    "chinese": "补偿利润损失",
    "example": "Companies may need to find new revenue streams to compensate for the loss of profits from eco-reforms."
  },
  {
    "english": "take cost-cutting measures",
    "chinese": "采取削减成本的措施",
    "example": "During an economic crisis, companies often take cost-cutting measures that may harm the environment."
  },
  {
    "english": "adversely affect sth.",
    "chinese": "消极地影响……",
    "example": "Pollution can adversely affect both human health and wildlife populations."
  },
  {
    "english": "illegal or unethical practices",
    "chinese": "非法或不道德的行为",
    "example": "Environmental regulations aim to prevent illegal or unethical practices in industries."
  },
  {
    "english": "well-established companies",
    "chinese": "声誉卓著的公司",
    "example": "Well-established companies have a responsibility to lead in sustainable practices."
  },
  {
    "english": "soften the negative impact of",
    "chinese": "减轻…的负面影响",
    "example": "Planting trees can help soften the negative impact of urbanization on local ecosystems."
  },
  {
    "english": "have a ripple effect on the economy",
    "chinese": "对经济产生连锁反应",
    "example": "Investments in renewable energy can have a ripple effect on the economy by creating new industries."
  },
  {
    "english": "upgrade their production processes",
    "chinese": "升级他们的生产流程",
    "example": "Manufacturers must upgrade their production processes to meet stricter environmental standards."
  },
  {
    "english": "side effect",
    "chinese": "副作用",
    "example": "Industrial development often has environmental side effects that need to be addressed."
  },
  {
    "english": "create new job opportunities",
    "chinese": "创造新的就业机会",
    "example": "The growth of renewable energy sectors creates new job opportunities in green technology."
  },
  {
    "english": "cover their daily expenses",
    "chinese": "支付他们的日常开支",
    "example": "Low-income families struggle to cover their daily expenses while adopting eco-friendly habits."
  },
  {
    "english": "make ends meet",
    "chinese": "收支平衡",
    "example": "Many households have to make difficult choices to make ends meet while reducing waste."
  },
  {
    "english": "open the door to economic growth",
    "chinese": "打开经济增长的大门",
    "example": "Investing in sustainable infrastructure can open the door to long-term economic growth."
  },
  {
    "english": "raise public awareness",
    "chinese": "提高公众意识",
    "example": "Media campaigns play a key role in raising public awareness about environmental issues."
  },
  {
    "english": "manufacturing sector",
    "chinese": "制造业",
    "example": "The manufacturing sector is under pressure to reduce its environmental footprint."
  },
  {
    "english": "pro-business environment",
    "chinese": "鼓励商业的环境",
    "example": "A pro-business environment should also prioritize environmental sustainability."
  },
  {
    "english": "place a lot of emphasis on",
    "chinese": "非常强调",
    "example": "Modern education places a lot of emphasis on environmental literacy and sustainability."
  },
  {
    "english": "fossil fuels",
    "chinese": "化石燃料",
    "example": "Burning fossil fuels is a major contributor to global greenhouse gas emissions."
  },
  {
    "english": "public health",
    "chinese": "公共卫生",
    "example": "Air pollution from industries has a direct impact on public health and well-being."
  },
  {
    "english": "economic activity",
    "chinese": "经济活动",
    "example": "Sustainable economic activity balances growth with environmental protection."
  },
  {
    "english": "upgrade production process",
    "chinese": "升级生产流程",
    "example": "Upgrading production processes can reduce waste and increase efficiency in factories."
  },
  {
    "english": "educate the general public",
    "chinese": "教育公众",
    "example": "NGOs work to educate the general public about sustainable living practices."
  },
  {
    "english": "minimize their environmental impact",
    "chinese": "最小化其环境影响",
    "example": "Tourism companies should minimize their environmental impact on popular destinations."
  },
  {
    "english": "invest in sustainable practice",
    "chinese": "投资于可持续实践",
    "example": "Governments should invest in sustainable practices to address climate change effectively."
  },
  {
    "english": "reduce demand for harmful product",
    "chinese": "减少对有害产品的需求",
    "example": "Consumer awareness can help reduce demand for harmful products like single-use plastics."
  },
  {
    "english": "empower both consumer and business",
    "chinese": "赋予消费者和企业权力",
    "example": "Transparent labeling empowers both consumers and businesses to make eco-friendly choices."
  },
  {
    "english": "establish mutual trust",
    "chinese": "建立相互信任",
    "example": "Collaboration between governments and businesses can establish mutual trust in environmental efforts."
  },
  {
    "english": "impose additional tax",
    "chinese": "征收额外税款",
    "example": "Some countries impose additional tax on carbon emissions to fund green initiatives."
  },
  {
    "english": "allocate resources",
    "chinese": "分配资源",
    "example": "Governments must allocate resources wisely to balance economic growth and environmental protection."
  }
]