[
  {
    "english": "advancement",
    "chinese": "发展;前进",
    "example": "The advancement of technology has revolutionized the field of archaeological excavation."
  },
  {
    "english": "preservation",
    "chinese": "保存;保护",
    "example": "Preservation of ancient settlements is crucial for understanding human history."
  },
  {
    "english": "excavation",
    "chinese": "挖掘;(对古物的)发掘",
    "example": "The excavation of the ancient city revealed overwhelming evidence of a lost civilization."
  },
  {
    "english": "overwhelming",
    "chinese": "压倒性的;巨大的",
    "example": "Overwhelming public support spurred the government to fund the preservation project."
  },
  {
    "english": "settlement",
    "chinese": "定居点;住所",
    "example": "Archaeologists dedicated years to excavating the ancient settlement near the river."
  },
  {
    "english": "dedicate to",
    "chinese": "奉献",
    "example": "The team will dedicate to preserving historical sites despite funding challenges."
  },
  {
    "english": "spur",
    "chinese": "刺激;促进",
    "example": "New discoveries often spur further investigation into related archaeological sites."
  },
  {
    "english": "proceed",
    "chinese": "继续;行进",
    "example": "The excavation will proceed under strict guidelines to avoid damaging artifacts."
  },
  {
    "english": "inadequate",
    "chinese": "不足的;不够的",
    "example": "Inadequate funding has led to setbacks in the preservation of historical documents."
  },
  {
    "english": "grant",
    "chinese": "授予;(尤指正式地或法律上)同意",
    "example": "The government granted permission to excavate the site after thorough review."
  },
  {
    "english": "investigate",
    "chinese": "调查(某人);研究",
    "example": "Experts will investigate the settlement to determine its historical significance."
  },
  {
    "english": "priority",
    "chinese": "优先事项，当务之急",
    "example": "Preservation of rare artifacts should be a priority for cultural institutions."
  },
  {
    "english": "pursue",
    "chinese": "追求;执行",
    "example": "Researchers pursue advancements in technology to improve excavation methods."
  },
  {
    "english": "amateur",
    "chinese": "业余爱好者;外行",
    "example": "Amateur archaeologists must follow strict guidelines when exploring historical sites."
  },
  {
    "english": "guideline",
    "chinese": "准则;指南",
    "example": "The team adopted international guidelines for the excavation and preservation process."
  },
  {
    "english": "adopt",
    "chinese": "采用(某方法);采取(某态度)",
    "example": "Museums should adopt modern techniques to document and preserve artifacts."
  },
  {
    "english": "document",
    "chinese": "记录，记载(详情)",
    "example": "Initial efforts to document the settlement were hindered by inadequate resources."
  },
  {
    "english": "initial",
    "chinese": "开始的;最初的",
    "example": "Initial excavations revealed a surprising number of well-preserved ancient tools."
  },
  {
    "english": "confront",
    "chinese": "直面;对抗",
    "example": "Archaeologists often confront challenges like erosion and vandalism during preservation."
  },
  {
    "english": "setback",
    "chinese": "挫折;阻碍",
    "example": "A major setback occurred when heavy rains damaged the excavation site."
  },
  {
    "english": "implementation",
    "chinese": "实施;执行",
    "example": "Implementation of new preservation techniques requires specialized training."
  },
  {
    "english": "settle",
    "chinese": "解决(分歧、纠纷等)",
    "example": "Experts worked together to settle disputes over the excavation's direction."
  },
  {
    "english": "address",
    "chinese": "设法解决",
    "example": "The committee will address the shortage of funding for historical preservation."
  },
  {
    "english": "symptom",
    "chinese": "症状;征兆",
    "example": "Erosion is a common symptom of inadequate preservation measures for ancient sites."
  },
  {
    "english": "specialist",
    "chinese": "专业人员;专科医生",
    "example": "A team of specialists was called in to handle the delicate excavation process."
  },
  {
    "english": "a wide variety of",
    "chinese": "各种各样的",
    "example": "The site contains a wide variety of artifacts, from pottery to ancient tools."
  },
  {
    "english": "complaint",
    "chinese": "抱怨;投诉",
    "example": "Local residents filed complaints about the excavation's impact on daily life."
  },
  {
    "english": "at the forefront",
    "chinese": "在前线",
    "example": "Scientists at the forefront of preservation technology developed new documentation methods."
  },
  {
    "english": "a shortage of",
    "chinese": "缺乏，缺少",
    "example": "A shortage of specialists has delayed the implementation of key preservation projects."
  },
  {
    "english": "incredibly",
    "chinese": "不可置信地",
    "example": "The team was incredibly fortunate to discover a perfectly preserved ancient settlement."
  },
  {
    "english": "owe",
    "chinese": "欠(情);归功于",
    "example": "Modern archaeology owes much to the advancement of non-destructive testing technologies."
  },
  {
    "english": "from a... standpoint",
    "chinese": "从……的角度",
    "example": "From a preservation standpoint, strict guidelines are essential for excavation projects."
  },
  {
    "english": "be on call",
    "chinese": "随叫随到;召之即来",
    "example": "Specialists remained on call throughout the excavation to address unexpected issues."
  },
  {
    "english": "discourage ... from ...",
    "chinese": "阻止某人做某事",
    "example": "Strict regulations discourage amateurs from attempting unlicensed excavations."
  },
  {
    "english": "residency",
    "chinese": "高级专科住院医生实习期；居住;定居",
    "example": "The ancient residency provided valuable insights into daily life during that era."
  },
  {
    "english": "obstacle",
    "chinese": "障碍;障碍物",
    "example": "Financial constraints were a major obstacle to completing the preservation project."
  }
]