[
  {
    "english": "mysterious",
    "chinese": "神秘的;奇怪的",
    "example": "The ancient palace ruins hold mysterious secrets from a long-forgotten epoch."
  },
  {
    "english": "resident",
    "chinese": "居民;住户",
    "example": "The residents of the fortress survived the siege by storing ample grain supplies."
  },
  {
    "english": "defense",
    "chinese": "防护;防御措施",
    "example": "The city's defense included a moat and massive stone walls to repel invaders."
  },
  {
    "english": "siege",
    "chinese": "围攻;(军队对城镇的)围困",
    "example": "During the siege, the residents relied on stored grain to survive the long blockade."
  },
  {
    "english": "grain",
    "chinese": "粮食;谷物",
    "example": "Granaries filled with grain were crucial for cities enduring long periods of siege."
  },
  {
    "english": "destruction",
    "chinese": "破坏;毁灭",
    "example": "The invasion led to the destruction of many historical palaces and documents."
  },
  {
    "english": "palace",
    "chinese": "王宫，宫殿",
    "example": "The palace's grand architecture symbolized the power and wealth of the ruling dynasty."
  },
  {
    "english": "symbolize",
    "chinese": "象征;是…的象征",
    "example": "The golden dragon on the palace walls symbolized the emperor's divine authority."
  },
  {
    "english": "inhabit",
    "chinese": "居住在;栖居于",
    "example": "Ancient tribes inhabited the region long before the construction of the fortified city."
  },
  {
    "english": "repel",
    "chinese": "排斥;击退",
    "example": "The army used flaming arrows to repel the enemy forces during the siege."
  },
  {
    "english": "by force",
    "chinese": "通过武力",
    "example": "Invaders tried to take the city by force, but its defenses held strong."
  },
  {
    "english": "tank",
    "chinese": "(贮放液体或气体的)箱，槽",
    "example": "Water tanks were essential for storing moisture during dry seasons."
  },
  {
    "english": "moisture",
    "chinese": "水汽;潮气",
    "example": "Sealed jars helped preserve grain by preventing moisture from spoiling the harvest."
  },
  {
    "english": "flame",
    "chinese": "火焰; 火舌",
    "example": "The siege engines were set ablaze, their flames lighting up the night sky."
  },
  {
    "english": "in this regard",
    "chinese": "在这一点上",
    "example": "In this regard, the city's defense system was ahead of its time in architectural innovation."
  },
  {
    "english": "surrounding",
    "chinese": "周围的;附近的",
    "example": "The surrounding forests provided timber for the palace's construction and defense works."
  },
  {
    "english": "epoch",
    "chinese": "时代;时期",
    "example": "This style of architecture is characteristic of the imperial epoch in ancient history."
  },
  {
    "english": "document",
    "chinese": "文件;文献",
    "example": "Ancient documents reveal details about the city's defense strategies during sieges."
  },
  {
    "english": "proponent",
    "chinese": "倡导者，支持者",
    "example": "Proponents of the ancient defense system argued for its effectiveness against invaders."
  },
  {
    "english": "comet",
    "chinese": "彗星;扫帚星",
    "example": "Ancient cultures often attributed the appearance of a comet to impending destruction."
  },
  {
    "english": "magnetic",
    "chinese": "有磁性的;磁性的",
    "example": "Magnetic rocks were used in ancient times for navigation and defense mechanisms."
  },
  {
    "english": "deposit",
    "chinese": "使沉积;使沉淀",
    "example": "Rivers deposit nutrient-rich sediments, which were vital for grain cultivation."
  },
  {
    "english": "attribute to",
    "chinese": "把...归因于...",
    "example": "Historians attribute the city's fall to a combination of siege and internal strife."
  },
  {
    "english": "substantial",
    "chinese": "大量的;重大的",
    "example": "Substantial deposits of iron ore helped fund the city's defense infrastructure."
  },
  {
    "english": "methane",
    "chinese": "甲烷;沼气",
    "example": "Methane gas, if ignited, could create a potent explosion during a siege."
  },
  {
    "english": "potent",
    "chinese": "强有力的，有影响力的",
    "example": "The potent smell of burning pitch filled the air during the enemy's siege attempts."
  },
  {
    "english": "collision",
    "chinese": "碰撞; (对立意见、看法等之间的)冲突",
    "example": "The collision of two armies outside the city walls led to massive destruction."
  },
  {
    "english": "primitive",
    "chinese": "原始的;落后的",
    "example": "Primitive siege weapons like catapults were used to breach the city's defenses."
  },
  {
    "english": "accumulation",
    "chinese": "积累;积聚",
    "example": "An accumulation of debris from previous sieges surrounded the base of the city walls."
  },
  {
    "english": "particle",
    "chinese": "颗粒;粒子",
    "example": "Dust particles in the air indicated the approaching army's massive size."
  }
]