[
  {
    "english": "high protein",
    "chinese": "高蛋白质",
    "example": "Foods like quinoa and lentils are excellent sources of high protein for vegetarians."
  },
  {
    "english": "supply sb. with sth.",
    "chinese": "给某人提供",
    "example": "Local farms supply restaurants with fresh produce daily to ensure quality."
  },
  {
    "english": "proteins and nutrients",
    "chinese": "蛋白质和营养",
    "example": "A balanced diet should include a mix of proteins and nutrients for overall health."
  },
  {
    "english": "be infested with",
    "chinese": "充斥着",
    "example": "The old barn was infested with rodents, requiring immediate pest control."
  },
  {
    "english": "be susceptible to",
    "chinese": "容易受到……的影响",
    "example": "Young plants are susceptible to frost, so gardeners must protect them at night."
  },
  {
    "english": "pose health risks to",
    "chinese": "对健康构成威胁",
    "example": "Air pollution from factories poses serious health risks to nearby communities."
  },
  {
    "english": "scientific breakthrough",
    "chinese": "科学突破",
    "example": "The development of drought-resistant crops was a major scientific breakthrough for agriculture."
  },
  {
    "english": "steps can be taken to do sth.",
    "chinese": "句式：可以采取措施做某事",
    "example": "Steps can be taken to reduce plastic waste, such as using reusable shopping bags."
  },
  {
    "english": "life cycle",
    "chinese": "生命周期",
    "example": "Understanding the frog's life cycle helps students learn about amphibian development."
  },
  {
    "english": "undertake intense efforts",
    "chinese": "采取密集的努力",
    "example": "Researchers are undertaking intense efforts to find a cure for the rare disease."
  },
  {
    "english": "pose a challenge to",
    "chinese": "对……是一个挑战",
    "example": "Urbanization poses a significant challenge to wildlife habitats in the region."
  },
  {
    "english": "digestive system",
    "chinese": "消化系统",
    "example": "Eating too quickly can strain the digestive system and cause discomfort."
  },
  {
    "english": "be well adapted for",
    "chinese": "非常适应",
    "example": "Camels are well adapted for living in desert environments with little water."
  },
  {
    "english": "be indifferent to",
    "chinese": "对……冷漠",
    "example": "Some species appear indifferent to environmental changes, while others are highly sensitive."
  },
  {
    "english": "resort to measures",
    "chinese": "采取措施",
    "example": "During droughts, farmers may resort to water conservation measures to protect crops."
  },
  {
    "english": "obstacle to",
    "chinese": "是……的障碍",
    "example": "Lack of access to education is a major obstacle to poverty reduction."
  },
  {
    "english": "sb.'s heavy reliance on",
    "chinese": "某人非常依赖于",
    "example": "The region's heavy reliance on tourism makes its economy vulnerable to global pandemics."
  },
  {
    "english": "give birth to",
    "chinese": "生产；生育",
    "example": "Female kangaroos give birth to relatively underdeveloped young, which continue to grow in the pouch."
  },
  {
    "english": "feed on",
    "chinese": "以……为食",
    "example": "Blue whales feed on tiny shrimp-like creatures called krill in the ocean."
  },
  {
    "english": "be confined to",
    "chinese": "限制在；受限于",
    "example": "The forest fire was confined to a small area thanks to rapid firefighting efforts."
  },
  {
    "english": "attach to",
    "chinese": "附着于；连接到",
    "example": "Barnacles attach to the hulls of ships, which can affect their speed and fuel efficiency."
  },
  {
    "english": "it turns out that",
    "chinese": "结果是；证明是",
    "example": "It turns out that the mysterious footprints were made by a rare species of bird."
  },
  {
    "english": "a quick fix",
    "chinese": "临时解决方案",
    "example": "Using duct tape to repair a leak is a quick fix, but a permanent solution is needed."
  },
  {
    "english": "to illustrate",
    "chinese": "说明；举例说明",
    "example": "To illustrate, consider how climate change affects the migration patterns of birds."
  },
  {
    "english": "periodic cycle",
    "chinese": "周期性循环",
    "example": "The moon's phases follow a periodic cycle of approximately 29.5 days."
  },
  {
    "english": "face criticisms",
    "chinese": "面临批评",
    "example": "The fashion industry often faces criticisms for its environmental impact and waste production."
  },
  {
    "english": "lay eggs",
    "chinese": "产卵",
    "example": "Turtles come to the shore at night to lay eggs in the sand."
  },
  {
    "english": "keep...going",
    "chinese": "使...维持运转",
    "example": "Regular maintenance is needed to keep the old machinery going smoothly."
  },
  {
    "english": "remain profitable",
    "chinese": "保持盈利",
    "example": "Retailers must adapt to online shopping trends to remain profitable in the digital age."
  },
  {
    "english": "off the coast of...",
    "chinese": "...海岸外",
    "example": "A new coral reef was discovered off the coast of Belize by marine biologists."
  },
  {
    "english": "slow...growth",
    "chinese": "减缓生长",
    "example": "Excessive use of herbicides can slow plant growth and reduce crop yields."
  },
  {
    "english": "promising solutions",
    "chinese": "有希望的解决方案",
    "example": "Solar power and wind energy are promising solutions for reducing carbon emissions."
  },
  {
    "english": "be stocked with",
    "chinese": "储存",
    "example": "Hiking backpacks should be stocked with water, snacks, and emergency supplies."
  },
  {
    "english": "this may soon no longer be the case",
    "chinese": "句式：可能很快就会不再如此",
    "example": "Currently, the species is abundant, but this may soon no longer be the case due to habitat loss."
  },
  {
    "english": "inject sth. with sth.",
    "chinese": "给某物注入某物",
    "example": "Farmers inject the soil with organic matter to improve its fertility."
  },
  {
    "english": "address the obstacle",
    "chinese": "解决障碍",
    "example": "Building bridges can help address the obstacle of crossing large rivers in remote areas."
  },
  {
    "english": "respond to the concern of",
    "chinese": "回应…的关切",
    "example": "The company changed its policy to respond to the concern of customer safety."
  },
  {
    "english": "farther offshore",
    "chinese": "离岸更远",
    "example": "Fishermen had to go farther offshore to find schools of fish this season."
  },
  {
    "english": "a rare species",
    "chinese": "稀有物种",
    "example": "Conservationists are working to protect a rare species of orchid from extinction."
  },
  {
    "english": "evolve from",
    "chinese": "从……进化而来",
    "example": "Modern computers have evolved from large, room-sized machines of the past."
  },
  {
    "english": "be suited for",
    "chinese": "适合于",
    "example": "The dry climate of the region is well suited for growing crops like wheat and barley."
  },
  {
    "english": "increase the risk of",
    "chinese": "增加...的风险",
    "example": "Smoking increases the risk of various health problems, including lung disease."
  },
  {
    "english": "be receptive to",
    "chinese": "乐于接受",
    "example": "The community was receptive to the idea of building a new public park."
  },
  {
    "english": "be complicated by",
    "chinese": "被复杂化",
    "example": "The project was complicated by unexpected delays in material delivery."
  },
  {
    "english": "attempt to do",
    "chinese": "试图做某事",
    "example": "Scientists attempt to predict weather patterns using complex computer models."
  },
  {
    "english": "resort to",
    "chinese": "诉诸，求助于",
    "example": "During the drought, the town had to resort to importing water from a neighboring region."
  },
  {
    "english": "die-off and regrowth",
    "chinese": "死亡与再生",
    "example": "Forest fires can lead to die-off and regrowth cycles that rejuvenate ecosystems."
  },
  {
    "english": "the heavy reliance on",
    "chinese": "对…的严重依赖",
    "example": "The heavy reliance on fossil fuels has contributed to global climate change."
  },
  {
    "english": "pose a significant threat to",
    "chinese": "对……构成重大威胁",
    "example": "Invasive species can pose a significant threat to native wildlife and ecosystems."
  }
]