[
  {
    "english": "people should prioritize a better breakfast",
    "chinese": "人们应该优先考虑更好的早餐",
    "example": "People should prioritize a better breakfast to start their day with sufficient energy."
  },
  {
    "english": "rush through their mornings",
    "chinese": "匆忙度过他们的早晨",
    "example": "Many rush through their mornings, leading to poor breakfast choices or skipping it entirely."
  },
  {
    "english": "grab quick, unhealthy options",
    "chinese": "随便拿些不健康的食物",
    "example": "In a hurry, they often grab quick, unhealthy options like sugary cereals or pastries."
  },
  {
    "english": "skip breakfast entirely",
    "chinese": "完全不吃早餐",
    "example": "Some even skip breakfast entirely due to time constraints in the morning."
  },
  {
    "english": "a well-balanced morning meal",
    "chinese": "均衡的早餐",
    "example": "A well-balanced morning meal can significantly boost daily productivity and focus."
  },
  {
    "english": "offer significant long-term benefits",
    "chinese": "提供显著的长期益处",
    "example": "Prioritizing a nutritious breakfast offers significant long-term benefits for overall health."
  },
  {
    "english": "boost energy levels throughout the day",
    "chinese": "提高全天的能量水平",
    "example": "Protein-rich foods in breakfast help boost energy levels throughout the day."
  },
  {
    "english": "facilitate improved focus and productivity",
    "chinese": "有助于提高注意力和工作效率",
    "example": "A balanced breakfast facilitates improved focus and productivity in both work and study."
  },
  {
    "english": "when this important meal is skipped",
    "chinese": "当跳过这一重要的餐时",
    "example": "When this important meal is skipped, people often experience mid-morning energy crashes."
  },
  {
    "english": "efficiency often diminishes",
    "chinese": "效率通常会下降",
    "example": "Without breakfast, efficiency often diminishes, and tasks take longer to complete."
  },
  {
    "english": "feel too weak to concentrate",
    "chinese": "感觉太虚弱无法集中注意力",
    "example": "Many feel too weak to concentrate in meetings or classes after skipping breakfast."
  },
  {
    "english": "experienced constant sluggishness",
    "chinese": "经常感到无精打采",
    "example": "She experienced constant sluggishness until she started eating a proper breakfast daily."
  },
  {
    "english": "difficulty concentrating in her morning classes",
    "chinese": "很难集中精力在她的早课",
    "example": "The student faced difficulty concentrating in her morning classes due to skipping breakfast."
  },
  {
    "english": "a balanced breakfast, which comprises oatmeal, fruit, and eggs",
    "chinese": "均衡的早餐包括燕麦、水果和鸡蛋",
    "example": "A balanced breakfast, which comprises oatmeal, fruit, and eggs, provides essential nutrients."
  },
  {
    "english": "dramatic improvement in her energy levels",
    "chinese": "她的能量水平显著提高",
    "example": "There was a dramatic improvement in her energy levels after adopting a healthy breakfast routine."
  },
  {
    "english": "reconsider their morning routines",
    "chinese": "重新考虑他们的早晨习惯",
    "example": "Many are now starting to reconsider their morning routines and prioritize breakfast."
  },
  {
    "english": "incorporate a nutritious breakfast",
    "chinese": "加入营养丰富的早餐",
    "example": "They aim to incorporate a nutritious breakfast to reap its health benefits."
  },
  {
    "english": "reap its long-term benefits",
    "chinese": "获得其长期的益处",
    "example": "Consistently eating a good breakfast allows one to reap its long-term benefits."
  },
  {
    "english": "most people should abandon processed foods",
    "chinese": "大多数人应该放弃加工食品",
    "example": "For better health, most people should abandon processed foods in favor of whole ingredients."
  },
  {
    "english": "opt for fresh, whole ingredients",
    "chinese": "选择新鲜、完整的食材",
    "example": "Opt for fresh, whole ingredients like vegetables, whole grains, and lean proteins for breakfast."
  },
  {
    "english": "processed foods are often convenient and quick to prepare",
    "chinese": "加工食品通常方便且易于准备",
    "example": "Processed foods are often convenient and quick to prepare, appealing to busy individuals."
  },
  {
    "english": "high in unhealthy fats, sugars, and sodium",
    "chinese": "含有大量不健康的脂肪、糖和钠",
    "example": "However, they are often high in unhealthy fats, sugars, and sodium, harmful for long-term health."
  },
  {
    "english": "lead to weight gain, high blood pressure, and other health issues",
    "chinese": "导致体重增加、高血压和其他健康问题",
    "example": "Regular consumption can lead to weight gain, high blood pressure, and other health issues."
  },
  {
    "english": "fresh, whole foods provide essential nutrients",
    "chinese": "新鲜、完整的食物提供必要的营养",
    "example": "Fresh, whole foods provide essential nutrients that processed foods often lack."
  },
  {
    "english": "support overall well-being",
    "chinese": "促进整体健康",
    "example": "These nutrients support overall well-being and help maintain a healthy lifestyle."
  },
  {
    "english": "reduce the risk of chronic diseases",
    "chinese": "降低慢性病的风险",
    "example": "A diet rich in whole foods can reduce the risk of chronic diseases like diabetes and heart problems."
  },
  {
    "english": "long-term health benefits",
    "chinese": "长期健康益处",
    "example": "Investing in a nutritious breakfast today ensures long-term health benefits for the future."
  },
  {
    "english": "used to rely heavily on packaged snacks",
    "chinese": "过去非常依赖包装零食",
    "example": "She used to rely heavily on packaged snacks for breakfast before realizing their drawbacks."
  },
  {
    "english": "ready-made meals during my busy workweeks",
    "chinese": "繁忙工作周期间的现成餐食",
    "example": "He relied on ready-made meals during his busy workweeks but now prioritizes fresh breakfasts."
  }
]