[
  {
    "english": "often hit by asteroids",
    "chinese": "经常被小行星撞击",
    "example": "The Moon is often hit by asteroids, leaving countless craters on its surface."
  },
  {
    "english": "a swirled blue marble",
    "chinese": "旋转的蓝色弹珠",
    "example": "From space, Earth appears as a swirled blue marble surrounded by a thin atmosphere."
  },
  {
    "english": "not be without challenges",
    "chinese": "有挑战",
    "example": "Establishing a lunar base would be groundbreaking, but it's not be without challenges like radiation and resource scarcity."
  },
  {
    "english": "set up a permanent station",
    "chinese": "设立一个永久的空间站",
    "example": "NASA plans to set up a permanent station on the Moon under the Artemis program."
  },
  {
    "english": "float in……",
    "chinese": "漂浮",
    "example": "Astronauts float in the microgravity environment of the International Space Station."
  },
  {
    "english": "stand on……surface",
    "chinese": "立在……的表面",
    "example": "Astronauts first stood on the Moon's surface during the Apollo 11 mission in 1969."
  },
  {
    "english": "maintain a permanent human presence",
    "chinese": "维持人类的永久存在",
    "example": "Scientists are researching ways to maintain a permanent human presence on Mars for future colonization."
  },
  {
    "english": "conditions on Venus",
    "chinese": "金星的条件",
    "example": "Conditions on Venus are extremely harsh, with temperatures exceeding 460°C and crushing atmospheric pressure."
  },
  {
    "english": "atmospheric pressure at Venus’ surface",
    "chinese": "金星表面的气压",
    "example": "The atmospheric pressure at Venus’ surface is about 92 times that of Earth, enough to crush most spacecraft."
  },
  {
    "english": "press down on",
    "chinese": "压在...上",
    "example": "The heavy spacecraft would press down on the Martian surface, requiring a stable landing site."
  },
  {
    "english": "land on",
    "chinese": "降落",
    "example": "China's Zhurong rover successfully landed on Mars in 2021, marking a major milestone in space exploration."
  },
  {
    "english": "physical fact",
    "chinese": "物理现象",
    "example": "The curvature of Earth is a physical fact observable from high-altitude flights."
  },
  {
    "english": "sulfuric acid",
    "chinese": "硫酸",
    "example": "Venus' clouds are composed of sulfuric acid, making the planet's atmosphere highly corrosive."
  },
  {
    "english": "make up of",
    "chinese": "由……组成",
    "example": "Jupiter's atmosphere is mainly made up of hydrogen and helium gases."
  },
  {
    "english": "reservoirs of water",
    "chinese": "水库",
    "example": "Scientists have discovered underground reservoirs of water on the Moon, which could support future colonies."
  },
  {
    "english": "supply from……",
    "chinese": "从……供应",
    "example": "The ISS receives regular supply from Earth, including food, fuel, and scientific equipment."
  },
  {
    "english": "a regular supply of……",
    "chinese": "对……常规供应",
    "example": "Establishing a lunar base would require a regular supply of oxygen and water for astronauts."
  },
  {
    "english": "a feasible idea",
    "chinese": "一个可行的主意",
    "example": "Using 3D printing to build lunar habitats is a feasible idea for reducing costs in space colonization."
  },
  {
    "english": "in the extreme",
    "chinese": "极其",
    "example": "The environment on Pluto is in the extreme, with temperatures dropping to -229°C."
  },
  {
    "english": "reach the planet's surface",
    "chinese": "到达表面",
    "example": "Only a few spacecraft have successfully reached the planet's surface of Venus due to its harsh conditions."
  },
  {
    "english": "hit the planet",
    "chinese": "照射到行星上",
    "example": "Solar winds continuously hit the planet, stripping away its atmosphere over time."
  },
  {
    "english": "reflect sunlight",
    "chinese": "反射光线",
    "example": "Clouds on Venus reflect sunlight, making the planet one of the brightest in the night sky."
  },
  {
    "english": "get through the clouds",
    "chinese": "穿过云层",
    "example": "RADAR instruments can get through the clouds of Venus to map its surface."
  },
  {
    "english": "prevent the use of……",
    "chinese": "阻止……使用",
    "example": "The thick atmosphere of Venus prevents the use of optical telescopes for surface observations."
  },
  {
    "english": "located high",
    "chinese": "处于比较高的位置",
    "example": "The James Webb Space Telescope is located high in orbit to avoid Earth's atmospheric interference."
  },
  {
    "english": "be equal to",
    "chinese": "相等",
    "example": "The gravitational pull on Mars is about 38% be equal to that on Earth."
  },
  {
    "english": "easily obtain from……",
    "chinese": "从……中轻易得到",
    "example": "Oxygen can be easily obtained from lunar soil through a process called oxygen reduction."
  },
  {
    "english": "filter through",
    "chinese": "透过，滤过",
    "example": "Only a small amount of sunlight can filter through Venus' dense cloud cover."
  },
  {
    "english": "power the station",
    "chinese": "供能空间站",
    "example": "Solar panels are used to power the station, converting sunlight into electricity."
  },
  {
    "english": "respond to",
    "chinese": "回应",
    "example": "Astronauts must respond to emergencies quickly to ensure the safety of the space station."
  },
  {
    "english": "a considerable amount of",
    "chinese": "相当数量的",
    "example": "Building a lunar base would require a considerable amount of resources and international cooperation."
  },
  {
    "english": "harvest from……",
    "chinese": "从……收获",
    "example": "Scientists are researching how to harvest water from lunar polar ice deposits."
  },
  {
    "english": "a large percentage of",
    "chinese": "大量的",
    "example": "A large percentage of Earth's atmosphere is composed of nitrogen and oxygen."
  },
  {
    "english": "be willing to",
    "chinese": "愿意做",
    "example": "Many countries are willing to collaborate on international space projects for mutual benefit."
  },
  {
    "english": "from year to year",
    "chinese": "逐年",
    "example": "The number of space missions has increased from year to year as technology advances."
  },
  {
    "english": "cover their past investment",
    "chinese": "覆盖他们过去的投资",
    "example": "The company hopes the new product will cover their past investment in research and development."
  },
  {
    "english": "switch to",
    "chinese": "转向，切换到",
    "example": "The space agency plans to switch to reusable rockets to reduce launch costs."
  },
  {
    "english": "a variety of",
    "chinese": "各种各样的",
    "example": "A variety of scientific experiments are conducted on the International Space Station."
  },
  {
    "english": "remain sustainable",
    "chinese": "保持可持续的",
    "example": "To remain sustainable, lunar colonies must rely on local resources rather than constant resupply from Earth."
  },
  {
    "english": "put……in place",
    "chinese": "落实到位",
    "example": "Strict safety protocols must be put in place for any human space mission."
  },
  {
    "english": "identification codes",
    "chinese": "识别码",
    "example": "Each piece of space equipment has unique identification codes for tracking and maintenance."
  },
  {
    "english": "face up to",
    "chinese": "直面",
    "example": "Scientists must face up to the challenges of climate change to protect our planet."
  },
  {
    "english": "substitute……with",
    "chinese": "用……代替……",
    "example": "Astronauts may substitute traditional farming with hydroponics to grow food in space."
  },
  {
    "english": "in favor of",
    "chinese": "喜欢",
    "example": "Many engineers prefer reusable rockets in favor of single-use ones for cost efficiency."
  },
  {
    "english": "This set of materials",
    "chinese": "这套材料",
    "example": "This set of materials is designed to withstand the extreme temperatures of space."
  },
  {
    "english": "proposes a quick fix",
    "chinese": "提出一个权宜之计",
    "example": "The report proposes a quick fix for the space station's oxygen system until a permanent solution is developed."
  },
  {
    "english": "be replaced by",
    "chinese": "被……所替代",
    "example": "Traditional space suits may be replaced by advanced exoskeletons for future deep-space missions."
  },
  {
    "english": "in accordance with",
    "chinese": "根据",
    "example": "The space mission was planned in accordance with international space law and regulations."
  },
  {
    "english": "dislike artificial ingredients",
    "chinese": "不喜欢人造成分",
    "example": "Some astronauts dislike artificial ingredients in space food and prefer fresh produce grown onboard."
  },
  {
    "english": "encounter some difficulties",
    "chinese": "遇到一些困难",
    "example": "The Mars rover encountered some difficulties navigating through the rocky terrain."
  }
]