[
  {
    "english": "modern iconic attractions",
    "chinese": "现代标志性景点",
    "example": "Modern iconic attractions like Universal Studios combine technology and entertainment for unique experiences."
  },
  {
    "english": "become increasingly popular",
    "chinese": "越来越受欢迎",
    "example": "Historical theme parks have become increasingly popular among young travelers seeking cultural experiences."
  },
  {
    "english": "an exciting and immersive experience",
    "chinese": "一次激动人心的沉浸式体验",
    "example": "Visiting the digital art exhibition provided an exciting and immersive experience of modern creativity."
  },
  {
    "english": "historical heritage",
    "chinese": "历史遗产",
    "example": "Preserving historical heritage like the Pyramids is crucial for understanding human civilization."
  },
  {
    "english": "contribute to...",
    "chinese": "有助于...",
    "example": "Cultural festivals contribute to promoting local traditions and boosting tourism."
  },
  {
    "english": "offer a glimpse into",
    "chinese": "提供对…的一瞥",
    "example": "Ancient manuscripts offer a glimpse into the daily lives of people from past dynasties."
  },
  {
    "english": "the evolution of society and human civilization",
    "chinese": "社会和人类文明的进化",
    "example": "Museum exhibits often illustrate the evolution of society and human civilization through artifacts."
  },
  {
    "english": "provide exposure to history and culture",
    "chinese": "提供接触历史和文化的机会",
    "english": "provide exposure to history and culture",
    "chinese": "提供接触历史和文化的机会",
    "example": "School trips to historical sites provide exposure to history and culture for students."
  },
  {
    "english": "witness the impact of historical events",
    "chinese": "见证历史事件的影响",
    "example": "The preserved battlefield allows visitors to witness the impact of historical events firsthand."
  },
  {
    "english": "the current development of technology",
    "chinese": "当前的技术发展",
    "example": "Modern iconic attractions often showcase the current development of technology in entertainment."
  },
  {
    "english": "boost imagination and creativity",
    "chinese": "提升想象力和创造力",
    "example": "Interactive science museums are designed to boost imagination and creativity in children."
  },
  {
    "english": "it is essential to note that",
    "chinese": "句式：有必要指出的是",
    "example": "It is essential to note that historical heritage sites require regular maintenance to stay accessible."
  },
  {
    "english": "notable historical figures",
    "chinese": "著名的历史人物",
    "example": "Biopics often feature notable historical figures who shaped national histories."
  },
  {
    "english": "shape our understanding of the world",
    "chinese": "塑造我们对世界的理解",
    "example": "Studying different cultures helps shape our understanding of the world and its diversity."
  },
  {
    "english": "contrary to the common belief",
    "chinese": "与普遍的看法相反",
    "example": "Contrary to the common belief, many modern attractions also incorporate historical elements in their design."
  },
  {
    "english": "visually engaging and appealing",
    "chinese": "视觉上很有吸引力",
    "example": "The light show at the Forbidden City was visually engaging and appealing to international tourists."
  },
  {
    "english": "see historical landmarks",
    "chinese": "参观历史地标",
    "example": "Tourists often plan trips to see historical landmarks like the Great Wall during their visit to China."
  },
  {
    "english": "offer a variety of amenities for tourists",
    "chinese": "为游客提供各种便利设施",
    "example": "Modern theme parks offer a variety of amenities for tourists, from restaurants to interactive rides."
  },
  {
    "english": "spur local economic growth",
    "chinese": "刺激当地经济增长",
    "example": "The opening of a new iconic attraction can spur local economic growth through increased tourism."
  },
  {
    "english": "promote cultural and historical tourism",
    "chinese": "促进文化和历史旅游",
    "example": "Cultural festivals effectively promote cultural and historical tourism in rural areas."
  },
  {
    "english": "a fulfilling experience",
    "chinese": "令人满足的经历",
    "example": "Exploring ancient ruins can be a fulfilling experience for history enthusiasts."
  },
  {
    "english": "tear down old buildings",
    "chinese": "拆除旧建筑",
    "example": "Cities should avoid tearing down old buildings with historical value for modern development."
  },
  {
    "english": "the Forbidden City",
    "chinese": "故宫",
    "example": "The Forbidden City attracts millions of visitors each year with its rich historical heritage."
  },
  {
    "english": "Universal Studios",
    "chinese": "环球影城",
    "example": "Universal Studios creates an exciting and immersive experience through movie-themed attractions."
  },
  {
    "english": "the Pyramid",
    "chinese": "金字塔",
    "example": "The Pyramid in Egypt offers a glimpse into ancient Egyptian civilization and architecture."
  },
  {
    "english": "tourist destination",
    "chinese": "旅游目的地",
    "example": "Paris is a popular tourist destination known for both modern attractions and historical heritage."
  },
  {
    "english": "the ignorance of historical heritage",
    "chinese": "对历史遗产的无知",
    "example": "The ignorance of historical heritage can lead to the loss of valuable cultural resources."
  },
  {
    "english": "an enriching experience",
    "chinese": "一种丰富的体验",
    "example": "Learning about different cultures through travel is an enriching experience for students."
  },
  {
    "english": "provide a connection to the past",
    "chinese": "提供与过去的联系",
    "example": "Antique museums provide a connection to the past through preserved artifacts."
  },
  {
    "english": "it is of great significance to do sth.",
    "chinese": "句式：做某事有重要意义",
    "example": "It is of great significance to educate youth about historical heritage preservation."
  },
  {
    "english": "offer a vibrant and exciting atmosphere",
    "chinese": "提供充满活力和令人兴奋的氛围",
    "example": "Modern city squares often offer a vibrant and exciting atmosphere for social gatherings."
  },
  {
    "english": "a vast array of",
    "chinese": "大量的",
    "example": "The exhibition featured a vast array of historical documents and artworks."
  },
  {
    "english": "as XX has stated",
    "chinese": "正如XX所说",
    "example": "As the historian has stated, historical heritage is the root of cultural identity."
  },
  {
    "english": "highlight the progress humans have made",
    "chinese": "突出人类取得的进步",
    "example": "Science museums are designed to highlight the progress humans have made in technology."
  },
  {
    "english": "It is/was…that...",
    "chinese": "句式：突出强调的内容",
    "example": "It is the blend of history and modernity that makes this city a unique tourist destination."
  },
  {
    "english": "considering the contrasting characteristics of A and B",
    "chinese": "考虑到A和B截然不同的特点",
    "example": "Considering the contrasting characteristics of modern and historical attractions, both play vital roles in tourism."
  },
  {
    "english": "an entertaining atmosphere",
    "chinese": "娱乐的氛围",
    "example": "Amusement parks are designed to create an entertaining atmosphere for families."
  },
  {
    "english": "appreciate the historical heritage",
    "chinese": "欣赏文化遗产",
    "example": "Travelers often visit ancient temples to appreciate the historical heritage and architecture."
  },
  {
    "english": "the greatness of diverse cultures",
    "chinese": "多元文化的伟大之处",
    "example": "The World Expo showcases the greatness of diverse cultures from around the globe."
  },
  {
    "english": "gain a more comprehensive and holistic understanding of",
    "chinese": "更全面的了解",
    "example": "Studying both modern and historical aspects helps gain a more comprehensive understanding of a society."
  },
  {
    "english": "compared with",
    "chinese": "与...相比",
    "example": "Compared with traditional museums, digital exhibitions offer more interactive experiences."
  },
  {
    "english": "cultural diversity",
    "chinese": "文化多样性",
    "example": "Celebrating cultural festivals promotes cultural diversity and mutual understanding."
  },
  {
    "english": "with regard to humanity and civilization",
    "chinese": "关于人性和文明",
    "example": "Historical novels often explore themes with regard to humanity and civilization development."
  },
  {
    "english": "current development of human society",
    "chinese": "人类社会的发展现状",
    "example": "Art exhibitions often reflect the current development of human society and its values."
  },
  {
    "english": "renovations of historical buildings",
    "chinese": "历史建筑的翻新",
    "example": "Renovations of historical buildings should balance preservation and modern functionality."
  },
  {
    "english": "offer valuable insights into the past",
    "chinese": "提供对过去的宝贵见解",
    "example": "Archaeological findings offer valuable insights into the past lifestyles of ancient civilizations."
  },
  {
    "english": "a subset of",
    "chinese": "一部分",
    "example": "Modern art museums are a subset of cultural institutions that reflect contemporary creativity."
  },
  {
    "english": "promote local economic growth",
    "chinese": "促进当地经济增长",
    "example": "Developing cultural tourism can effectively promote local economic growth in heritage-rich areas."
  },
  {
    "english": "bring considerable economic benefits",
    "chinese": "带来可观的经济效益",
    "example": "Hosting international events can bring considerable economic benefits to a city."
  }
]