[
  {
    "english": "fail to provide an accurate representation",
    "chinese": "未能准确代表",
    "example": "Social media posts often fail to provide an accurate representation of a candidate's professional abilities or work ethic."
  },
  {
    "english": "a candidate's professional abilities or work ethic",
    "chinese": "一位候选人的专业能力或职业道德",
    "example": "Evaluating a candidate's professional abilities or work ethic requires more than just reviewing their social media."
  },
  {
    "english": "share everyday aspects of their lives",
    "chinese": "分享他们日常生活的方面",
    "example": "Many job applicants share everyday aspects of their lives on social media, which may have little relevance to their job skills."
  },
  {
    "english": "have little relevance to their job skills",
    "chinese": "与他们的工作技能几乎没有关系",
    "example": "Posts about weekend hobbies often have little relevance to their job skills and professional qualifications."
  },
  {
    "english": "introduce a policy of reviewing applicants' social media profiles",
    "chinese": "推出了一项审查申请者社交媒体资料的政策",
    "example": "Some companies introduce a policy of reviewing applicants' social media profiles to form a more comprehensive view."
  },
  {
    "english": "aim to form a more comprehensive view",
    "chinese": "旨在形成更全面的看法",
    "example": "Recruiters aim to form a more comprehensive view of candidates by checking their online presence."
  },
  {
    "english": "the results were underwhelming",
    "chinese": "结果令人失望",
    "example": "After analyzing social media, the results were underwhelming in terms of assessing professional competence."
  },
  {
    "english": "spend a significant amount of time",
    "chinese": "花费了大量时间",
    "example": "HR teams spend a significant amount of time analyzing candidates’ posts for relevant traits."
  },
  {
    "english": "analyze candidates’ posts",
    "chinese": "分析候选人的帖子",
    "example": "Recruiters analyze candidates’ posts to look for clues about their personality and values."
  },
  {
    "english": "focus on personal interests",
    "chinese": "关注个人兴趣",
    "example": "Most social media posts focus on personal interests rather than professional achievements."
  },
  {
    "english": "minimal insight into the applicants' professional qualifications",
    "chinese": "对申请者的职业资质几乎没有见解",
    "example": "Reviewing social media often provides minimal insight into the applicants' professional qualifications."
  },
  {
    "english": "professional competence",
    "chinese": "专业能力",
    "example": "Interviews remain the best way to assess a candidate's professional competence."
  },
  {
    "english": "underscore the gap between",
    "chinese": "突显了……之间的差距",
    "example": "Relying on social media underscores the gap between online persona and real-world work ethic."
  },
  {
    "english": "a fair and effective practice",
    "chinese": "一种公平且有效的做法",
    "example": "Many argue that reviewing social media is not a fair and effective practice for evaluating candidates."
  },
  {
    "english": "this can reveal key traits",
    "chinese": "这可以揭示关键特质",
    "example": "Authentic social media content can reveal key traits that may not surface in interviews."
  },
  {
    "english": "may not surface in interviews",
    "chinese": "可能在面试中不会显现",
    "example": "Certain personality aspects may not surface in interviews but can be seen in social media posts."
  },
  {
    "english": "express their personality, values, and behavior",
    "chinese": "表达他们的个性、价值观和行为",
    "example": "Social media allows candidates to express their personality, values, and behavior naturally."
  },
  {
    "english": "affect how well they fit into a company",
    "chinese": "影响他们与公司契合的程度",
    "english example": "These traits can affect how well they fit into a company's culture and team dynamics."
  },
  {
    "english": "cause employers to see them as a better fit",
    "chinese": "让雇主认为他们更适合",
    "example": "Positive posts about teamwork can cause employers to see them as a better fit for a collaborative workplace."
  },
  {
    "english": "for a collaborative workplace",
    "chinese": "对于一个协作的工作环境",
    "example": "Team-oriented posts are particularly valuable for a collaborative workplace."
  },
  {
    "english": "inappropriate posts or aggressive behavior",
    "chinese": "不当的帖子或攻击性行为",
    "example": "Inappropriate posts or aggressive behavior online can harm a candidate's chances."
  },
  {
    "english": "lead employers to question",
    "chinese": "导致雇主质疑",
    "example": "Controversial content can lead employers to question a candidate's professionalism."
  },
  {
    "english": "harm the company’s reputation",
    "chinese": "损害公司的声誉",
    "example": "Hiring someone with problematic posts could potentially harm the company’s reputation."
  },
  {
    "english": "reviewing social media helps employers",
    "chinese": "审查社交媒体帮助雇主",
    "example": "Reviewing social media helps employers identify red flags or confirm positive qualities."
  },
  {
    "english": "identify red flags or confirm positive qualities",
    "chinese": "识别潜在问题或确认积极品质",
    "example": "It allows them to identify red flags or confirm positive qualities that align with company values."
  },
  {
    "english": "align with the company culture",
    "chinese": "与公司文化保持一致",
    "example": "Candidates who align with the company culture are more likely to thrive in their roles."
  }
]